#pragma once

// ARKSurvivalEvolved (301.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_ShooterGame_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ShooterGame.PrimalGlobals
// 0x0130 (0x0158 - 0x0028)
class UPrimalGlobals : public UObject
{
public:
	class UPrimalGameData*                             PrimalGameData;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPrimalGameData*                             PrimalGameDataOverride;                                   // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FStringAssetReference                       PrimalGameDataAsset;                                      // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FStringAssetReference>               PrimalGameDataAssetExtended;                              // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      RagdollKinematicActorClass;                               // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      GlobalGenericConfirmationDialog;                          // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowSingleplayer;                                       // 0x0068(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowNonDedicatedHost;                                   // 0x0069(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x006A(0x0006) MISSED OFFSET
	TArray<class FString>                              UIOnlyShowMapFileNames;                                   // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              UIOnlyShowModIDs;                                         // 0x0080(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bTotalConversionShowUnofficialServers;                    // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	class FString                                      CreditString;                                             // 0x0098(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0xB0];                                      // 0x00A8(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalGlobals");
		return ptr;
	}


	void OnConfirmationDialogClosed(bool bAccept);
	class ADayCycleManager* GetDayCycleManager(class UWorld* World);
	void FinishedLoadingGameMedia();
};


// Class ShooterGame.DataListProviderInterface
// 0x0000 (0x0028 - 0x0028)
class UDataListProviderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListProviderInterface");
		return ptr;
	}

};


// Class ShooterGame.PrimalGameData
// 0x1ED0 (0x1EF8 - 0x0028)
class UPrimalGameData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0028(0x0030) MISSED OFFSET
	class FString                                      ModName;                                                  // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ModDescription;                                           // 0x0068(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FPrimalCharacterStatusValueDefinition       StatusValueDefinitions[0xC];                              // 0x0078(0x0020) (Edit, DisableEditOnInstance)
	struct FPrimalCharacterStatusStateDefinition       StatusStateDefinitions[0xE];                              // 0x01F8(0x0050) (Edit, DisableEditOnInstance)
	struct FPrimalItemStatDefinition                   ItemStatDefinitions[0x8];                                 // 0x0658(0x0018) (Edit, DisableEditOnInstance)
	struct FPrimalItemDefinition                       ItemTypeDefinitions[0x9];                                 // 0x0718(0x0018) (Edit, DisableEditOnInstance)
	struct FPrimalEquipmentDefinition                  EquipmentTypeDefinitions[0xB];                            // 0x07F0(0x0018) (Edit, DisableEditOnInstance)
	TArray<class UClass*>                              MasterItemList;                                           // 0x08F8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FPrimalItemQuality>                  ItemQualityDefinitions;                                   // 0x0908(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              EngramBlueprintClasses;                                   // 0x0918(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AdditionalEngramBlueprintClasses;                         // 0x0928(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              RemoveEngramBlueprintClasses;                             // 0x0938(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FStatusValueModifierDescription>     StatusValueModifierDescriptions;                          // 0x0948(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              PlayerSpawnRegions;                                       // 0x0958(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  TutorialDisplaySound;                                     // 0x0968(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StartItemDrag;                                      // 0x0970(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StopItemDrag;                                       // 0x0978(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_CancelPlacingStructure;                             // 0x0980(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ChooseStructureRotation;                            // 0x0988(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_FailPlacingStructure;                               // 0x0990(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ConfirmPlacingStructure;                            // 0x0998(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StartPlacingStructure;                              // 0x09A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_CorpseDecompose;                                    // 0x09A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyLevelUp;                                       // 0x09B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyLevelPoint;                                    // 0x09B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_LearnedEngram;                                      // 0x09C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ReconnectToCharacter;                               // 0x09C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_DropAllItems;                                       // 0x09D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferAllItemsToRemote;                           // 0x09D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferAllItemsFromRemote;                         // 0x09E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferItemToRemote;                               // 0x09E8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferItemFromRemote;                             // 0x09F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddItemToSlot;                                      // 0x09F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemoveItemFromSlot;                                 // 0x0A00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ClearCraftQueue;                                    // 0x0A08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddToCraftQueue;                                    // 0x0A10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SetRadioFrequency;                                  // 0x0A18(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddPinToMap;                                        // 0x0A20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemovePinFromMap;                                   // 0x0A28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyDye;                                           // 0x0A30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyPaint;                                         // 0x0A38(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SetTextGeneric;                                     // 0x0A40(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SplitItemStack;                                     // 0x0A48(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_MergeItemStack;                                     // 0x0A50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_InputPinDigit;                                      // 0x0A58(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_PinValidated;                                       // 0x0A60(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_PinRejected;                                        // 0x0A68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TribeWarBegin;                                      // 0x0A70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TribeWarEnd;                                        // 0x0A78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_DropInventoryItem;                                  // 0x0A80(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RefillWaterContainer;                               // 0x0A88(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FAppIDItem>                          CoreAppIDItems;                                           // 0x0A90(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FAppIDItem>                          AppIDItems;                                               // 0x0AA0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UPrimalEngramEntry*>                  EngramBlueprintEntries;                                   // 0x0AB0(0x0010) (ZeroConstructor, Transient)
	TArray<class UPrimalDinoEntry*>                    DinoEntriesObjects;                                       // 0x0AC0(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               ExplorerNoteEntriesObjects;                               // 0x0AD0(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               HeadHairStylesEntriesObjects;                             // 0x0AE0(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               FacialHairStylesEntriesObjects;                           // 0x0AF0(0x0010) (ZeroConstructor, Transient)
	class UClass*                                      DefaultToolTipWidget;                                     // 0x0B00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      StarterNoteItem;                                          // 0x0B08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              PrimaryResources;                                         // 0x0B10(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      GenericDroppedItemTemplate;                               // 0x0B20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          PostProcess_KnockoutBlur;                                 // 0x0B28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UMaterialInterface*>                  BuffPostProcessEffects;                                   // 0x0B30(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>                  AdditionalBuffPostProcessEffects;                         // 0x0B40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      GenericDroppedItemTemplateLowQuality;                     // 0x0B50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0B58(0x0010) MISSED OFFSET
	class UTexture2D*                                  UnknownIcon;                                              // 0x0B68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          UnknownMaterial;                                          // 0x0B70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  WhiteTexture;                                             // 0x0B78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BlueprintBackground;                                      // 0x0B80(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BabyCuddleIcon;                                           // 0x0B88(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  ImprintedRiderIcon;                                       // 0x0B90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  WeaponAccessoryActivatedIcon;                             // 0x0B98(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  EngramBackground;                                         // 0x0BA0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  VoiceChatIcon;                                            // 0x0BA8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  ItemButtonRecentlySelectedBackground;                     // 0x0BB0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              DinoEntries;                                              // 0x0BB8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AdditionalDinoEntries;                                    // 0x0BC8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              GlobalGeneralArmorDegradationMultiplier;                  // 0x0BD8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalSpecificArmorDegradationMultiplier;                 // 0x0BDC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalSpecificArmorRatingMultiplier;                      // 0x0BE0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalGeneralArmorRatingMultiplier;                       // 0x0BE4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EnemyFoundationPreventionRadius;                          // 0x0BE8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0BEC(0x0004) MISSED OFFSET
	TArray<struct FColorDefinition>                    ColorDefinitions;                                         // 0x0BF0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                             ExtraResources;                                           // 0x0C00(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                             BaseExtraResources;                                       // 0x0C10(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  CombatMusicDay;                                           // 0x0C20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicNight;                                         // 0x0C28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicDay_Heavy;                                     // 0x0C30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicNight_Heavy;                                   // 0x0C38(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  LevelUpStingerSound;                                      // 0x0C40(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FPlayerCharacterGenderDefinition            PlayerCharacterGenderDefinitions[0x2];                    // 0x0C48(0x05F0) (Edit, DisableEditOnInstance)
	class UClass*                                      DefaultGameMode;                                          // 0x1828(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLevelExperienceRamp                        LevelExperienceRamps[0x4];                                // 0x1830(0x0010) (Edit, DisableEditOnInstance)
	struct FLevelExperienceRamp                        SinglePlayerLevelExperienceRamps[0x4];                    // 0x1870(0x0010) (Edit, DisableEditOnInstance)
	TArray<struct FNamedTeamDefinition>                NamedTeamDefinitions;                                     // 0x18B0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<int>                                        PlayerLevelEngramPoints;                                  // 0x18C0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<int>                                        PlayerLevelEngramPointsSP;                                // 0x18D0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              PreventBuildStructureReasonStrings;                       // 0x18E0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FExplorerNoteAchievement>            ExplorerNoteAchievements;                                 // 0x18F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_NPC;                                                // 0x1900(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_SupplyCrates;                                       // 0x1910(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FActiveEventSupplyCrateWeight>       Remap_ActiveEventSupplyCrates;                            // 0x1920(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_ResourceComponents;                                 // 0x1930(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_NPCSpawnEntries;                                    // 0x1940(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_Engrams;                                            // 0x1950(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemapping>                     Remap_Items;                                              // 0x1960(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassAddition>                      AdditionalStructureEngrams;                               // 0x1970(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FBuffAddition>                       AdditionalDefaultBuffs;                                   // 0x1980(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      ActorToSpawnUponEnemyCoreStructureDeath;                  // 0x1990(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              AdditionalStructuresToPlace;                              // 0x1998(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              MasterDyeList;                                            // 0x19A8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData03[0x10];                                      // 0x19B8(0x0010) MISSED OFFSET
	float                                              EnemyCoreStructureDeathActorRadiusBuildCheck;             // 0x19C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x19CC(0x0004) MISSED OFFSET
	class UClass*                                      DeathDestructionDepositInventoryClass;                    // 0x19D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  MateBoostIcon;                                            // 0x19D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  EggBoostIcon;                                             // 0x19E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  MatingIcon;                                               // 0x19E8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  NearFeedIcon;                                             // 0x19F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BuffedIcon;                                               // 0x19F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  TethererdIcon;                                            // 0x1A00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  GamepadFaceButtonTop;                                     // 0x1A08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  GamepadFaceButtonBottom;                                  // 0x1A10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  GamepadFaceButtonLeft;                                    // 0x1A18(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  GamepadFaceButtonRight;                                   // 0x1A20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      FooterTemplate;                                           // 0x1A28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TribeXPSharePercent;                                      // 0x1A30(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                OverrideServerPhysXSubsteps;                              // 0x1A34(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OverrideServerPhysXSubstepsDeltaTime;                     // 0x1A38(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bInitialized;                                             // 0x1A3C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x53];                                      // 0x1A3D(0x0053) MISSED OFFSET
	class USoundBase*                                  Sound_TamedDinos[0x3];                                    // 0x1A90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ItemStartCrafting;                                  // 0x1AA8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ItemFinishCrafting;                                 // 0x1AB0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ItemStartRepairing;                                 // 0x1AB8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ItemFinishRepairing;                                // 0x1AC0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      NotifClass;                                               // 0x1AC8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      StructureDefaultOverlayToolTipWidget;                     // 0x1AD0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      MeleeHitColorizeStructuresUI;                             // 0x1AD8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinPaintDurationConsumption;                              // 0x1AE0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPaintDurationConsumption;                              // 0x1AE4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinDinoRadiusForPaintConsumption;                         // 0x1AE8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxDinoRadiusForPaintConsumption;                         // 0x1AEC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FDinoBabySetup>                      DinoBabySetups;                                           // 0x1AF0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FDinoBabySetup>                      DinoGestationSetups;                                      // 0x1B00(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      SoapItemTemplate;                                         // 0x1B10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  NameTagWildcardAdmin;                                     // 0x1B18(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  NameTagServerAdmin;                                       // 0x1B20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  NameTagTribeAdmin;                                        // 0x1B28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UTexture2D*>                          BadgeGroupsNameTag;                                       // 0x1B30(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              AchievementIDs;                                           // 0x1B40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData06[0x50];                                      // 0x1B50(0x0050) MISSED OFFSET
	TArray<float>                                      AdditionalEggWeightsToSpawn;                              // 0x1BA0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AdditionalEggItemsToSpawn;                                // 0x1BB0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      FertilizedAdditionalEggWeightsToSpawn;                    // 0x1BC0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              FertilizedAdditionalEggItemsToSpawn;                      // 0x1BD0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ItemAchievementsName;                                     // 0x1BE0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              ItemAchievementsList;                                     // 0x1BF0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              GlobalCuddleFoodList;                                     // 0x1C00(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FMultiAchievement>                   MultiAchievements;                                        // 0x1C10(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  DinoIncrementedImprintingSound;                           // 0x1C20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  HitMarkerCharacterSound;                                  // 0x1C28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  HitMarkerStructureSound;                                  // 0x1C30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialParameterCollection*                FOVScaleMaterialParamCollection;                          // 0x1C38(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNPCSpawnEntriesContainerAdditions>  TheNPCSpawnEntriesContainerAdditions;                     // 0x1C40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                          PostProcess_ColorLUT;                                     // 0x1C50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DefaultStructureSettings;                                 // 0x1C58(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_DossierUnlocked;                                    // 0x1C60(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ItemUseOnItem;                                      // 0x1C68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemoveItemSkin;                                     // 0x1C70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemoveClipAmmo;                                     // 0x1C78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FExplorerNoteEntry>                  ExplorerNoteEntries;                                      // 0x1C80(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              ExplorerNoteXPGain;                                       // 0x1C90(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x1C94(0x0004) MISSED OFFSET
	class UTexture2D*                                  BuffTypeBackgrounds[0x3];                                 // 0x1C98(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BuffTypeForegrounds[0x3];                                 // 0x1CB0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplorerNoteXPBuff;                                       // 0x1CC8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      SpecialExplorerNoteXPBuff;                                // 0x1CD0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  PerMapExplorerNoteLockedIcon;                             // 0x1CD8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  TamedDinoUnlockedIcon;                                    // 0x1CE0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  TamedDinoLockedIcon;                                      // 0x1CE8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      OverrideAutoGenerateTerainActorTemplate;                  // 0x1CF0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FUnlockableEmoteEntry>               UnlockableEmotes;                                         // 0x1CF8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemappingWeight>               GlobalNPCRandomSpawnClassWeights;                         // 0x1D08(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                                  DinoOrderIcon;                                            // 0x1D18(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DinoOrderEffect_MoveTo;                                   // 0x1D20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DinoOrderEffect_AttackTarget;                             // 0x1D28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FObjectCorrelation>                  AdditionalHumanMaleAnimSequenceOverrides;                 // 0x1D30(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FObjectCorrelation>                  AdditionalHumanFemaleAnimSequenceOverrides;               // 0x1D40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FObjectCorrelation>                  AdditionalHumanMaleAnimMontagesOverrides;                 // 0x1D50(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FObjectCorrelation>                  AdditionalHumanFemaleAnimMontagesOverrides;               // 0x1D60(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FOverrideAnimBlueprintEntry>         AdditionalHumanMaleOverrideAnimBlueprints;                // 0x1D70(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FOverrideAnimBlueprintEntry>         AdditionalHumanFemaleOverrideAnimBlueprints;              // 0x1D80(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              ServerExtraWorldSingletonActorClasses;                    // 0x1D90(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bForceServerUseDinoList;                                  // 0x1DA0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x1DA1(0x0007) MISSED OFFSET
	TArray<class UClass*>                              ExtraStackedGameDataClasses;                              // 0x1DA8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FHairStyleDefinition>                HeadHairStyleDefinitions;                                 // 0x1DB8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FHairStyleDefinition>                FacialHairStyleDefinitions;                               // 0x1DC8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FHairStyleDefinition>                AdditionalHeadHairStyleDefinitions;                       // 0x1DD8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FHairStyleDefinition>                AdditionalFacialHairStyleDefinitions;                     // 0x1DE8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      ExtraEggItem;                                             // 0x1DF8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      EventValentineDrop;                                       // 0x1E00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  GenericWaterPostprocessAmbientSound;                      // 0x1E08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      OverridePlayerDataClass;                                  // 0x1E10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FName>                               AllDinosAchievementNameTags;                              // 0x1E18(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  GenericArrowPickedUpSound;                                // 0x1E28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  UnlockIcon;                                               // 0x1E30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FColor                                      WheelFolderColor;                                         // 0x1E38(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FColor                                      WheelBackColor;                                           // 0x1E3C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             CorpseLocatorEffect;                                      // 0x1E40(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  MaxInventoryIcon;                                         // 0x1E48(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  ItemSkinIcon;                                             // 0x1E50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<TEnumAsByte<ECollisionChannel>>             SkeletalPhysCustomBodyAdditionalIgnores;                  // 0x1E58(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  ActionWheelClickSound;                                    // 0x1E68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_GenericBoardPassenger;                              // 0x1E70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_GenericUnboardPassenger;                            // 0x1E78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_CraftingTabToggle;                                  // 0x1E80(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             LockedToSeatingStructureParticle;                         // 0x1E88(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      GenericBatteryItemClass;                                  // 0x1E90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x50];                                      // 0x1E98(0x0050) MISSED OFFSET
	TArray<class UClass*>                              GenesisSeasonPassItems;                                   // 0x1EE8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalGameData");
		return ptr;
	}


	void TickedWorld(class UWorld* TheWorld, float DeltaTime);
	bool LocalIsPerMapExplorerNoteUnlocked(int ExplorerNoteIndex);
	bool LocalIsGlobalExplorerNoteUnlocked(int ExplorerNoteIndex);
	void LoadedWorld(class UWorld* TheWorld);
	float GetXPMax(TEnumAsByte<ELevelExperienceRampType> levelType);
	float GetLevelXP(TEnumAsByte<ELevelExperienceRampType> levelType, int forLevel);
	int GetLevelMax(TEnumAsByte<ELevelExperienceRampType> levelType);
	struct FLevelExperienceRamp GetLevelExperienceRamp(TEnumAsByte<ELevelExperienceRampType> levelType);
	class USoundBase* GetGenericCombatMusic(class APrimalCharacter* forCharacter, class APrimalCharacter* forEnemy);
	class FString GetExplorerNoteDescription(int ExplorerNoteIndex);
	class UClass* GetDinoEntry(class UClass* DinoClass);
	struct FLinearColor GetColorForDefinition(int DefinitionIndex);
	void BPMergeModGameData(class UPrimalGameData* AnotherGameData);
	void BPInitializeGameData();
	int BPGetItemQualityIndex(float ItemRating);
	class UPrimalGameData* BPGetGameData();
};


// Class ShooterGame.DataListEntryInterface
// 0x0000 (0x0028 - 0x0028)
class UDataListEntryInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryInterface");
		return ptr;
	}

};


// Class ShooterGame.PrimalItem
// 0x0948 (0x0970 - 0x0028)
class UPrimalItem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) MISSED OFFSET
	unsigned char                                      bCanBuildStructures : 1;                                  // 0x0050(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bAllowEquppingItem : 1;                                   // 0x0050(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bPreventEquipOnTaxidermyBase : 1;                         // 0x0050(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowInventoryItem : 1;                                  // 0x0050(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsRepairing : 1;                                         // 0x0050(0x0001) (Transient, SaveGame)
	unsigned char                                      bEquippedItem : 1;                                        // 0x0050(0x0001) (Transient, SaveGame)
	unsigned char                                      bCanSlot : 1;                                             // 0x0050(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bUseItemColors : 1;                                       // 0x0050(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBPInitItemColors : 1;                                 // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bRefreshOnDyeUsed : 1;                                    // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBPPostAddBuffToGiveOwnerCharacter : 1;                // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceDediAttachments : 1;                                // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowCustomColors : 1;                                   // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceAllowRemovalWhenDead : 1;                           // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAutoCraftBlueprint : 1;                                  // 0x0051(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHideFromInventoryDisplay : 1;                            // 0x0051(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bUseItemStats : 1;                                        // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseSpawnActorWhenRiding : 1;                             // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseSpawnActor : 1;                                       // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowDefaultCharacterAttachment : 1;                     // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseItemDurability : 1;                                   // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bNewWeaponAutoFillClipAmmo : 1;                           // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDestroyBrokenItem : 1;                                   // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bThrowOnHotKeyUse : 1;                                    // 0x0052(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsBlueprint : 1;                                         // 0x0053(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bCanBeBlueprint : 1;                                      // 0x0053(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPreventUpload : 1;                                       // 0x0053(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsEngram : 1;                                            // 0x0053(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bIsCustomRecipe : 1;                                      // 0x0053(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bIsFoodRecipe : 1;                                        // 0x0053(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bTekItem : 1;                                             // 0x0053(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowUseInInventory : 1;                                 // 0x0053(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowRemoteUseInInventory : 1;                           // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBlueprintEquippedNotifications : 1;                   // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseInWaterRestoreDurability : 1;                         // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bValidCraftingResource : 1;                               // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBPSetupHUDIconMaterial : 1;                           // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bEquipRequiresDLC_ScorchedEarth : 1;                      // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bEquipRequiresDLC_Aberration : 1;                         // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bEquipRequiresDLC_Extinction : 1;                         // 0x0054(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bEquipRequiresDLC_Genesis : 1;                            // 0x0055(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDurabilityRequirementIgnoredInWater : 1;                 // 0x0055(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowRepair : 1;                                         // 0x0055(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCustomBrokenIcon : 1;                                    // 0x0055(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowRemovalFromInventory : 1;                           // 0x0055(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bFromSteamInventory : 1;                                  // 0x0055(0x0001) (SaveGame)
	unsigned char                                      bIsFromAllClustersInventory : 1;                          // 0x0055(0x0001) (SaveGame)
	unsigned char                                      bConsumeItemOnUse : 1;                                    // 0x0055(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bOnlyCanUseInWater : 1;                                   // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanUseSwimming : 1;                                      // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsDescriptionOnlyItem : 1;                               // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bRestoreDurabilityWhenColorized : 1;                      // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAppendPrimaryColorToName : 1;                            // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseScaleStatEffectivenessByDurability : 1;               // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUsesCreationTime : 1;                                    // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowUseWhileRiding : 1;                                 // 0x0056(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPreventCraftingResourceAtFullDurability : 1;             // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bGiveItemWhenUsedCopyItemStats : 1;                       // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHideFromRemoteInventoryDisplay : 1;                      // 0x0057(0x0001) (Edit, DisableEditOnInstance, SaveGame)
	unsigned char                                      bAutoDecreaseDurabilityOverTime : 1;                      // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPreventDragOntoOtherItemIfSameCustomData : 1;            // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseOnItemWeaponRemoveClipAmmo : 1;                       // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseOnItemSetIndexAsDestinationItemCustomData : 1;        // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bSupportDragOntoOtherItem : 1;                            // 0x0057(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsItemSkin : 1;                                          // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDontResetAttachmentIfNotUpdatingItem : 1;                // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bItemSkinIgnoreSkinIcon : 1;                              // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPickupEggAlertsDinos : 1;                                // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHideCustomDescription : 1;                               // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCopyCustomDescriptionIntoSpoiledItem : 1;                // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCopyDurabilityIntoSpoiledItem : 1;                       // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCraftedRequestCustomItemDescription : 1;                 // 0x0058(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceAllowCustomItemDescription : 1;                     // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01 : 4;                                        // 0x0059(0x0001)
	unsigned char                                      bUseBPPreventUseOntoItem : 1;                             // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bSkinDisableWhenSubmerged : 1;                            // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsAbstractItem : 1;                                      // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPreventItemSkins : 1;                                    // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bOnlyCanUseInFalling : 1;                                 // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceDropDestruction : 1;                                // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanBeArkTributeItem : 1;                                 // 0x005A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowInvalidItemVersion : 1;                             // 0x005A(0x0001) (Edit, DisableEditOnInstance)
