#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_HM_Hoversail_Riding_AnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass HM_Hoversail_Riding_AnimBP.HM_Hoversail_Riding_AnimBP_C
// 0x1284 (0x15C4 - 0x0340)
class UHM_Hoversail_Riding_AnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_Slot                              AnimGraphNode_Slot_BFE9409846266F4636CA4FB631962936;      // 0x0340(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C30D7B2B44B8C1C67AA24094479B7B7B;      // 0x0378(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DEBAD0B94213FBC7D08B20858CD07684;      // 0x03B0(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE405C2C4B856279EC73B08811D1AF32;// 0x03E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9C5FA1A453F7DCDBF8BF4A22FC5A7EA;// 0x0400(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2DC0EE04D646EDD713CEAA916C832F9;// 0x0418(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_103A13D54851570B46CBAAB20FD0CD8C;// 0x0430(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5F67257462984D3F3C31BA85B485A58;// 0x0448(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F862;// 0x0460(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5EE2C2CC46115197E6CCE0B5C7C879B3;// 0x0478(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C2;// 0x0490(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C02D9E944B102DB0422EB905AC1D0BB;// 0x04A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C9BCA66447C61EBE5967792F3C3CEE42;// 0x04C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79A922DC471879CB2151ECA53B81647A;// 0x04D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D01D8609465AE86A5EDD9A8A3BA9529B;// 0x04F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9A3FF8A4C71D20E7820F6BD9889A4E9;// 0x0508(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_477BB3E44D6085BDA8AFE1B39D50D100;// 0x0520(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69C772BD4569598ADC503DA9A4A30FA7;// 0x0538(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37561DC84777653017E162A923344654;// 0x0550(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AE8296A416EAB80EE9B6EAD2E0BA684;// 0x0568(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DE4549747BF853C5FBBCEABE2C06F6D;// 0x0580(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16DDDA044731BF5C5CF9DC8F083F8FCA;// 0x0598(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E512D8C4523BA56983741AA4171A799;// 0x05B0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF4BD1B6468C60E559ED13B97B0B52CC;// 0x05C8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0246241B4ABD7897716963800C58D9B7;// 0x05E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D854CA74001E852966FCC9702B47298;// 0x05F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF152A0946C11E954A8D89A6090F746C;// 0x0610(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1292E1254FE1FE99C5D3139F84B5B987;// 0x0628(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEC612B148D3A56882D7298F617CC5BE;// 0x0640(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D92074494DC686441F87AD81A6FD2221;// 0x0658(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2FC50ECD49210F3F49742DAB5E98FEFB;// 0x0670(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89A88D15402DD0AEAD1B71874201F9BB;// 0x0688(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4F3157C492841F51375E6833D8B36E0;// 0x06A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BF8A9BB476BFDCFBCBDF2898D6ED74A;// 0x06B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_965F9E37490F2CC76E3F3D93CFE9F69E;// 0x06D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22B32955458AE1554DF57F9473A25AA4;// 0x06E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B4231184697AF546684769171A90ACB;// 0x0700(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_033442764EDFE0487AC8B8AFF578056C;// 0x0718(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8646A1F94345FF722AACF3BBE8F98D91;// 0x0730(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D50218E4A8D6044E25FF193EE9FC2CD;// 0x0748(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE28EDED4CF53E0765AB2C98CACE1BFA;// 0x0760(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C48554874550ECBA2D34708805068C4B;// 0x0778(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F86;// 0x0790(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C5165344B086BEECF445F8F060E900E;// 0x07A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D382C7284CD06819F03130AAD8CA10BA;// 0x07C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C;// 0x07D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7E7D0024CE0F5E5077BD28CC57C60A8;// 0x07F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D55CD51A414268A0018FF29C5F436CB0;// 0x0808(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C9BCA66447C61EBE5967792F3C3CEE4;// 0x0820(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0261C45E430F857DAE4EB38E930D4601;// 0x0838(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717C032D4D44A3CAD35042A3BC450094;// 0x0850(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D55E028048DA37F6FC8E16946E03A58D;// 0x0868(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_152BB75B480C1E3E3724408527755C57;// 0x0880(0x0018)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A640056A476D18A962980ABC397BDBA3;// 0x0898(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BB5C45845785C682DFCCFB083CCD75F;// 0x08C0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F9E3F4274BB8B81F853B0189CDB9A994;// 0x08F0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FFC2A87143AFF18ADE70E59AD48BE4D0;// 0x0918(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F4;// 0x0948(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A55ECF1343B9751E111892B4C30361A7;// 0x0970(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F3;// 0x09A0(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B331517B417C1382C77CE5894C158D6C2;// 0x09C8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B7426472;// 0x0AA8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F2446E274BA6A064ACAD4FB30F93D4B22;// 0x0AD0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E624852;// 0x0B00(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AD4E00C7406F75775731C89DD7CAD2282;// 0x0B28(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB922;// 0x0C08(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A81A3B004E7B72F2085968B9AB050DB52;// 0x0C30(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F2;// 0x0C60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FA063D5422D9F7F150146A3F71550EF;// 0x0C88(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1F4628174687604DE3923DA933B4BCB7;// 0x0CA0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D6823204D7182B45F240E8AE9ED34E4;// 0x0CB8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D4E6DC24235B76ECE009783DA88DAB2;// 0x0CD0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F2;// 0x0D00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860614D6439D00AD15C1A197E2609076;// 0x0D28(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EF7786D4EB36336B03C2E8A4BABD9E4;// 0x0D40(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F;// 0x0D70(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C673B25F4245116AD1350FB30009CD71;// 0x0D98(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_31C2A426472FAB41D26CC89086DE09AA;// 0x0DC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4613613F48562162880BCDA97A79E26F;// 0x0DF0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01164F7342931B0DCB3F3784C3DC1F08;// 0x0E08(0x0018)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B331517B417C1382C77CE5894C158D6C;// 0x0E20(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B742647;// 0x0F00(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F2446E274BA6A064ACAD4FB30F93D4B2;// 0x0F28(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E62485;// 0x0F58(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AD4E00C7406F75775731C89DD7CAD228;// 0x0F80(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB92;// 0x1060(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A81A3B004E7B72F2085968B9AB050DB5;// 0x1088(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F;// 0x10B8(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A8E5F52E48D055C17C10FD9EFB37B8C1;// 0x10E0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB93E6604C95333EB323D0A832DA08BA;// 0x1140(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_79B7F9994749050787EC5E9D4A81F09D;// 0x1170(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_32F29DF144BCAF4185CCB28B616C8110;// 0x11C0(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_046E09694581CFDCD70FA6B839E3F1E6;// 0x1200(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_648E1680485BF983897A84A8E7DB2627;// 0x1260(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C493E1F4DE8557A68D3499C4D28000E;// 0x1288(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_3A734C1F43566B1198D9AC9990A9EEA2;      // 0x12B8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_29C9D14C47DB072E7C8E0EB58041BC95;// 0x12E0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_56671E4447CBEE69B7735BB18A16FF45;// 0x1308(0x0028)
	struct FAnimNode_ModifyBones                       AnimGraphNode_ModifyBones_AC1EF99D49EEAB8FC54FA8A63DD89D6D;// 0x1330(0x0040)
	bool                                               Sail_Is_Open;                                             // 0x1370(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1371(0x0003) MISSED OFFSET
	struct FVector                                     MovementAnimBlendAxes;                                    // 0x1374(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VerticalAnimBlendInterpSpeed;                             // 0x1380(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x1384(0x0004) MISSED OFFSET
	double                                             time_since_state_change;                                  // 0x1388(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x1390(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    RootRotationOffset;                                       // 0x139C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x13A8(0x0008) MISSED OFFSET
	struct UObject_FTransform                          RootOffsetTransform;                                      // 0x13B0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    MeshRotationOffsetLimits_Total;                           // 0x13E0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              inherited_forward_axis_amount_before_max;                 // 0x13EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              inherited_right_axis_amount_before_max;                   // 0x13F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_1;                                            // 0x13F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x13F5(0x0003) MISSED OFFSET
	class UAnimSequence*                               Trick_1_anim;                                             // 0x13F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               Trick_2_anim;                                             // 0x1400(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               Open_anim;                                                // 0x1408(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             open_BS;                                                  // 0x1410(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               close_anim;                                               // 0x1418(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             close_BS;                                                 // 0x1420(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           open_wobble_additive;                                     // 0x1428(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           closed_wobble_additive;                                   // 0x1430(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           jump_antic_additive;                                      // 0x1438(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               holding_jump;                                             // 0x1440(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               use_wobble;                                               // 0x1441(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               use_jump;                                                 // 0x1442(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x5];                                       // 0x1443(0x0005) MISSED OFFSET
	class UAnimSequenceBase*                           fwd_open;                                                 // 0x1448(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_2;                                            // 0x1450(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               doing_any_trick;                                          // 0x1451(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x1452(0x0002) MISSED OFFSET
	float                                              remaining_trick_time;                                     // 0x1454(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTEKHoverSail_AnimBlueprint_C*               hoversail_animbp_ref;                                     // 0x1458(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               trick_3_anim;                                             // 0x1460(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               trick_4_anim;                                             // 0x1468(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_3;                                            // 0x1470(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_4;                                            // 0x1471(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               resync;                                                   // 0x1472(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x5];                                       // 0x1473(0x0005) MISSED OFFSET
	class UAnimSequenceBase*                           initial_pose;                                             // 0x1478(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              rotation_amount;                                          // 0x1480(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x1484(0x0004) MISSED OFFSET
	class UAnimSequenceBase*                           cliff_dive_anim;                                          // 0x1488(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_cliff_diving;                                          // 0x1490(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_moving;                                                // 0x1491(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               recently_spawned;                                         // 0x1492(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               has_rider;                                                // 0x1493(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue;                   // 0x1494(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x1495(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x1496(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x1497(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x1498(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x1499(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x149A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x149B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x149C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue2;                  // 0x149D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x149E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x149F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x14A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x14A1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x14A2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x14A3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x14A4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x14A5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x14A6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x14A7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue13;                       // 0x14A8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x14A9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue3;                  // 0x14AA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue4;                  // 0x14AB(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue14;                       // 0x14AC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue5;                  // 0x14AD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue6;                  // 0x14AE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue15;                       // 0x14AF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue7;                  // 0x14B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue16;                       // 0x14B1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue8;                  // 0x14B2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue17;                       // 0x14B3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue9;                  // 0x14B4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x14B5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue18;                       // 0x14B6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x14B7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue19;                       // 0x14B8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x14B9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x14BA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue10;                 // 0x14BB(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue20;                       // 0x14BC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue21;                       // 0x14BD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue11;                 // 0x14BE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue22;                       // 0x14BF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue12;                 // 0x14C0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue23;                       // 0x14C1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue24;                       // 0x14C2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue13;                 // 0x14C3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue25;                       // 0x14C4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue26;                       // 0x14C5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x14C6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue27;                       // 0x14C7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x14C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x14C9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue14;                 // 0x14CA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x14CB(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue28;                       // 0x14CC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x14CD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue7;                          // 0x14CE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue15;                 // 0x14CF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x14D0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x14D4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x14D8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue29;                       // 0x14DC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x14DD(0x0003) MISSED OFFSET
	float                                              CallFunc_MapRange_ReturnValue;                            // 0x14E0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Subtract_FloatFloat_ReturnValue;                 // 0x14E4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue2;                           // 0x14E8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue16;                 // 0x14EC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x14ED(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X2;                                  // 0x14F0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x14F4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x14F8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x14FC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue3;                           // 0x1500(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue4;                           // 0x1504(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x1508(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue;              // 0x150C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x150D(0x0003) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue2;                        // 0x1510(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue8;                          // 0x1514(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue9;                          // 0x1515(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue;                // 0x1516(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x1517(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue17;                 // 0x1518(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue30;                       // 0x1519(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x2];                                       // 0x151A(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector_X3;                                  // 0x151C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y3;                                  // 0x1520(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z3;                                  // 0x1524(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue2;               // 0x1528(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x1529(0x0003) MISSED OFFSET
	float                                              CallFunc_MapRange_ReturnValue5;                           // 0x152C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Subtract_FloatFloat_ReturnValue2;                // 0x1530(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue6;                           // 0x1534(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x1538(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue18;                 // 0x1539(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x153A(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector_X4;                                  // 0x153C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y4;                                  // 0x1540(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z4;                                  // 0x1544(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x1548(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue3;                // 0x154C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue7;                           // 0x1550(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue8;                           // 0x1554(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue31;                       // 0x1558(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue10;                         // 0x1559(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x2];                                       // 0x155A(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x155C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x1560(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x1568(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x1570(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x1571(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_K2_GetComponentLocation_ReturnValue;             // 0x1574(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetSocketLocation_ReturnValue;                   // 0x1580(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x158C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsLocallyControlled_ReturnValue;                 // 0x158D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue2;                            // 0x158E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x1];                                       // 0x158F(0x0001) MISSED OFFSET
	class UAnimInstance*                               CallFunc_GetAnimInstance_ReturnValue;                     // 0x1590(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue3;                            // 0x1598(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x7];                                       // 0x1599(0x0007) MISSED OFFSET
	class UTEKHoverSail_AnimBlueprint_C*               K2Node_DynamicCast_AsTEKHoverSail_AnimBlueprint_C;        // 0x15A0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x15A8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x15A9(0x0003) MISSED OFFSET
	struct FRotator                                    CallFunc_SelectRotator_ReturnValue;                       // 0x15AC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_SelectVector_ReturnValue;                        // 0x15B8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass HM_Hoversail_Riding_AnimBP.HM_Hoversail_Riding_AnimBP_C");
		return ptr;
	}


	void STATIC_Compose_Mesh_Transform_Offsets();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HM_Hoversail_Riding_AnimBP_AnimGraphNode_TransitionResult_2346();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HM_Hoversail_Riding_AnimBP_AnimGraphNode_TransitionResult_2345();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HM_Hoversail_Riding_AnimBP_AnimGraphNode_TransitionResult_2344();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HM_Hoversail_Riding_AnimBP_AnimGraphNode_TransitionResult_2343();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HM_Hoversail_Riding_AnimBP_AnimGraphNode_TransitionResult_2342();
