#pragma once

// ARKSurvivalEvolved (301.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint.SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_C
// 0x0ED1 (0x1211 - 0x0340)
class USK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_BAD802C548BB38AE1BF364B53515B61B;      // 0x0340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B2EF5384C28FD3BDBCED19961D9CDFF;// 0x0368(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9512907E4DDC97208081CDA4DB923771;// 0x0380(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DE0B9834CE6C7C1173E92B30AB3B261;// 0x0398(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_400E35174491DB7FB62A199A44C443BE;// 0x03B0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9AE55E84266918732A2A3BF4788438A;// 0x03C8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A95E865841BF0AAD5E92B797CB44904A3;// 0x03E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0779F5DD44CF7308C72D81B4D8D7A331;// 0x03F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9FBC70C482CA16BC6CA2AB71D75E72E3;// 0x0410(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A95E865841BF0AAD5E92B797CB44904A2;// 0x0428(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62A75CE14BF7C0539B5BFFA73CA7BDE5;// 0x0440(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9FBC70C482CA16BC6CA2AB71D75E72E2;// 0x0458(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A95E865841BF0AAD5E92B797CB44904A;// 0x0470(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2BA41F14F2B1A0BEAC07A9E871187C3;// 0x0488(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9FBC70C482CA16BC6CA2AB71D75E72E;// 0x04A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67BB11D4479F31E7594D30B556CCB948;// 0x04B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BECE8FA6481E65DC7FD5ECA47F9B58C1;// 0x04D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_001A27024C736DA2F2051584A091DDDD;// 0x04E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6BF56CA94B2892EDAEAD389B2406C61A;// 0x0500(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2F6E8624203504888BE41BA7986CD95;// 0x0518(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FD1A0E7458E791E22F69BA593D773EE;// 0x0530(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78B93C324EC4FFCD38D06DB1265CF342;// 0x0548(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFBB63E1474D6F972A03B4B40495B378;// 0x0560(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C83B586E48C44FD094D8ABAA5E7C46A3;// 0x0578(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25F537EB48C3A708076B529BD932CCBD;// 0x0590(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D4BA2D6492596D4952664AE50D1A737;// 0x05A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C7C057348D918B11514D78470523896;// 0x05C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D64F9BA7498240DB1D1D52943FD84CF3;// 0x05D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8743C4E34B46CF7266392594D847D422;// 0x05F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_347217FC4ABF5EAA1D6888A650459796;// 0x0608(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BE7AC1340E4C74CE2A09DA18AC939F1;// 0x0620(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3150E7534C83F4981A505CBE44288115;// 0x0638(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161753D5472692BF83A4DCB6D6DDD6C5;// 0x0650(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17C66D0D45E0B14AC360049A51D8347C;// 0x0668(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_942607554DE9B59EB7A03CAB86F62630;// 0x0680(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3067BE7467A2FD6913428820B783EF4;// 0x0698(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0082BFA451F978D33EDE090C365A180;// 0x06B0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2214B8A416825D64813E791C5CD87B6;// 0x06C8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98141C904BE8A7AB96C955ADF92D335E;// 0x06E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1342D19B43C33C90FB35F8B12283BE73;// 0x06F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FE79B0E4EEFAD3D1EFA698E382D56AA;// 0x0710(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A313F4704978FB768B7E8BA0F81FF5A3;// 0x0728(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_02CB111D42E964EE5FACB9AB96F4977D;// 0x0758(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1B1D5F1C415DE33AB58ACBA8BBCD72B1;// 0x0780(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91E25C6F4903006DE8277F8C3FF0122E;// 0x07B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2CAA81F74E5BB362CBC15AA198F873CC;// 0x07D8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_49DD82AD40C9D3C6421E28B19F9B0CAA;// 0x0808(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AED2523D4A98B00ADE11F9BCD52F5D08;// 0x0830(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6F612144BD0365AFAEE359C617A4CE8;// 0x0860(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DAACC831431835E4ABA624B1AF0B4F36;// 0x0888(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CEA51B55483A856F832079AB7018D6AB;// 0x08B8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FCE04FCE48C9C3CC04DA6AB01E8C53BC;// 0x08E0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1358F8A84D951C406C152CBC9365606B3;// 0x0910(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E0229F0640837340F08770A941B1B553;// 0x0938(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_83C28DD742376145E498249F967B10C03;// 0x0968(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_855F7E514595D3551703A38399C333F0;// 0x0990(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_70CDBA83429694D53A4890994DA18CE13;// 0x09C0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E5E1CCAC45503DDF9AD5479CB366D79E;// 0x09E8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1358F8A84D951C406C152CBC9365606B2;// 0x0A18(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_79B394354F7928ECD913CF9A67F84CBD;// 0x0A40(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_83C28DD742376145E498249F967B10C02;// 0x0A70(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_201664074965FD22BBEC459EC9583C83;// 0x0A98(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_70CDBA83429694D53A4890994DA18CE12;// 0x0AC8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7CAFDB564147C0DA7E01C0BB1A51A6D2;// 0x0AF0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1358F8A84D951C406C152CBC9365606B;// 0x0B20(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E1E36474C2CCA4E8BF0BDB3B7CAB607;// 0x0B48(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_83C28DD742376145E498249F967B10C0;// 0x0B78(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05EEC6644F48326D4FFE6BAA9B8FCCB1;// 0x0BA0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_70CDBA83429694D53A4890994DA18CE1;// 0x0BD0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD1382344191803967523982093E96D0;// 0x0BF8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8C9E38904AD7379C39CE6A829FB9D132;// 0x0C28(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C253630A4E7FD74FAAB60E91B2BBEC08;// 0x0C50(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BCFCB4FC496597D4CEB6BFB25C5A7996;// 0x0C80(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44C07CAE442394AA740F39B4DC4BEF5D;// 0x0CA8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7410D6644C29FAE4A73B6FBC83ADAE94;// 0x0CD8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17548358440322B1A2D72996B8EC72A6;// 0x0D00(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE15809245601B036286F7A04694C0132;// 0x0D30(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E2ECD1C549C737BDBF7F2EA600E9CCD4;// 0x0D58(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD855EE8411B2C42753401A98EB438B02;// 0x0D88(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54DCAD7B4188840282AD2DABCD2DE049;// 0x0DB0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8F0421CB415BF8737DC870B652B5C2532;// 0x0DE0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0619881E4802057F650B669D7FAC682D;// 0x0E08(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE15809245601B036286F7A04694C013;// 0x0E38(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_526BD600414E09A89D6EBEAC4BD200DB;// 0x0E60(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD855EE8411B2C42753401A98EB438B0;// 0x0E90(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FDDD999D486647CA3F5001BCD77D6A98;// 0x0EB8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8F0421CB415BF8737DC870B652B5C253;// 0x0EE8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3D99076347EF8F59BD5E11A9FC91D59E;// 0x0F10(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9610F09C4B9982F07B748B89244F959C;// 0x0F40(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0E6A91B445AE0C3E5E9E9AFC1E802F9;// 0x0F68(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D8CECED743D863D637BC148F5BFCF7EE;// 0x0F98(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C89258441D554BEF452548BA87C26E5;// 0x0FC0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EFB90317459634F454283C95FAFDCDB9;// 0x0FF0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_02A6E7164FDA80C659DA88BCE0F56C2F;// 0x1018(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5DFDC96749DF59D5F76BCB9630A4DF23;// 0x1048(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42482C0E46FCB11589DFF788C977C87B;// 0x1070(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B0796EE4A669117420D898BFEE3CFDA;// 0x10A0(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5897FD534C13C1E96C8F67B00904BDEA;// 0x10C8(0x0060)
	class ABuff_TekArmor_ShoulderCannon_C*             RefOwningBuff;                                            // 0x1128(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsActive;                                                 // 0x1130(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1131(0x0003) MISSED OFFSET
	int                                                FireMode;                                                 // 0x1134(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DebugAnims;                                               // 0x1138(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               StartFire;                                                // 0x1139(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Overheated;                                               // 0x113A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x113B(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;       // 0x113C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue;                // 0x1140(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1141(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;      // 0x1144(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue2;               // 0x1148(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x1149(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3;      // 0x114C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue3;               // 0x1150(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x1151(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue4;      // 0x1154(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue4;               // 0x1158(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue;                   // 0x1159(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x115A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x115B(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue5;      // 0x115C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue5;               // 0x1160(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x1161(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x1162(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue2;                  // 0x1163(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x1164(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x1165(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x1166(0x0002) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue6;      // 0x1168(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue6;               // 0x116C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x116D(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue7;      // 0x1170(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue7;               // 0x1174(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue3;                  // 0x1175(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x1176(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x1177(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue4;                  // 0x1178(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x1179(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x117A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x117B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x117C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue5;                  // 0x117D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x117E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x117F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue8;      // 0x1180(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue8;               // 0x1184(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x1185(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue9;      // 0x1188(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue9;               // 0x118C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x118D(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue;// 0x1190(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue10;              // 0x1194(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x1195(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue10;     // 0x1198(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue11;              // 0x119C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue6;                  // 0x119D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x119E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x1];                                       // 0x119F(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue11;     // 0x11A0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue12;              // 0x11A4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x11A5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x11A6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue7;                  // 0x11A7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x11A8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue11;                        // 0x11A9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue8;                  // 0x11AA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue12;                        // 0x11AB(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x11AC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue9;                  // 0x11AD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue13;                        // 0x11AE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue10;                 // 0x11AF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue11;                 // 0x11B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue14;                        // 0x11B1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue15;                        // 0x11B2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue16;                        // 0x11B3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x11B4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x11B5(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue12;     // 0x11B8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue13;              // 0x11BC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x11BD(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue13;     // 0x11C0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue14;              // 0x11C4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x11C5(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue14;     // 0x11C8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue12;                 // 0x11CC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue15;              // 0x11CD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue17;                        // 0x11CE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue18;                        // 0x11CF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x11D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x11D1(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue15;     // 0x11D4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x11D8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x11D9(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue16;     // 0x11DC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x11E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x3];                                       // 0x11E1(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue2;// 0x11E4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue3;                    // 0x11E8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x11E9(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue17;     // 0x11EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue4;                    // 0x11F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x3];                                       // 0x11F1(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue18;     // 0x11F4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue5;                    // 0x11F8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x3];                                       // 0x11F9(0x0003) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x11FC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x1200(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class ABuff_TekArmor_ShoulderCannon_C*             K2Node_DynamicCast_AsBuff_TekArmor_ShoulderCannon_C;      // 0x1208(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x1210(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint.SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1400();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1399();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1398();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1397();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_ShoulderCannon_TPV_RIG_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1396();
