#pragma once

// ARKSurvivalEvolved (332.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_TekBow_FPV_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass TekBow_FPV_AnimBlueprint.TekBow_FPV_AnimBlueprint_C
// 0x09F3 (0x0D33 - 0x0340)
class UTekBow_FPV_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_B7951BBA4970F8188767149317400A70;      // 0x0340(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6DD0646C4B38D6C0B92AA58806D0DE73;      // 0x0368(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D714E724BC24F2DD36134AB74A073E5;// 0x03A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2ECB3AA14DD44E84A61F72B7CF427E20;// 0x03B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9DAF79444022A7A4AA8319FEF67CE4D;// 0x03D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C7B5BBA4DF56F77D1B1E89446C1C6E9;// 0x03E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11F426E048C03DDD0554DDBE906BCAE4;// 0x0400(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CB8CC484788817EB5788D873EC96C96;// 0x0418(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E226781541D9FEFDD396ADABF90C3A68;// 0x0430(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B235FA1C488D5B5F7EB2659B6195386C;// 0x0448(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AB00C284AD1674576735A8C75A60059;// 0x0460(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_395B848C47B26685EA03039F3EF9C35C;// 0x0478(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_712697594C356A481C39C8900CB75F0A;// 0x0490(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B510F8A42706B40F4F68D872D7AFAD9;// 0x04A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1641A8BB4F3CA4DC53DE0FBD85B3C450;// 0x04C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_213EDFCB4ACB0C436AA0738ACA32DC88;// 0x04D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97C0B5AA4D0DA11E1A0276A502623065;// 0x04F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B518CD6456E89F8624E02A41F182390;// 0x0508(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA98135143720BBBB8F2F7A55F8BF9E1;// 0x0520(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E81D8AC4EC30FE9F8997F84C04ED8DF;// 0x0538(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E89767CE46872BC7B8DE11B5A6EB945A;// 0x0550(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EA33354A4C59FDB1D464B2AA016159DE;// 0x0568(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0FA442174B00C16C815EDB97513A27B8;// 0x0598(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_616024084E8D976862E1469327254EE1;// 0x05C0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_143CB6B84498C12F5608508AFCDF372D;// 0x05F0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FAF658FE448CD0DD8A1383882BEDE577;// 0x0618(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C80B2D54790523321C3CB94269C187E;// 0x0648(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E020512C4C49A1BF39A082BD8B5C79ED;// 0x0670(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ECFCDE9941911B99FB979D81B72A0FC6;// 0x06A0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E438040E4E95FE5B7DBA35BB4E1A8E3E;// 0x06C8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_173BC6AF4CF6AB1686C658AD2B2B089A;// 0x06F8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B3D5A1243B47524AC3F0484C89BE978;// 0x0720(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C0988A5349E6E73F9536F0ADD1508A8B;// 0x0750(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B3CD40454867A20D7AD8F38785913E01;// 0x0778(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9044B1A247100C0AE150B68925F704BA;// 0x07A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD5F7948463EF8EBFC8810B16C16BC01;// 0x07D0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D01602984E0C85C93DE5E9A17DE09B57;// 0x0800(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D174470249C0E4700ED5349102B81E6A;// 0x0828(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17EE06324DBF1AAF409C2BA3914D0DDC;// 0x0888(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_802D53FA4AA27586E7A766A6989BADB1;// 0x08A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF9CEDBD49D168EC8C0E33AC99312A90;// 0x08B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2BC08052471B8A9557328285F64A280F;// 0x08D0(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EE4A11B421D34FCFF13A5AFEBD524F7;// 0x08E8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E27E0E4840E0F4F90E71838B68DEA095;// 0x0918(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4344645405F3FC107404B9A6654D28C;// 0x0940(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B115ABDC4372318A58A5DAA083BEA6A8;// 0x0970(0x0028)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_242BDD5D487B84B620B032B75B8C8732;// 0x0998(0x0018)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8B5881EB44DDA06067FAE289F5D9CBFA;// 0x09B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A585CF74453007B3BC493AA44050ADE;// 0x09D8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F9C2C6A44B73DDD3CE16D7A56E178AA2;// 0x0A08(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EAA3077C4CFB1989046623AD5C445B14;// 0x0A30(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8246DCDA43092AA6FAAB1CA609272F67;// 0x0A90(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B1DEA28E41636F1FFF2C3897A62F8DC4;// 0x0AD0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D1781E004DF0E0E8140554B35B4DFC0B;// 0x0B20(0x0028)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0B48(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6B6F5D0E4044A1A4C475B29ED6D27138;// 0x0B50(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_18D27F9D4402AE7CF06F758454DD2AF5;// 0x0C00(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FBF3DAEF4591B32DA1D5C6B058421378;// 0x0C28(0x0028)
	bool                                               IsRunning;                                                // 0x0C50(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsPullingString;                                          // 0x0C51(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTargeting;                                              // 0x0C52(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsMoving;                                                 // 0x0C53(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DidFireWeapon;                                            // 0x0C54(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               NoAmmoToReload;                                           // 0x0C55(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ReturnToIdle;                                             // 0x0C56(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsLastArrow;                                              // 0x0C57(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HasPlayedReload;                                          // 0x0C58(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsExpanded;                                              // 0x0C59(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0C5A(0x0006) MISSED OFFSET
	double                                             LastPullStringTime;                                       // 0x0C60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeToCollapse;                                           // 0x0C68(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0C6C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x0C6D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0C6E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x0C6F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x0C70(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x0C71(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x0C72(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x0C73(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x0C74(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x0C75(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x0C76(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0C77(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue;// 0x0C78(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x0C7C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x0C7D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x0C7E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x0C7F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x0C80(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x0C81(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x0C82(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x0C83(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x0C84(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x0C85(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x0C86(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x0C87(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue2;// 0x0C88(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x0C8C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0C8D(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue3;// 0x0C90(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x0C94(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue;              // 0x0C95(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x0C96(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x0C97(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x0C98(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x0C99(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x0C9A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x0C9B(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue4;// 0x0C9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue2;             // 0x0CA0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue13;                       // 0x0CA1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue11;                        // 0x0CA2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue14;                       // 0x0CA3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x0CA4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue15;                       // 0x0CA5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x0CA6(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x0CA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x0CAC(0x0004) MISSED OFFSET
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x0CB0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue;                         // 0x0CB8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterWeapon*                              K2Node_DynamicCast_AsShooterWeapon;                       // 0x0CC0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0CC8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0CC9(0x0007) MISSED OFFSET
	class APrimalWeaponBow*                            K2Node_DynamicCast_AsPrimalWeaponBow;                     // 0x0CD0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x0CD8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x7];                                       // 0x0CD9(0x0007) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                        // 0x0CE0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x0CE8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast3_CastSuccess;                          // 0x0CF0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_IntInt_ReturnValue;                    // 0x0CF1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0x0CF2(0x0002) MISSED OFFSET
	struct FVector                                     CallFunc_GetVelocity_ReturnValue;                         // 0x0CF4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsTargeting_ReturnValue;                         // 0x0D00(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x0D01(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X;                                   // 0x0D04(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x0D08(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x0D0C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector2D                                   CallFunc_MakeVector2D_ReturnValue;                        // 0x0D10(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x0D18(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x0D19(0x0003) MISSED OFFSET
	float                                              CallFunc_VSize2D_ReturnValue;                             // 0x0D1C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x0D20(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BPWeaponCanFire_ReturnValue;                     // 0x0D21(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue16;                       // 0x0D22(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsPlayingWeaponAnimMontage_ReturnValue;          // 0x0D23(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsPlayingWeaponAnimMontage_ReturnValue2;         // 0x0D24(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue17;                       // 0x0D25(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x0D26(0x0002) MISSED OFFSET
	class USkeletalMeshComponent*                      CallFunc_GetOwningComponent_ReturnValue;                  // 0x0D28(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_BoolBool_ReturnValue;                   // 0x0D30(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsTimeSince_ReturnValue;                         // 0x0D31(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue7;                          // 0x0D32(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass TekBow_FPV_AnimBlueprint.TekBow_FPV_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2338();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2337();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2335();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2334();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2333();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2332();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2331();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2330();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2329();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2328();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2327();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2326();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2325();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2324();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2323();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2322();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2321();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2320();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2319();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2318();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2317();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2316();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterTargetIdle();
	void AnimNotify_EndPullString();
	void ExecuteUbergraph_TekBow_FPV_AnimBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
