#pragma once

// ARKSurvivalEvolved (320.18) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_FPV_FishingNet_AnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FPV_FishingNet_AnimBP.FPV_FishingNet_AnimBP_C
// 0x0659 (0x0999 - 0x0340)
class UFPV_FishingNet_AnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_009846A44D7142B720CE229E2412F908;      // 0x0340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5EEE64240ADA4CFACCC7D87A2989F82;// 0x0368(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5CF92E60432B3B97F9E18EAD005AFB29;// 0x0380(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD421A714E4ECB5C4EF267A9A6BC7AAF;// 0x0398(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A182B9B4C23A0A73892AC8CFFDF56BC;// 0x03B0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03A7468E436798E10E02CCA3B5DC61F4;// 0x03C8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB7F311940B10D8AAE251A85F50136F6;// 0x03E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E68460054696171C0D6596A5CAD77A50;// 0x03F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_06256D0D4AD3579926B9119586D4AE33;// 0x0410(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82352AAD449A3C7D6D9A1F9416B9CCC5;// 0x0428(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C67F0A5241BDD4FE71AD5CA32BD6FF0C;// 0x0440(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_950E514A4116DAAEEAB599B06166F86C;// 0x0458(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AF38C4D4507D9E394006890CC571153;// 0x0470(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9DE45EF4B67F230C30755850F97C4D5;// 0x0488(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24D31E6F46FBB463558E3E97B334A91B;// 0x04A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C3A952644FE937EB0F80C99C4722BD9;// 0x04B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCF7A320437447471E7250AC154AD3F6;// 0x04D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5538AE99403C986B290A57B1EF378A9B;// 0x04E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AD636ED49DD1044FA9C6D9AFC93B7E3;// 0x0500(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85DE5B894766CE1C3F8D4A9C3058B1B5;// 0x0518(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF29792843A385E418B916A1C413F103;// 0x0530(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6114B954CB3A73EF39D1DB25055CFE2;// 0x0548(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C3C1F8694993BBC9940FF298F93988CE;// 0x0578(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_307B831B434725DE19F9C4A453FD90A3;// 0x05A0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C766FC7A427DB774BA7E3E8D23A2FB94;// 0x05D0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_72DA9B5B448FDEF388F6A2A8B86590D3;// 0x05F8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C409683489276ACEFE6F3A44EF9BE15;// 0x0628(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9AE6493648E2FD65A1FD31966B1ECF95;// 0x0650(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_294CBF8C47E966C2D22C108856552544;// 0x0680(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_821E7D5F4B46A33B234393B9774CCF45;// 0x06A8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5F0C94CD4AB02B157EE45094AA850366;// 0x06D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4C2216341474A20C8DC92BFDBDE798A;// 0x0700(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B78A3E04098FFC9082548A67191332C;// 0x0730(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F059768469D7B67E64E8C9CDA73E75C;// 0x0758(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CEEF81406F6CD0435E2BA814E0A2C7;// 0x0788(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0297AD814AF85B19AAE83289EBDDA74E;// 0x07B0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DD4E13A4031A9B83A75688C868BAC67;// 0x07E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E7133314C6731D43725D083EF7C7ADD;// 0x0808(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8CE3BAFF4353A10A70FD5EBDC2B78841;// 0x0838(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D9A786B9471FB18BA3C4BEA10876B5D1;// 0x0860(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_69392A16425675C809AC538E57EBFB3E;      // 0x08C0(0x0038)
	bool                                               IsRunning;                                                // 0x08F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsMoving;                                                 // 0x08F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsCooking;                                                // 0x08FA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x08FB(0x0001) MISSED OFFSET
	float                                              CookingTime;                                              // 0x08FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsCasted;                                                 // 0x0900(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFullyCasted;                                            // 0x0901(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFullyCooked;                                            // 0x0902(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Has_Fish_In_Net;                                          // 0x0903(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               return_to_idle_fast;                                      // 0x0904(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0905(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0906(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x0907(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x0908(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x0909(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x090A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x090B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x090C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x090D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x090E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x090F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x0910(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x0911(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x0912(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x0913(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x0914(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x0915(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x0916(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x0917(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x0918(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x0919(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue13;                       // 0x091A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue14;                       // 0x091B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x091C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x091D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue15;                       // 0x091E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x091F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue16;                       // 0x0920(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue17;                       // 0x0921(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x0922(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue11;                        // 0x0923(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue12;                        // 0x0924(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue18;                       // 0x0925(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsDedicatedServer_ReturnValue;                   // 0x0926(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0927(0x0001) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x0928(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x092C(0x0004) MISSED OFFSET
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x0930(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AWeapFishingNet_C*                           K2Node_DynamicCast_AsWeapFishingNet_C;                    // 0x0938(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0940(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0941(0x0007) MISSED OFFSET
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue;                         // 0x0948(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsTimeSince_Network_ReturnValue;                 // 0x0950(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0951(0x0003) MISSED OFFSET
	int                                                CallFunc_Array_Length_ReturnValue;                        // 0x0954(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue19;                       // 0x0958(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_IntInt_ReturnValue;                      // 0x0959(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x095A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x5];                                       // 0x095B(0x0005) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                        // 0x0960(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x0968(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x0970(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x0971(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_HasBuff_ReturnValue;                             // 0x0972(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue13;                        // 0x0973(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetVelocity_ReturnValue;                         // 0x0974(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x0980(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x0984(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x0988(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector2D                                   CallFunc_MakeVector2D_ReturnValue;                        // 0x098C(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSize2D_ReturnValue;                             // 0x0994(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x0998(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FPV_FishingNet_AnimBP.FPV_FishingNet_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_2004();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_2003();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_2002();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_2001();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_2000();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1999();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1998();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1997();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1996();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1995();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1994();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1993();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1992();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1991();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1990();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1989();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1988();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1987();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1986();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_FishingNet_AnimBP_AnimGraphNode_TransitionResult_1985();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void ExecuteUbergraph_FPV_FishingNet_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
