#pragma once

// ARKSurvivalEvolved (301.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_Mek_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Mek_AnimBlueprint.Mek_AnimBlueprint_C
// 0x1B8E (0x1ECE - 0x0340)
class UMek_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_6E3B0C86409277162F11C9B0CC01B8CB;      // 0x0340(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_62830BFD43FB2548B7F8C3958BE97551;      // 0x0368(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_150443224C9AE3E8973B4F8F8CEA0311;      // 0x03A0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F9E24B1F4DD070B87D469CB0B6F22F9E;      // 0x03D8(0x0038)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FCD9329E4D13A2E73A6E9CA718012410;// 0x0410(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_56BBC5794DFADD50BEB0E582B8969B1E;// 0x0450(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_187C4E7D4863AE3C9A3EA991813E9D41;// 0x04B0(0x00E0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_32BA907F413A79B4BDF52A8E79F4E990;// 0x0590(0x00F8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_533BD72B4A287B43EB3643A4DAAFC82F;// 0x0688(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_005886524F4CCF4410CFEDA3842845BC;// 0x06E8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_58B140054F67C8200E798F81D4F1A9DE;// 0x0710(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BFC62C3D4A94EE05572D278786475662;// 0x0750(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_AFE65D9D45B5BA5C009263B1171EF65C;// 0x0778(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5594C649438011F4179B3485DA9F2C6A;// 0x07E8(0x0030)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0818(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_30E584DB4566B2A101189A964B942054;// 0x0820(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9A545470473B0FD9C540798EFC6EF078;// 0x08D0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F34C200C4BBCA1535A91BA888F1E5F80;// 0x08F8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7AE0CD824F5D3D7A0279FFACCC372124;// 0x0920(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FF204D7D4901016B033DF4B9DE8A5FA4;// 0x0980(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_17FB564C49FD81351847DBAE9DED62F4;// 0x09A8(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FFCF728247B56F0985A05490498DA1F5;// 0x0A08(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8A47845C474CAFEEF24A338374BD7EB0;// 0x0AE8(0x0080)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9BDE7CE64181E43862F071A512A86031;// 0x0B68(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_51C987B946F74B1B280BF2A116A2B739;// 0x0C60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DE50FC649DD6CE7CE803D88E5654100;// 0x0C88(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51B456B5411CFD59E780C5BFBA3997B5;// 0x0CA0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09B74046450124DBE8C7E9A135CE4370;// 0x0CB8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6A6AA0C408138C3674846898EAC5A7A;// 0x0CD0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8521B2D748E788BF0122BC99195F9BF3;// 0x0CE8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_785F059A44CDE90F08C41B9B6DEAC0E6;// 0x0D00(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAD06C2E485AE78D8872D0A73C52923F2;// 0x0D30(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C75608E348DE857C8C2AFC8066FE0111;// 0x0D58(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAD06C2E485AE78D8872D0A73C52923F;// 0x0D88(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7635D8724FE8B731AC8F4E8E79AA2A48;// 0x0DB0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7D4FA364FE58F91A9875DBBA2D28D40;// 0x0E00(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E16F05934285E50B1C7818A76FB2D277;// 0x0E30(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E220247144984C3299BACE9B34800407;// 0x0E58(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4B27D7194853DC52496ECE87452D9940;// 0x0E80(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_50DE2B214B32A5AFACD609B8877005C8;// 0x0EE0(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_343EEADB422434798E7C02A9205215A7;// 0x0F08(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F9295F124007FBEE66F5598154C291D1;// 0x0F30(0x0028)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0F58(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_47AB389B4CA64483236EC49B215DAE55;// 0x0F60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC6040AD40719B82A252D1ABD98D228F;// 0x1010(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E5FC5AE241880524412A16B428A4A220;// 0x1040(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_037B70D44C01D9690CBABBB9B068D118;// 0x1068(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_558A0921439E9F087AB8D9950A093A3E;// 0x10C8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B5E0BDEA4D5432914C6BB3A9655E088C;// 0x1108(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8E9DA8BF446783731C5D22B754E836BC;// 0x1168(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_362447CD42AF452019FA72AD351C1DA7;// 0x1190(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6918455747369B2DCAED95B984DE11C2;// 0x11D0(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4216AAEB443D526F3E9D1DA1EDB41E38;// 0x11F8(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C468B3634EB82EAD65D0D8BAB1FD3E0A;// 0x12D8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5FAFDB754E13AC54B18687A9FE6F6995;// 0x1328(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4DA334034C319B5248CF6287F8DE1F80;// 0x1388(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_808451D646B5E1800B5E3580A74FF5AD;// 0x13C8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_21C3D2C2449AF5EEE21B498FC142CBA4;// 0x13F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2CCA7C442FF9E8A3A54958737D0EC51;// 0x1418(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA9CD7A449FAA263A0BCA78ACEEE8C63;// 0x1430(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AFD424564F5B1B196015FEA49592F56B;// 0x1448(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_995C74AE4CC397A6CB538786050073E7;// 0x1460(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8BB4FBF41113D505AE83B8C49EB8755;// 0x1478(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42181050433C47ACAE0344AB229D51FD;// 0x1490(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24254B8B44396AE1A060AE8F746CE9B9;// 0x14A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E964003D4623AE440AA616B8397DF5BC;// 0x14D8(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_680DDADA4FBA05F48D98B8A00AC3C378;// 0x1508(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A293E47D4F886530901DC3B532DF694A;// 0x1568(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DEFB93B94D2166DF6BC9ACA977E1DF01;// 0x1590(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67188C804361FE7692239DBD87C29E82;// 0x15F0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_109D2D2B4159841F08C89899839DD226;// 0x1620(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DB527941465D698E1E6FBF8210D51543;// 0x1650(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DEF867364AE7F9C3E52D238E0885E0A0;// 0x1678(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_788E1D544B6DFF4BD237DBB42EEDBA6D;// 0x16A8(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CA210C0C4CE917CA393B308AD4E5660D;// 0x16D0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_19501FFC47D61295B44708B6B2F0763C;// 0x1730(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E6605E0A47710AC9FC0914B9DF2BF1BA;// 0x1770(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5A42537143D60AEF76394FAE3DB258B5;// 0x17B0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CB1A232345DB9EBC7348A5871DEC5817;// 0x17D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_361C79BE4B5B9D84462A7888B2F6224F;// 0x1800(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D67DA2514646CF4A1491779C1726E4F0;// 0x1828(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EA2BE0394D1A6BE15D7070A6A348F9CD;// 0x1850(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_377FEDE94D8679AD0959B7A929E609BE;// 0x1878(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_01E105B74C54E043F1B2BCB3A9DD4778;// 0x18C8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6209467149F85E11F25E0ABB9B92C7AE;// 0x18F0(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_84422093471FE27FE81A48AF4CE1A027;// 0x1920(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_57AACB9246D064BCBF071EB2AB53CA26;// 0x19D0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_234F7E204FE13A28AA81FB925AF34023;// 0x1A80(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_585AA56548D3C9C8B5A2DC802CB7729D;// 0x1B30(0x00B0)
	bool                                               IsMoving;                                                 // 0x1BE0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsRunning;                                                // 0x1BE1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFalling;                                                // 0x1BE2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsHovering;                                               // 0x1BE3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurning;                                                // 0x1BE4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurningRight;                                           // 0x1BE5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurningFast;                                            // 0x1BE6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x1BE7(0x0001) MISSED OFFSET
	float                                              CurrentTurningRate;                                       // 0x1BE8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsAimingPistol;                                           // 0x1BEC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsAiming;                                                 // 0x1BED(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x1BEE(0x0002) MISSED OFFSET
	float                                              AimPitch;                                                 // 0x1BF0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYaw;                                                   // 0x1BF4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch_Smoothed;                                        // 0x1BF8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x1BFC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    RootRotationOffset;                                       // 0x1C08(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AlignGroundAlpha;                                         // 0x1C14(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRate;                                         // 0x1C18(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MoveForward;                                              // 0x1C1C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MoveRight;                                                // 0x1C20(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverRight;                                               // 0x1C24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverForward;                                             // 0x1C28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         CurrentMovementMode;                                      // 0x1C2C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x1C2D(0x0003) MISSED OFFSET
	float                                              MinTurnRateForAnimation;                                  // 0x1C30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExtraSpineRotation;                                       // 0x1C34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinTurnRateForFastTurns;                                  // 0x1C38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BackpackType;                                             // 0x1C3C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               BackpackAbilityActive;                                    // 0x1C44(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PreventLeanBackAnims;                                     // 0x1C45(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x1C46(0x0002) MISSED OFFSET
	float                                              TurnInPlace15AnimPlayRate;                                // 0x1C48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnInPlace90AnimPlayRate;                                // 0x1C4C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GroundMoveAnimPlayRate;                                   // 0x1C50(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GoundRunAnimPlayRate;                                     // 0x1C54(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   SiegeCannonPitchAngleRange;                               // 0x1C58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   SiegeCannonPitchAimInputRange;                            // 0x1C60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    AimOffsetRotation;                                        // 0x1C68(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    LeftShoulderHoverAimingRotationOffset;                    // 0x1C74(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   PistolAimOffsetOffsetWhileHovering;                       // 0x1C80(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x1C88(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x1C89(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x1C8A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x1C8B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue;          // 0x1C8C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x1C90(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x1C91(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x1C92(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x1C93(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X;                                 // 0x1C94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y;                                 // 0x1C98(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Pitch;                                  // 0x1C9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw;                                    // 0x1CA0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll;                                   // 0x1CA4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x1CA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue;                              // 0x1CAC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_MakeRot_ReturnValue;                             // 0x1CB0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x1CBC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x1CBD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x1CBE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_NameName_ReturnValue;                 // 0x1CBF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x1CC0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x1CC1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x1CC2(0x0002) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;       // 0x1CC4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x1CC8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x1CC9(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;      // 0x1CCC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x1CD0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x1CD1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x1CD2(0x0002) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x1CD4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X2;                                // 0x1CD8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y2;                                // 0x1CDC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue;                      // 0x1CE0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue;                            // 0x1CE4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue2;                             // 0x1CE8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue2;                        // 0x1CEC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue2;                     // 0x1CF0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue3;                             // 0x1CF4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue3;                        // 0x1CF8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x1CFC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x1D00(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalDinoCharacter*                        K2Node_DynamicCast_AsPrimalDinoCharacter;                 // 0x1D08(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x1D10(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x1D11(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2];                                       // 0x1D12(0x0002) MISSED OFFSET
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue;                 // 0x1D14(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x1D20(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetDinoVelocity_ReturnValue;                     // 0x1D24(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AMek_Character_BP_C*                         K2Node_DynamicCast_AsMek_Character_BP_C;                  // 0x1D30(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x1D38(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x1D39(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_LessLess_VectorRotator_ReturnValue;              // 0x1D3C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue2;                // 0x1D48(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x1D54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x1D58(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x1D5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetInputDirectionVector_ReturnValue;             // 0x1D60(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x1D6C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x1D70(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetCharacterViewLocationAndDirection_ViewLocation;// 0x1D74(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetCharacterViewLocationAndDirection_ViewDirection;// 0x1D80(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_GetCharacterViewLocationAndDirection_bFromCrosshairOrCamera;// 0x1D8C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x1D8D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x2];                                       // 0x1D8E(0x0002) MISSED OFFSET
	struct FRotator                                    CallFunc_MakeRotFromX_ReturnValue;                        // 0x1D90(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue3;                // 0x1D9C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_GetEquippedBackpack_HasBackpack;                 // 0x1DA8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x7];                                       // 0x1DA9(0x0007) MISSED OFFSET
	class ABuff_MekBackpack_Base_C*                    CallFunc_GetEquippedBackpack_BackpackBuff;                // 0x1DB0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FName                                       CallFunc_GetEquippedBackpack_BackpackType;                // 0x1DB8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsCurrentlyTargeting_IsTargeting;                // 0x1DC0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsBackpackActive_IsActive;                       // 0x1DC1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x1DC2(0x0002) MISSED OFFSET
	float                                              CallFunc_VSize_ReturnValue;                               // 0x1DC4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue3;                  // 0x1DC8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetLastMovementDesiredRotation_ReturnValue;      // 0x1DCC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x1DD8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x1DD9(0x0003) MISSED OFFSET
	struct FRotator                                    CallFunc_NormalizedDeltaRotator_ReturnValue;              // 0x1DDC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetAimOffsets_RootRotOffset;                     // 0x1DE8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAimOffsets_TheRootYawSpeed;                   // 0x1DF4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetAimOffsets_RootLocOffset;                     // 0x1DF8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetAimOffsets_ReturnValue;                       // 0x1E04(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Pitch2;                                 // 0x1E10(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw2;                                   // 0x1E14(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll2;                                  // 0x1E18(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue4;                  // 0x1E1C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue5;                  // 0x1E20(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue3;                // 0x1E24(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue4;                // 0x1E28(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue3;                     // 0x1E2C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue4;                     // 0x1E30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue4;                             // 0x1E34(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue5;                             // 0x1E38(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Abs_ReturnValue;                                 // 0x1E3C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x1E40(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x1E41(0x0003) MISSED OFFSET
	float                                              CallFunc_Abs_ReturnValue2;                                // 0x1E44(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x1E48(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsServer_ReturnValue;                            // 0x1E49(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x2];                                       // 0x1E4A(0x0002) MISSED OFFSET
	struct FVector                                     CallFunc_SelectVector_ReturnValue;                        // 0x1E4C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_LessLess_VectorRotator_ReturnValue2;             // 0x1E58(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Multiply_VectorVector_ReturnValue;               // 0x1E64(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Normal_ReturnValue;                              // 0x1E70(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Multiply_VectorFloat_ReturnValue;                // 0x1E7C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue4;                 // 0x1E88(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x3];                                       // 0x1E89(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_BoundToCube_ReturnValue;                         // 0x1E8C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X2;                                  // 0x1E98(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x1E9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x1EA0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue5;                 // 0x1EA4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x1EA5(0x0003) MISSED OFFSET
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue2;         // 0x1EA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue6;                 // 0x1EAC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_NameName_ReturnValue2;                // 0x1EAD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x1EAE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x1EAF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x1EB0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x1EB1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x1EB2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x1EB3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x1EB4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x1EB5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x2];                                       // 0x1EB6(0x0002) MISSED OFFSET
	float                                              CallFunc_GetWorldDeltaSeconds_ReturnValue;                // 0x1EB8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_ReturnValue;                           // 0x1EBC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_RInterpTo_ReturnValue;                           // 0x1EC0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_NameName_ReturnValue3;                // 0x1ECC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x1ECD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Mek_AnimBlueprint.Mek_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_BlendListByBool_2433();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_128();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_148();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_BlendListByBool_2432();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_BlendListByEnum_24();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_ModifyBone_519();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mek_AnimBlueprint_AnimGraphNode_BlendListByBool_2431();
