#pragma once

// ARKSurvivalEvolved (332.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_Dinopithecus_AnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Dinopithecus_AnimBP.Dinopithecus_AnimBP_C
// 0x2451 (0x2791 - 0x0340)
class UDinopithecus_AnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9F8BCDDC45290D41C6CBD5B6AAD60B1B;// 0x0340(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F5102F644497AA20FFEB78BFF4F5F195;// 0x0368(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65FCDE70432D50F2A36B88BA2D519C1A;// 0x0390(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8A2D330B42A5CE57CE6B7B82C29F3702;// 0x03F0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C66D8FE48464DC96E157D9D8C71B325;// 0x0450(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C85914E3464D4E74E039E9A8C2AF8446;// 0x0480(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4EE286504D24975BB7B61ABBFA0A3026;// 0x04B0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4389FC404EB653A5E5517EA0A11BF5FE;// 0x0510(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4B9B991241C84B56A0BA1FB2D011E651;// 0x0570(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A87D1CC64B8BAE7D8221359581B5BBEF;// 0x05A0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_299BA3204DAE69CC2AB0ED8A2BBA94C5;// 0x05D0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_71E16B9C4223770EBD08898A6C574D8B;// 0x0600(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6AB92472440C1933F2ED95B97D8C345F;// 0x0660(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7035B0E342E6802FA821119FB51AA267;// 0x06C0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_254CDF0E4AC95F4089FB16B75269FAAC;// 0x06F0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B17141484CE174C01EFDA9916137E983;// 0x0720(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BC80641C4324D528FCCC3583D78B5BC2;// 0x0780(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_26D0B81F446E9E02DEF53FB4E3905CD1;// 0x07E0(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E130C1184EDE20926CF7E3838813953D;// 0x0840(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FD1F217E4FEFBCF1EE7D549F3E52F8F4;// 0x0868(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_58E215E1404BDFA779619FAE2D41D502;// 0x0890(0x0028)
	unsigned char                                      UnknownData00[0x8];                                       // 0x08B8(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E8EF946443253457D7C57584EC59096C;// 0x08C0(0x00B0)
	struct FAnimNode_MultiFabrik_Dinos                 AnimGraphNode_MultiFabrik_Dinos_39C117BE4062ED4C1ADC1E9769648DD3;// 0x0970(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_272C0A184FC7E3369A726CA76814452F;// 0x09C8(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_65724A58450BC506B18DE5BDB51D68E0;      // 0x0A28(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6695501A44E6D4A48EA5BDB81FD1B478;      // 0x0A60(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_29D1831540B51871999759B75AEBC4C2;      // 0x0A98(0x0038)
	struct FAnimNode_GroundBones                       AnimGraphNode_GroundBones_5C11B8184E02C7D8B84913BB42CC7F7C;// 0x0AD0(0x00B8)
	struct FAnimNode_GroundBones                       AnimGraphNode_GroundBones_9FBC486348675B5966CCDD92A200A67E;// 0x0B88(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FB2B46374F53AB62B439F6AB4D895D03;// 0x0C40(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3F6589E34E6D440193113CBD7CCBBE5D;// 0x0CA0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_88989851454EA6328393FBAC3AB8D5CA;// 0x0CC8(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96D605214463FA7B7F4B53A90A30B6A2;// 0x0D08(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F1272C674C97BDB979124B95A3999699;// 0x0D30(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_ACEA2381474F45A8AA495E8E343EF38C;// 0x0D58(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_496418884752BF98B3F7BA8D687008B7;// 0x0D80(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_89703E924B66E2DA01A8EEBD8D451C98;// 0x0DB0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1E6094C845D46EC15C3B408E299174DF;// 0x0E00(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F8AFC2034D9B9CA8988550A02E65A1AB;// 0x0E30(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A2E5727B46F5FC6CB763A5A3234CBD58;// 0x0E90(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE531DD14C24FB14B7981D9AB90B6493;// 0x0EF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC08EDBD4E383EEFC6B5C3BF4682508D;// 0x0F20(0x0030)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_608AD80B495366FAEDEE99AD8AE0BE64;// 0x0F50(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E0DFC1A444EAFA2A89E51BEF8F908F0;// 0x0FC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DECBB9346AAC6685707279BD23D7571;// 0x0FF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C9823E984A0BD4029F4CC093ECC52A24;// 0x1020(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BEEA6A50419D71AF7D81E1A0CA7C848C;// 0x1050(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA105CB94AB2C34EEB68FC84E3DA7475;// 0x1080(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8195AD4941AC3ABD2B7B15B9F80293F3;// 0x10B0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0DF6BFB489B941276694997AF857295;// 0x10E0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_69AB67084D3BC5D3DC4B448215B70A11;// 0x1140(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CFC8E9694A47A50AE2AAE0BFF908E49D;// 0x11A0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB310601404BBA5FE07E059D18B284EB;// 0x11D0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EBA6E10742E325E44D06DE8BAB97A8B0;// 0x1200(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D2B5C80B4FE834D0D3B0FC87BF75D08D;// 0x1230(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_067E8C7643413EAA9FC51A8DC0E7E078;// 0x1270(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0396E817487244806A74D78C644E0ECA;// 0x12D0(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E6BF97394C533D463CE1438245A8DDBD;      // 0x1330(0x0038)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9535F4BD40B100F58ADD1EA85F934C31;// 0x1368(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DB031B1C46BEA8551F441790B17818F1;// 0x1398(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D26199234491BA4962DA6584F0CC1DF9;      // 0x13F8(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C6EDB7914269C6CF817FA88398E3929E;      // 0x1430(0x0038)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_12B388A2435CF83BB3E556AEE08338B8;// 0x1468(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B9205D9943E21B43E8B43CB478AC7624;// 0x1490(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3CEA48F24F2A7D04CE8D9688F706472E;// 0x1540(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F76666CD48D809233B1EDDAA9CF80101;// 0x1568(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60C646344A22F63C44DCAFB2CF0EE55D;// 0x15C8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_953ED6B04FD5F51980E392B4CC993079;// 0x15F0(0x00F8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE42E6F14BD52B11A2E3E8B1B5E19D71;// 0x16E8(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E48BA7C1400E40EDB7310388E089C90F;// 0x1718(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2FFB4C7D4CED842E5BA64E909DA67040;// 0x1778(0x0060)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_84B3B9414DB5FECD358A659259EFC10C;// 0x17D8(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B81839064C7766A2F3FB638AFA93D064;// 0x18D0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_D0F939704DFC621870990EA3450568FE;// 0x18F8(0x00F8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_701812294AC5B804F5C4C393BD6BF07A;// 0x19F0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B22C50D4586C1ABBCC05990DD3BD5D9;// 0x1A50(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0BE9813C4C8EFD6DFEB3FCACA0EDD750;// 0x1A80(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B88B129A44D555DD98AA3C9D082FA745;// 0x1AE0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CC5FD8D4795D983B731FA8EA034C16B;// 0x1B40(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6871362848AD8EB465FD88B2377CF818;// 0x1B70(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E838786E4C208E6AB252FAA7AB6F7AD3;// 0x1BA0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43F64B8247BBDCF5C7A79785E09C18D9;// 0x1C00(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_83AA853A45C52858A24201849373D2C1;// 0x1C30(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_437D330E4C200B59F14077ABB4BE17C8;// 0x1C60(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2883EEFA40723800FD550989A8CAEA6D;// 0x1CC0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A979AF474AA72E07D2CA328D07471C54;// 0x1CF0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F8176FB7463130FBD49A40AC8AA0C5A9;// 0x1D50(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29E6B6D46328F883516B48715C9722B;// 0x1D80(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D65EFA24F8CBD4A7BDA84B5D51914F5;// 0x1D98(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AF415594A62334991DDA29FCE1530F2;// 0x1DB0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E64956E648F84F3DBDFD72BDAEBA8F2B;// 0x1DC8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_375033FE4AFC63F5E975F0BBF06AA018;// 0x1DE0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C879D2BC40A6548EA09E049C0714921B;// 0x1DF8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33CBA8DC4DAA1352414B6CA40236AC50;// 0x1E10(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8AAA0A7484955AEF15CE18E45F1E00E;// 0x1E28(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9391349D40F50ACE930705B39132743E;// 0x1E40(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AF42CFB4D54F8970180CD83C4DB3971;// 0x1E58(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BD1FE3947B7E5FD2C3B168F602A82A2;// 0x1E70(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE1039C646FFD695FDDCF5AE6FFD3ADE;// 0x1E88(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77C4D6654289C7C7D7F961B8C9E77863;// 0x1EA0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1122D664497153C3437E70B05F4F0CD3;// 0x1EB8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F41F6B784D6DCA5F824E91B72B2DD5DF;// 0x1ED0(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4464045D4D56D57EF64BB0B320651897;// 0x1EE8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0E8DF72E4A08DB9B28DB1A9F2B7D7CDA;// 0x1F18(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3BEB70144D9AE7F6EF653AB54C02EFD6;// 0x1F40(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D37365164704EA300DA1FCAE65C67CE6;// 0x1F70(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_205C29904A71A105AD97559773EBED2A;// 0x1F98(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ACF3BAD54B99F5A1DFE1CDB70EC34701;// 0x1FC8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2681C5BF4162428D4B1D42B104871409;// 0x1FF0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8C3A62D64128A46F2C0AD19A95C2357B;// 0x2020(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B43052664E05621091B91A8515998FCD;// 0x2080(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EA962FC944970A21DCE570BA76F6D208;// 0x20B0(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA01D23D44FCE3AC485A618D879F7420;// 0x20D8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F2B3487D4935B3E8F4EFB5B9D17BC7B3;// 0x2138(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A56C88524FCE729197E38B97BC842276;// 0x2198(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8C063FD049BE3383FA0451AFD5F18E91;// 0x21C8(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_542EE8F04AE9EDC9115A509CFB5DDA48;// 0x2218(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_EE4B99F44BE410CA58BE99AAA9EF47AE;      // 0x2248(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_729215224AB1CCA2D1A21FB1D3A0224C;// 0x2270(0x0030)
	bool                                               bIsMoving;                                                // 0x22A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x22A1(0x0003) MISSED OFFSET
	struct FRotator                                    RootRotationOffset;                                       // 0x22A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch;                                                 // 0x22B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYaw;                                                   // 0x22B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x22B8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAimOffset;                                            // 0x22C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x22C5(0x0003) MISSED OFFSET
	float                                              MovementAnimRate;                                         // 0x22C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsHovering;                                              // 0x22CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x22CD(0x0003) MISSED OFFSET
	float                                              MaxMovementAnimRate;                                      // 0x22D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseFalling;                                              // 0x22D4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x22D5(0x0003) MISSED OFFSET
	float                                              MovingAnimSpeedTreshold;                                  // 0x22D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinMovementAnimRate;                                      // 0x22DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsTurning;                                               // 0x22E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTurning;                                              // 0x22E1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTurningRight;                                            // 0x22E2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x22E3(0x0001) MISSED OFFSET
	float                                              TurningEnabledBlendTime;                                  // 0x22E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningDisabledBlendTime;                                 // 0x22E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningDirectionBlendTime;                                // 0x22EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinTurnRateForTurnAnimation;                              // 0x22F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseSwimming;                                             // 0x22F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSwimming;                                              // 0x22F5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x22F6(0x0002) MISSED OFFSET
	float                                              SwimmingMovingAnimSpeedThreshold;                         // 0x22F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingAnimPlayRate;                                      // 0x22FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingBlendInTime;                                       // 0x2300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingBlendOutTime;                                      // 0x2304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovingBlendInTime;                                        // 0x2308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovingBlendOutTime;                                       // 0x230C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRunning;                                               // 0x2310(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRunning;                                              // 0x2311(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseSleepingAnim;                                         // 0x2312(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSleeping;                                              // 0x2313(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SleepingAnimTranslationOffset;                            // 0x2314(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRatePower;                                    // 0x2320(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTurnInPlaceAnimation;                                 // 0x2324(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSkipAnimGraph;                                           // 0x2325(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x2326(0x0002) MISSED OFFSET
	float                                              AlignGroundAlpha;                                         // 0x2328(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAlignGround;                                          // 0x232C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseBlinking;                                             // 0x232D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x232E(0x0002) MISSED OFFSET
	float                                              BlinkBlend;                                               // 0x2330(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IKAlpha;                                                  // 0x2334(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningBlendInTime;                                       // 0x2338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningBlendOutTime;                                      // 0x233C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningMovementAnimRate;                                  // 0x2340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRunningMovementAnimRate;                              // 0x2344(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisableIKWhenFalling;                                    // 0x2345(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisableIK;                                               // 0x2346(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x1];                                       // 0x2347(0x0001) MISSED OFFSET
	float                                              AimOffsetPitchScale;                                      // 0x2348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetYawScale;                                        // 0x234C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSleepingEnableIK;                                        // 0x2350(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsStrafing;                                              // 0x2351(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0x2352(0x0002) MISSED OFFSET
	float                                              StrafingMovementAnimRate;                                 // 0x2354(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanStrafe;                                               // 0x2358(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x2359(0x0003) MISSED OFFSET
	struct FVector2D                                   StrafeMovementAxes;                                       // 0x235C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData12[0x4];                                       // 0x2364(0x0004) MISSED OFFSET
	class UBlendSpace*                                 StrafeBlendspace;                                         // 0x2368(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StrafeMovementAnimRateScalar;                             // 0x2370(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsAscending;                                             // 0x2374(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsDecendingRapidly;                                       // 0x2375(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x2376(0x0002) MISSED OFFSET
	float                                              TurnAlpha;                                                // 0x2378(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrevTurnAlpha;                                            // 0x237C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           IdleSequence;                                             // 0x2380(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           DefaultIdleSequence;                                      // 0x2388(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsFalling;                                               // 0x2390(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x2391(0x0003) MISSED OFFSET
	struct FVector                                     PrevActorLocation;                                        // 0x2394(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           FallingSequence;                                          // 0x23A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingAscendingBlendOutTime;                             // 0x23A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsBerzerk;                                                // 0x23AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayAddictedIdle;                                         // 0x23AD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData15[0x2];                                       // 0x23AE(0x0002) MISSED OFFSET
	double                                             LastTimePlayedAddictedIdle;                               // 0x23B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AddictionIdleCooldownBase;                                // 0x23B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinAddictionCooldown;                                     // 0x23BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             LastTimeExpressedAddiction;                               // 0x23C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayingLatchedJump;                                       // 0x23C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EShapeshifterIdleAnimEnum>             IdleAnim;                                                 // 0x23C9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FallingFromRecentLatch;                                   // 0x23CA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData16[0x1];                                       // 0x23CB(0x0001) MISSED OFFSET
	float                                              DistanceToTargetToSwitchToPounceIdle;                     // 0x23CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UZiplineComponent_Base_C*                    ZiplineComponent;                                         // 0x23D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsUsingZipline;                                          // 0x23D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsZiplineRunning;                                        // 0x23D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSliding;                                               // 0x23DA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ZiplineJumping;                                           // 0x23DB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHangingOnZipline;                                        // 0x23DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseThrowAimOffset;                                       // 0x23DD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData17[0x2];                                       // 0x23DE(0x0002) MISSED OFFSET
	float                                              PoopIdleBlendTime;                                        // 0x23E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYawSmooth;                                             // 0x23E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYawSmoothInterpSpeed;                                  // 0x23E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AOEGroundPounceQueued;                                    // 0x23EC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x23ED(0x0003) MISSED OFFSET
	float                                              AimPitchSmooth;                                           // 0x23F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LatchedBlendOutTime;                                      // 0x23F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWasMoving;                                               // 0x23F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWasSliding;                                              // 0x23F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAlwaysUseAscendingFall;                                  // 0x23FA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUsePassengerAnim;                                        // 0x23FB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsMounted;                                               // 0x23FC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasFinishedAttaching;                                    // 0x23FD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bResetZiplineState;                                       // 0x23FE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWasUsingZipline;                                         // 0x23FF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsBabyRiding;                                             // 0x2400(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData19[0x3];                                       // 0x2401(0x0003) MISSED OFFSET
	float                                              FallingDelayAfterLatching;                                // 0x2404(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x2408(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x3];                                       // 0x2409(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_Add_VectorVector_ReturnValue;                    // 0x240C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x2418(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x2419(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x241A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x241B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x241C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x2420(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x2424(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x2425(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x2426(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x2427(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x2428(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue2;                // 0x2429(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x242A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x242B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x242C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x242D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x242E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x242F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x2430(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x4];                                       // 0x2434(0x0004) MISSED OFFSET
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x2438(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalDinoCharacter*                        K2Node_DynamicCast_AsPrimalDinoCharacter;                 // 0x2440(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x2448(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x2449(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsPrimalCharFalling_ReturnValue;                 // 0x244A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x244B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Lerp_ReturnValue;                                // 0x244C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetPendingInputVector_ReturnValue;               // 0x2450(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetDinoVelocity_ReturnValue;                     // 0x245C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue;                 // 0x2468(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue2;                // 0x2474(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_LessLess_VectorRotator_ReturnValue;              // 0x2480(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetForwardVector_ReturnValue;                    // 0x248C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Normal_ReturnValue;                              // 0x2498(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_LessLess_VectorRotator_ReturnValue2;             // 0x24A4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x24B0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x24B4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x24B8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Normal_ReturnValue2;                             // 0x24BC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_InRange_FloatFloat_ReturnValue;                  // 0x24C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x3];                                       // 0x24C9(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X2;                                  // 0x24CC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x24D0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x24D4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x24D8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x24D9(0x0003) MISSED OFFSET
	struct FVector2D                                   CallFunc_MakeVector2D_ReturnValue;                        // 0x24DC(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_InRange_FloatFloat_ReturnValue2;                 // 0x24E4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x24E5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_InRange_FloatFloat_ReturnValue3;                 // 0x24E6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x24E7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x24E8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_InRange_FloatFloat_ReturnValue4;                 // 0x24E9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData24[0x2];                                       // 0x24EA(0x0002) MISSED OFFSET
	float                                              CallFunc_GetDefaultMovementSpeed_ReturnValue;             // 0x24EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x24F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x24F1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x24F2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x5];                                       // 0x24F3(0x0005) MISSED OFFSET
	class UPawnMovementComponent*                      CallFunc_GetMovementComponent_ReturnValue;                // 0x24F8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_K2_GetActorLocation_ReturnValue;                 // 0x2500(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData26[0x4];                                       // 0x250C(0x0004) MISSED OFFSET
	class UCharacterMovementComponent*                 K2Node_DynamicCast_AsCharacterMovementComponent;          // 0x2510(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x2518(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData27[0x3];                                       // 0x2519(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakRot_Pitch;                                  // 0x251C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw;                                    // 0x2520(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll;                                   // 0x2524(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue3;                // 0x2528(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue4;                // 0x2529(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x252A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue5;                // 0x252B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue6;                // 0x252C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x252D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue7;                          // 0x252E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue7;                // 0x252F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue8;                // 0x2530(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue9;                // 0x2531(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData28[0x6];                                       // 0x2532(0x0006) MISSED OFFSET
	class ADinopithecus_Character_BP_C*                K2Node_DynamicCast_AsDinopithecus_Character_BP_C;         // 0x2538(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast3_CastSuccess;                          // 0x2540(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue10;               // 0x2541(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x2542(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x2543(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsLocallyControlledByPlayer_ReturnValue;         // 0x2544(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue11;                        // 0x2545(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x2546(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue12;                        // 0x2547(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue8;                          // 0x2548(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue13;                        // 0x2549(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue14;                        // 0x254A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         CallFunc_GetPrimalCharMovementMode_ReturnValue;           // 0x254B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_DoubleDouble_ReturnValue;                // 0x254C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_SwitchEnum_CmpSuccess;                             // 0x254D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue15;                        // 0x254E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x254F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue9;                          // 0x2550(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Has_Latchable_SurfaceWhileFalling_RetSucccess;   // 0x2551(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData29[0x6];                                       // 0x2552(0x0006) MISSED OFFSET
	struct FUberpounceData                             CallFunc_Has_Latchable_SurfaceWhileFalling_RetResultUberpounceData;// 0x2558(0x0030) (Transient, DuplicateTransient)
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue;                         // 0x2588(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue16;                        // 0x2590(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_SwitchEnum2_CmpSuccess;                            // 0x2591(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData30[0x6];                                       // 0x2592(0x0006) MISSED OFFSET
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue2;                        // 0x2598(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
