#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_BogSpider_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BogSpider_AnimBlueprint.BogSpider_AnimBlueprint_C
// 0x45B8 (0x48F8 - 0x0340)
class UBogSpider_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3859CC30468EB3FDC5555B9B5A6A73D9;// 0x0340(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A5B2B62F41A0740F356D0DACB08BE2AC;// 0x03A0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7F6B34D14CB4BBA1EB1D0DB2717BA93E;// 0x0400(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_50B9857C4DE2389EDE63969A147CE05C;// 0x0460(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_24902DAD496B043FB131C89233CD6F42;// 0x0488(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6EB5B9944848B3C1731B529C24B3F181;// 0x04B0(0x0028)
	unsigned char                                      UnknownData00[0x8];                                       // 0x04D8(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D02B2E214FB791667D0FECA6282E1A0B;// 0x04E0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_765C4032498C7524786B49ABD1CD93C7;// 0x0590(0x0060)
	struct FAnimNode_MultiFabrik_Dinos                 AnimGraphNode_MultiFabrik_Dinos_EEE7045243EB1B3E33632492A732BD66;// 0x05F0(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C058A092475494E42D4938861A80AEAF;// 0x0648(0x0060)
	struct FAnimNode_GroundBones                       AnimGraphNode_GroundBones_2054029E47AB4071619B37933801327E;// 0x06A8(0x00B8)
	struct FAnimNode_GroundBones                       AnimGraphNode_GroundBones_9C8636E24027868058CB5F916EEA68A1;// 0x0760(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5C27BA2405200F3840C7F98407DAB18;// 0x0818(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9708D3D04E08CDBE0E8D098E1AB08210;// 0x0878(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_431E8BD2436C014FA58620A5BAAE5328;// 0x08D8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A9D7F65848B505A5E04B09BB8063D88F;// 0x0900(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C64B843D4B822CB2A2609C88440B33A1;// 0x0940(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_07EF294246432882FE4C349DFCCB1A0E;// 0x0968(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E0E711F448A34AC25211AB9C69DE3ADD;// 0x0990(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2638F2D7460BE0D20FF245B8BE033736;// 0x09B8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_330DBFC3422A1F21B65EC2A940164A9A;// 0x0A18(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F5DC67C4FACD3BE735A3A9BCB5C93EE;// 0x0A48(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4039B3FA468A347B00B5D0A8CD880804;// 0x0A78(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1A1ECF104548E0640B62C8B4AC3F78A2;// 0x0AA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23F2333F4A233150FEE273B29642AF37;// 0x0AE8(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_14CB097B4CE66E925DD2AAB284EE7B94;// 0x0B18(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E286587F4C6E84B704BCFF99B7C01A43;// 0x0B58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E0F05F5D4757249F2384FEBF499B06FD;// 0x0B80(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_58AD9C884F39F685977AE681182F6F43;// 0x0BA8(0x00F8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_F987A5FD45515209A1BEBA93E8887947;// 0x0CA0(0x00F8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_271494B84570F95595631FA80BEC446D;// 0x0D98(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ECC5BEA54FB9EA08C6330381803EA7AF;// 0x0DF8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A842A8D942D7437CC70A89A0397A9242;// 0x0E20(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DED8FD3B46438C597138B59CB3E2E07D;// 0x0E48(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_86FA9C684AEF140617583BA376F915AD;// 0x0EA8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_407899AF482025D7CE8107BBCB1D8125;// 0x0F08(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_55C7594E43F9B49DE665A1BF5C2A6B25;// 0x0F68(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_86BF610448C6F441E8B33D8169EAE632;// 0x0FC8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A6BECED9411AF2DA26FB6D92626C0BD5;// 0x10A8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39F1A6E34E63DF9961E2DAB52E167EB6;// 0x1108(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1F6DF4BB4EF6DDC4F795D9AE2DC814DE;// 0x1138(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E04B4AD24F873F700019A9A62CA05472;// 0x1198(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66B5295E440249B61168DABB789B3FA4;// 0x11D8(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71EBE3204E6F07A57278C3AC775F62DC;// 0x1200(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1FBFEA7E449BD537816D4C8DF323E388;// 0x12E0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D6ED834C4044D2C4B47E1792CC8C32F9;// 0x13C0(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_575210714414E829716512970EEBF303;// 0x1420(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E084469E40974B10C4A0EDAE01B2AB8F;// 0x1500(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_58EE5C564337A041156460A9B639B219;// 0x1560(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3DA12AE641FABAA29F1BA79E3E7EE252;// 0x15C0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E62D115E43FDE7ED3BA55BAD0B1D64BB;// 0x16A0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5F8E17794BEE9AA1B27D97B149C715E8;// 0x1700(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B85EB2E45B5B77151C944AE4373B5CE;// 0x1740(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E426F3740EC572D2D9B1BBF151764B3;// 0x1768(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_36FDDE9C406E247752F92EAB4E79856D;// 0x1798(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_035967204CBD705645AF82B42DECC37C;// 0x17E8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F9DB0BE645725BC54E36DD95D06F8E4E;// 0x1810(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F7607EDB4D7422EFCA652898E7B2506A;// 0x1870(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F9310214494CCC127F458E880089F6DC;// 0x18D0(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7EB5C278435070D28631C4BB786A527E;// 0x1900(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_49259C8C41DB2D63F70AEE946A74F856;      // 0x19E0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A539CB0E4722E94A64D57E816F3E5CDC;      // 0x1A18(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F5355E9E48FE2549605602AF8221060A;      // 0x1A50(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7631929A44AF3ABA8465D8A825D42FC4;      // 0x1A88(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DA3033024C74DFB2D77D58AD00AC24B4;      // 0x1AC0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6FB6A0F54B3DF11BD098CDB7C7632528;      // 0x1AF8(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7F5B6D0C454D80CB7542C79534FA3EC7;      // 0x1B30(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_54D584A04D156F6B43D7E6980EABEC69;      // 0x1B68(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FC0051C64E6C1FEADEBCA9BBEF1D2403;      // 0x1BA0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A7BD245646153E8D96E477B5B0804F01;      // 0x1BD8(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5385B85F45362F4D0033228E470C6795;      // 0x1C10(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_0BC6FEC544D668A22159DBA43F58BC61;      // 0x1C48(0x0038)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_98B74A104428E584810237B09A72C0FF;// 0x1C80(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_77518CF142BB6391E94F80B14A422570;// 0x1CC0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_58D6E69D48E0C70FDE2566A3D72E3048;// 0x1CE8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1814984149AB01B7F76BF9AE71AB3BC2;// 0x1D10(0x0080)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E6ECAFC846ECBD977B1239912AD8D002;// 0x1D90(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7419FD0D45A453B15D702D9B81037FDE;// 0x1DD0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EF9D70494453741B191ECCBDC2B4911C;// 0x1DF8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1E778213411A313325E3D6A67377DFC8;// 0x1E20(0x0080)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C827B46D4F091EF30988E3B500B7B2CF;// 0x1EA0(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_53E64E524D7A204A692A199B80A49326;// 0x1EE0(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_02D0D9DB495061636AA3719C01D65EEE;// 0x1F60(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7F347DFD4CBA9424191249A000B832A6;// 0x1F88(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_62B155D9473205BB44E596AD74FCE88F;// 0x1FB0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_006DBB9F41A03FE8B84BF3BBCA75799D;// 0x2090(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F28DEB9B4FC8F3AEECB579A169E0FCB7;// 0x2170(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_625140C84CA35521B41D309C3DD0AF2D;// 0x21D0(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9EDC1FA442F21CE094A2BFAC4C6B406D;// 0x2200(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3B8469ED47344F15B994FD9BEECA64B9;// 0x2250(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_114AC64144AE08E9D7E145ADD9CEB118;// 0x2280(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AECB76954727F24F3513BF8DD5DFD28C;// 0x22E0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A71A531F4DF2B93550F425B987716495;// 0x2320(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_83D61AAA453FA19E4F01EBB9CBE9B663;// 0x2348(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4D11AAED4DEEBB1F8921EF90BED072EB;// 0x2370(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0D0E6FBB4591AEE8A3188295B8F9D06B;// 0x2450(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FAC88C4D463191B0BFEE60A61AB2FE20;// 0x24B0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0283924B455E9E2745CCCA9534D61CBE;// 0x24F0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E3E120754C79429F02EB49B40929732E;// 0x2518(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B3A126E4DC8BEDFC5661D915AEE1C09;// 0x2578(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6DAB1347440D304AFE94898987CBA1F9;// 0x25A0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7EE9F750439BDE1E01E5C688B93AA5F5;// 0x2600(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D9728971406A83D8E676ADB96D3311F8;// 0x2640(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34960ED840024D449F879CB67BE5BEDF;// 0x2668(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5843C8CA48637F84A182499B92E187D5;// 0x2698(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5A7ECEC64AC41917642212B924F95233;// 0x2718(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FDD8F78B4858A7E91A43B3A30F28FB40;// 0x2778(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A822F0EB40C3416F377EBF99EE0E727D;// 0x27B8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BFCFC6EE4B3A68ADAB79DBBF06B96F0F;// 0x27E0(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D2BEAD1C4A773C0715D8EFA661790F8F;// 0x2810(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D69E7EEA40B2E3EDF5EF3AA24179CB5B;// 0x2890(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D59F543F46107346A52A98BFC8658B12;// 0x28B8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9FBA8823466B1331A23BCD8B17355B0E;// 0x28E0(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_584B7CFB4DE9296AA4C893BBE0DBAE75;// 0x2940(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CCF0D5154F1686D7738E7580ED49DE7D;// 0x2968(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9894735643F86550E33F3E8B529CB559;// 0x2998(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E135E30D44B8F0FDFE6D74A5D583D895;// 0x29E8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC18F1E04C13FEA34E13EF8E2F5EAEFE;// 0x2A48(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5569E169478C7032EB0D78BECDA4F7EF;// 0x2A78(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE67D2B64A50261669055EBEE5BFD90B;// 0x2AA8(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B0D172B34F99B4F7BDD8DE9255B888DD;// 0x2AD8(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0CE0EF3D4253B8A0B76150995DBE5ED1;// 0x2B18(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8EE2C40A43801E808BA0F8AA517E08A9;// 0x2B40(0x00E0)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_CE25867547A87AF22D84159D145E19A9;// 0x2C20(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_40C6D9B34227679A2A1A3CB860CF363E;// 0x2C70(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D83165154E10975FC752AD87EBA68799;// 0x2CD0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D7AA44144F9AF0904FDD859B8EFB22A1;// 0x2D30(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F0D7D64471FBED002E978BE0DC539F5;// 0x2D90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D8DFB40E4161D6EC77DF45A6BB573C05;// 0x2DC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB24E0854A5219A62C1E7DB5B78AE02F;// 0x2DF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4344010E4E0D5A4F91C3D9B17A15C48D;// 0x2E20(0x0030)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_F960ECE8477E76F3538754A89E4E701D;// 0x2E50(0x0050)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_F687DCE942871B17643DA3AB66FF0544;// 0x2EA0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_352BFA644673844139DF9C828B21A0EE;// 0x2EF0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2781FC3A431F4944BEE28E9A877E8C6A;// 0x2F50(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_397D98FF49D71C7F43883A875A049067;// 0x2F80(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_82F7F17146B5EE95C649958A5A7768F7;// 0x2FB0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8129ECBD45CCC2607A2615850AA2F49B;// 0x3010(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9FCB3D6D4CF50C6BE4E0D2B5811076FE;// 0x3040(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2DCD53F440BD394CEBDAEBAD7A00C3CA;// 0x30A0(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BEDB1D4E420950EC3AE4E181410588E8;// 0x3100(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7DD265CB4C81A2F2AC33488DCCC2DD32;// 0x3128(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DA34180F43D27A225F0E4E84027786FE;// 0x31A8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43CA87414F2F8C6E01C79F839343FAD9;// 0x3208(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EC1F6974FD8099D3B7BD187519B03A3;// 0x3238(0x0030)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_E640EAE04F75EEC5F6D0FCB5D184AFB3;// 0x3268(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_231A3AEB4F0411AC812F41A946558D89;// 0x32B8(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1A1905BB4A488250E3E758929CAC0D98;// 0x3318(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39FB8CD84AC230C8E772B6A40A4F6418;// 0x3358(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6066031A4D4408F91FF056A9CEF4B804;// 0x3380(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_58BADC2348B95F9B34C4D8B8A59EC1E3;// 0x33A8(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_075C14E54E8831B218CD5385157DA7B4;// 0x33D0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2AACDFAE4CC815121445058814C3EB58;// 0x3420(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DABBFB144152CF13BFF7BDA20F4FCCC7;// 0x3480(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6DD265834F8C65521D2AE288D316E28D;// 0x34B0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DA186F34430B9C394CEED5BF5C4BD28C;// 0x34D8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E1C48A54B9FD35C6E6A428DE00D6676;// 0x3538(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD91F88648A33C1AF26DB6B1DDAC4B2E;// 0x3568(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED9AA3D744AC692E66C1818B2D18CB5D;// 0x3598(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6ED0E70A429D42D7B4FA44AD33E287AE;// 0x35C8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BB9E1DDF4BBAB9D15C1145B2F16DC928;// 0x3628(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7BAD9B3C47AF0247CE7EF79F3A68E35A;// 0x3658(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC1E66424F3A0ED26D66C78FBDCA028A;// 0x36B8(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5F20890C4FF6EB2C8561649350ED55DD;// 0x36E8(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_449CAD114D755CE09E3514A55BEDE738;// 0x3748(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F0293980425AF44AE1D9E2A7156E3F13;// 0x3770(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6508C6CC448696270B8CD8995F61979B;// 0x37D0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A5850AF44FAD21F0E0960FA2F21EB940;// 0x3830(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2F1D210D4B4028B81E8FF081C81C15F9;// 0x3890(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E49723F4FE177AC44544FB3853BC1FE;// 0x38B8(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B5D0235C475480945AFED28A5C5EA9AF;// 0x3918(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BB6102CB4668D012BA1213941FBBDBE1;// 0x3940(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_49F2A42A41D3B14AFECECE94D94E00F6;// 0x39A0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D0972CEC4B8377AFB16DAD97964018E1;// 0x3A00(0x0060)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_928706C847C07613FB606CAEE6265D6A;// 0x3A60(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_142D53694074649ACE62C89E6BE60BB4;// 0x3AB0(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3557DCDA4B3DF4D17C37A3A7D7F474C3;// 0x3B60(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6A915238441A182A6A675794D434C7E1;// 0x3B88(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_Root_12E8EC2F4D6CA5ED5BA853854982E57B;      // 0x3BE8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_295C25CF457542BEC41FA68530B90DE0;// 0x3C10(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5305F49640A043FEA26D52B542239183;// 0x3C40(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C6A2B75E4E399FDEFABDFAB8766F1DAA;// 0x3C80(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AA26FD29466205A5F5DF3497FDB27905;// 0x3CA8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7146EF344DD7F270EFDA36ABE0453F73;// 0x3D88(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_029850DB496F6CA840355DB96148DD14;// 0x3DB8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_06ACAB7F4A1C68A1D7D69E857BEDC77A;// 0x3DE8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC3F5E20471E4175267F749A4D7CB982;// 0x3E18(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B8DF8CEC42421E426C2787928A2612A4;// 0x3E48(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ECA9FD8945995210C9878196697C489A;// 0x3EA8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_119494E04BDFB1D84B4860BD21480D9F;// 0x3F88(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FA2EB2F34B1AFCCB351BC2A35E0B6752;// 0x4068(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C337E1DC4F9B19EAEA04CEAF8C1434F0;// 0x40C8(0x00E0)
	bool                                               bIsMoving;                                                // 0x41A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x41A9(0x0003) MISSED OFFSET
	struct FRotator                                    RootRotationOffset;                                       // 0x41AC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch;                                                 // 0x41B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYaw;                                                   // 0x41BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x41C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAimOffset;                                            // 0x41CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x41CD(0x0003) MISSED OFFSET
	float                                              MovementAnimRate;                                         // 0x41D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsFalling;                                               // 0x41D4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x41D5(0x0003) MISSED OFFSET
	float                                              MaxMovementAnimRate;                                      // 0x41D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseFalling;                                              // 0x41DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x41DD(0x0003) MISSED OFFSET
	float                                              MovingAnimSpeedTreshold;                                  // 0x41E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinMovementAnimRate;                                      // 0x41E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsTurning;                                               // 0x41E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTurning;                                              // 0x41E9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTurningRight;                                            // 0x41EA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x41EB(0x0001) MISSED OFFSET
	float                                              TurningEnabledBlendTime;                                  // 0x41EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningDisabledBlendTime;                                 // 0x41F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningDirectionBlendTime_TallMode;                       // 0x41F4(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinTurnRateForTurnAnimation;                              // 0x41FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseSwimming;                                             // 0x4200(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSwimming;                                              // 0x4201(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x4202(0x0002) MISSED OFFSET
	float                                              SwimmingMovingAnimSpeedThreshold;                         // 0x4204(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingAnimPlayRate;                                      // 0x4208(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingBlendInTime;                                       // 0x420C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingBlendOutTime;                                      // 0x4210(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   MovingBlendTimes;                                         // 0x4214(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRunning;                                               // 0x421C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRunning;                                              // 0x421D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseSleepingAnim;                                         // 0x421E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSleeping;                                              // 0x421F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SleepingAnimTranslationOffset;                            // 0x4220(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRatePower;                                    // 0x422C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTurnInPlaceAnimation;                                 // 0x4230(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSkipAnimGraph;                                           // 0x4231(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x4232(0x0002) MISSED OFFSET
	float                                              AlignGroundAlpha;                                         // 0x4234(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAlignGround;                                          // 0x4238(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x4239(0x0003) MISSED OFFSET
	float                                              IKAlpha;                                                  // 0x423C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningBlendInTime;                                       // 0x4240(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningBlendOutTime;                                      // 0x4244(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RunningMovementAnimRate;                                  // 0x4248(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRunningMovementAnimRate;                              // 0x424C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisableIK;                                               // 0x424D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2];                                       // 0x424E(0x0002) MISSED OFFSET
	float                                              AimOffsetPitchScale;                                      // 0x4250(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetYawScale;                                        // 0x4254(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSleepingEnableIK;                                        // 0x4258(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTallMode;                                                // 0x4259(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasWebsAttached;                                         // 0x425A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSpiderStuckToWall;                                       // 0x425B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   MoveAnimBlends;                                           // 0x425C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSpiderJesus;                                           // 0x4264(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x4265(0x0003) MISSED OFFSET
	float                                              StopSwimmingAfterUnsubmergedTime;                         // 0x4268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSwimmingVertically;                                      // 0x426C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBothWebs;                                                // 0x426D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EGrappleState>                         CurrGrappleState;                                         // 0x426E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCharEnsnared;                                            // 0x426F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	float                                              currTurnRate;                                             // 0x4270(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	float                                              MinTurnRateForTurnAnimation_StuckToWall;                  // 0x4274(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallingVelocityBlend;                                     // 0x4278(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSkidding;                                              // 0x427C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x427D(0x0003) MISSED OFFSET
	float                                              StartSkiddingAboveWalkAnimRate;                           // 0x4280(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SkidPlayRate;                                             // 0x4284(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SkidPlayRateRanges;                                       // 0x4288(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SlingshotStretchRatio;                                    // 0x4290(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bForceSkid;                                               // 0x4294(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x4295(0x0003) MISSED OFFSET
	float                                              TurnInPlaceBlendRatio;                                    // 0x4298(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningBlendTime;                                         // 0x429C(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningBlendTime_TallMode;                                // 0x42A4(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurnInPlaceBlendTimes;                                    // 0x42AC(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningDirectionBlendTime_TurnInPlace_TallMode;           // 0x42B4(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurnInPlaceBlendTimes_TallMode;                           // 0x42BC(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasRider;                                                // 0x42C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSpiderWantsToStickToWall;                                // 0x42C5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x42C6(0x0002) MISSED OFFSET
	struct FVector2D                                   WantsToStickToWallBlendTimes;                             // 0x42C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasGrappledChar;                                         // 0x42D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x42D1(0x0003) MISSED OFFSET
	float                                              ReelingAnimPlayRate;                                      // 0x42D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovingAnimSpeedTreshold_TallMode;                         // 0x42D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   WebSwingingBlendTimes;                                    // 0x42DC(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WebSwinging_Vertical_CurrAlpha;                           // 0x42E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	float                                              WebSwinging_Vertical_DotThreshold;                        // 0x42E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WebSwinging_Vertical_RequiredSpeed;                       // 0x42EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WebSwinging_Vertical_BlendInterpSpeed;                    // 0x42F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WebSwinging_Vertical_AnimBlend;                           // 0x42F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CurrentTurningBlendAlpha;                                 // 0x42F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningBlendAlphaInterpSpeed_Up;                          // 0x42FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningBlendAlphaInterpSpeed_Down;                        // 0x4300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAnimTurnRate;                                          // 0x4304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAnimTurnRate_Running;                                  // 0x4308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningBlendAlphaInterpSpeed_Running_Up;                  // 0x430C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningBlendAlphaInterpSpeed_Running_Down;                // 0x4310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningBlendTime_Running;                                 // 0x4314(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsAirBraking;                                            // 0x431C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsWebSwingingIdle;                                       // 0x431D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData15[0x2];                                       // 0x431E(0x0002) MISSED OFFSET
	float                                              WebSwingingIdleVelocity;                                  // 0x4320(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AgainstSurfaceSkiddingBaseVelocity;                       // 0x4324(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChargeJumpRatio;                                          // 0x4328(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BaseTurnRate_StuckToWall;                                 // 0x432C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BaseTurnRate;                                             // 0x4330(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSpiderHangry;                                            // 0x4334(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSpiderAtWebTetherEnd;                                  // 0x4335(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSpiderWantsToSwing;                                      // 0x4336(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_DinoClimberState>                    CurrentClimberState;                                      // 0x4337(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   MovingBlendTimes_Climbing;                                // 0x4338(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   TurningBlendTime_Climbing;                                // 0x4340(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwingingBlendMaxMeshYawDelta;                             // 0x4348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAnimBlendDirectionalFallingVelocityPercentage;         // 0x434C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsDirectionalFalling;                                    // 0x4350(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x4351(0x0003) MISSED OFFSET
	float                                              DirectionalFallingRequiredVelocity;                       // 0x4354(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   DirectionalFallingBlendTimes;                             // 0x4358(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              currMeshSwingingYawDelta;                                 // 0x4360(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSpiderImpendingLand;                                     // 0x4364(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsDiving;                                                // 0x4365(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData17[0x2];                                       // 0x4366(0x0002) MISSED OFFSET
	float                                              MaxMovementAnimRate_Skidding;                             // 0x4368(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x436C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x436D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x2];                                       // 0x436E(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X;                                 // 0x4370(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y;                                 // 0x4374(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x4378(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x4379(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x2];                                       // 0x437A(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X2;                                // 0x437C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y2;                                // 0x4380(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x4384(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x3];                                       // 0x4385(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X3;                                // 0x4388(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y3;                                // 0x438C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Lerp_ReturnValue;                                // 0x4390(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X4;                                // 0x4394(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y4;                                // 0x4398(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X5;                                // 0x439C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y5;                                // 0x43A0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X6;                                // 0x43A4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y6;                                // 0x43A8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector2D                                   K2Node_Select_ReturnValue;                                // 0x43AC(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_Select_CmpSuccess;                                 // 0x43B4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x3];                                       // 0x43B5(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X7;                                // 0x43B8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y7;                                // 0x43BC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Abs_ReturnValue;                                 // 0x43C0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x43C4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x43C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x3];                                       // 0x43C9(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X8;                                // 0x43CC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y8;                                // 0x43D0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X9;                                // 0x43D4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y9;                                // 0x43D8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x43DC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x43DD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x2];                                       // 0x43DE(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector2D_X10;                               // 0x43E0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y10;                               // 0x43E4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_X11;                               // 0x43E8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector2D_Y11;                               // 0x43EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x43F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
