#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_net_RIG_AnimBlueprint_Gen_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass net_RIG_AnimBlueprint_Gen.net_RIG_AnimBlueprint_Gen_C
// 0x0E94 (0x11D4 - 0x0340)
class Unet_RIG_AnimBlueprint_Gen_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_1C06B8914B87829E812FD4AAE9F25A96;      // 0x0340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8BA2FCF47ED5BE8EBE0088EF4379B00;// 0x0368(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5333EEC4350F8FB4BA30DA1EA91EA9E;// 0x0380(0x0018)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_F9E6DC3E4C1D31B3F8C381BABBA09320;  // 0x0398(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_BB0C419C4750316EB9DAFDA930D476F9;  // 0x03F0(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_5942180647EAA48BC2C322B4218734EC;  // 0x0448(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6BEFC2FD4A29E355796968A95C8AE426;  // 0x04A0(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D8E9E41140287A8B00399E9F01A47941;  // 0x04F8(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_CC8D41664B84E1934D75ADA6471AEE4A;  // 0x0550(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_23825956401E936EE08E53B25288DE66;  // 0x05A8(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_479D3C344223A942AD3E4DB6E744ABAC;  // 0x0600(0x0058)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0658(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_ED63C2E646BCBC70404297A1BC1B5383;// 0x0660(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E41660E94C12E048ACBB6FA0D3E28B0D;// 0x0710(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2DED5E2449DE443649F0A7AC85E36F03;// 0x07C0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9609033E4D9F409FFBCF5BBC33A7A1A4;// 0x0870(0x00B0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_8313785E40CD84C0C2D2A68A7A229ADC;  // 0x0920(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6899CAE447784257B3791FAA399E79AA;  // 0x0978(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_0065610D490D5CC034189682018BFFF3;  // 0x09D0(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E9122E8E45FF7DE0766991AB550B1447;  // 0x0A28(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_555BC3FE44FFB73C214DB5B6F6D8A8BE;  // 0x0A80(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_0EC2E98B4116BCD98569B68C545D1721;  // 0x0AD8(0x0058)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A609A60B4F419B73B2B0A395A67C81B4;// 0x0B30(0x00B0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_CD66736641AFBDE223BF4D99BB94DF34;  // 0x0BE0(0x0058)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_C2CCC2A74C4CCDCA30E4EBB53FF78427;  // 0x0C38(0x0058)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_15F542ED45BEABFEA7A376988EB4A7DC;// 0x0C90(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3D932D0041BEE8D05B3B65A5AD313647;// 0x0D40(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_89719F574FE25E11D6094F872BC6DFCA;// 0x0DF0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_96E30AF5409D5D364D74B48161EB8FD6;// 0x0EA0(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_22B7731F445F39A1CFAE238EC5E5E38E;// 0x0F50(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FBB7F873433B796A30BD42BC1FC1F5D4;// 0x0F78(0x0030)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DBBC15B942293D78C25E9F8C6F6F7B5F;// 0x0FA8(0x0028)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C8FDE7CF448BEC51729847BC7D1F9A53;// 0x0FD0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C18373144BE83EB17C75BB46B1366C6;// 0x0FF8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6C436D7244792A78BC2240B6FB3B1B51;// 0x1028(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_60CBD99D4605078916A8F2A22EE0BC93;// 0x1050(0x0060)
	bool                                               bHasFinishedAnimation;                                    // 0x10B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasImpacted;                                             // 0x10B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasSetupBones;                                           // 0x10B2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x10B3(0x0005) MISSED OFFSET
	TArray<struct FRotator>                            BoneRotations;                                            // 0x10B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                             BoneLocations;                                            // 0x10C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x10D8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x10D9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x10DA(0x0002) MISSED OFFSET
	struct FRotator                                    CallFunc_Array_Get_Item;                                  // 0x10DC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item2;                                 // 0x10E8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item3;                                 // 0x10F4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item4;                                 // 0x1100(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item5;                                 // 0x110C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item6;                                 // 0x1118(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item7;                                 // 0x1124(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item8;                                 // 0x1130(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Array_Get_Item9;                                 // 0x113C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x1148(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x1149(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_Array_Get_Item10;                                // 0x114C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item11;                                // 0x1158(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item12;                                // 0x1164(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item13;                                // 0x1170(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item14;                                // 0x117C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item15;                                // 0x1188(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item16;                                // 0x1194(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item17;                                // 0x11A0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Array_Get_Item18;                                // 0x11AC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x11B8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x11BC(0x0004) MISSED OFFSET
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x11C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalProjectileNetGun*                     K2Node_DynamicCast_AsPrimalProjectileNetGun;              // 0x11C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x11D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x11D1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x11D2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x11D3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass net_RIG_AnimBlueprint_Gen.net_RIG_AnimBlueprint_Gen_C");
		return ptr;
	}


	void SetBoneVariables(class APrimalProjectileNetGun* Projectile);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_TransitionResult_3228();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_TransitionResult_3227();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_942();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_943();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_944();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_945();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_946();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_947();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_948();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_949();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_net_RIG_AnimBlueprint_Gen_AnimGraphNode_ModifyBone_950();
	void AnimNotify_OnFinishAnimation();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void ExecuteUbergraph_net_RIG_AnimBlueprint_Gen(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
