#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_Exosuit_AnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Exosuit_AnimBP.Exosuit_AnimBP_C
// 0x1C59 (0x1F99 - 0x0340)
class UExosuit_AnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_64D8C5CD4E87BDDC0E052BA45225C407;// 0x0340(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5186DFA34469036E9DE74BA88F4D91DF;// 0x0380(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_609D16EA4EA13410C322678CF54B4384;// 0x03A8(0x0070)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0418(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_132462B947CAB62F7ED4A1A9D76DC15C;// 0x0420(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4EF48096418E0251D20155AD1D6D69D5;// 0x04D0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C36397D744A8F934CEA79AA5FF3768DB;// 0x04F8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_806BCC2B42944259B1FF0DB829EF79C3;// 0x0520(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F14EAC5A4C58DC17F6B567889B048BFE;// 0x0580(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_072CBC57418546CBD7EC40BE4C5C988B;// 0x05A8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8331792546E634ECCA094B9879F5F98A;// 0x05D0(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_331FBA79415D7F8C88F51BA916AC59D7;// 0x0610(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57B3A5A74BDB1DF49427A7818E0CC0F3;// 0x0650(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A6D1DFAF4FF4EF7BDB9C9BBB8D74FF25;// 0x0678(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E13177824FF624ED1C1E70B2CA25140B;// 0x06B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B123D648432509CAF4C2A18DEA32730E2;// 0x06E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D62AD9643D99EBDC4EEE6B3D97575492;// 0x06F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8C56BA24498151728C782B0A1D538262;// 0x0710(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CD4F5CE422C7E40F0F482A8D21655602;// 0x0728(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8C344BB4F6395A4EAC8A7B6617A21B82;// 0x0740(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_908CE01D4365E5D1DAFD6EB40387E53A2;// 0x0758(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B123D648432509CAF4C2A18DEA32730E;// 0x0770(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D62AD9643D99EBDC4EEE6B3D9757549;// 0x0788(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8C56BA24498151728C782B0A1D53826;// 0x07A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CD4F5CE422C7E40F0F482A8D2165560;// 0x07B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8C344BB4F6395A4EAC8A7B6617A21B8;// 0x07D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_908CE01D4365E5D1DAFD6EB40387E53A;// 0x07E8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A063AF2743164C526D31A78291050C292;// 0x0800(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB202C4348B4E92B5868EB94627C860E;// 0x0830(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_402CDDFA46B721FB63D675830E1FEA4F;// 0x0860(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_333F6D33433E273AB0A0248C67C954DC2;// 0x08C0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5A273A44B6880B4650BBD8D9F3EB972;// 0x08E8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ABCCE61A406A8D6480FF6C9C306EB4162;// 0x0948(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C90AA2284403588401683FAF17EDD492;// 0x0978(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_335FC66A4FA2A9C321BC5192DFDA09A62;// 0x09A8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_33014A9E476CB441D9504990E763B8FA2;// 0x09D0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3C3312F49F8626E261CD9974D5F00B52;// 0x0A30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_079E0A994A76D654988D84BD93B0D47A2;// 0x0A60(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_329B5A3A4D28984A3F5CA786B10678DA2;// 0x0A90(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A063AF2743164C526D31A78291050C29;// 0x0AB8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_333F6D33433E273AB0A0248C67C954DC;// 0x0AE8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ABCCE61A406A8D6480FF6C9C306EB416;// 0x0B10(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_335FC66A4FA2A9C321BC5192DFDA09A6;// 0x0B40(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_33014A9E476CB441D9504990E763B8FA;// 0x0B68(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3C3312F49F8626E261CD9974D5F00B5;// 0x0BC8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_079E0A994A76D654988D84BD93B0D47A;// 0x0BF8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_329B5A3A4D28984A3F5CA786B10678DA;// 0x0C28(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8782FD90442E27C55EFA6A802D4063FC;// 0x0C50(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D8D491B14B77B40C3DB492916CE9104F;// 0x0CB0(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2ABBAB624A02A36F143D6C92466814F0;// 0x0CF0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_40F633D643DA922093E4E794C51971DC;// 0x0D30(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FF9FBE444B03B939A56EA8BF29D8A7D9;// 0x0D58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3C97690C42ED000DF9B5E1994EECC521;// 0x0D80(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_98B55C4F43EBC33363F06090D39C4013;// 0x0DA8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_238A1857455A4A6489587E84D949C023;// 0x0DD0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4F6E54BA45069A8374F5B19697A57EE2;// 0x0DF8(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4E4551F1427785CF382EBC9BD52B6B31;// 0x0E58(0x00E0)
	struct FAnimNode_MultiFabrik_Dinos                 AnimGraphNode_MultiFabrik_Dinos_D330E9F2405F95138F56928C3D3A9379;// 0x0F38(0x0058)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_760228D843CFFA9AACDFE2A75EFBE429;// 0x0F90(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F367F0A3449A869C8886429EA247D53E;// 0x0FB8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_972C6AD147EBD830F9F660BDAD847B92;// 0x0FE0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39501EAD4E9655294DB91B822402C08B;// 0x1040(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B2A865CF436371BBFC10C3904BB78706;// 0x1070(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_10861C3D44F605C6C07D19A4C946E74B;// 0x10A0(0x0050)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E7899E1B49E2205A3F4C92824A02892D;// 0x10F0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F808A3114898FE59A0BFC7AE47425733;// 0x1140(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F5E4CAD49578E451C453BB370AFA942;// 0x1170(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3C79F52144BEB7A4B61FB3B8681E8E78;// 0x11A0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BE1BD88045CA9DB6B11A319E0689064E;// 0x11E0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_75F94EB84B3F49375749E6AD31B347C0;// 0x1208(0x00F8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5A844B9B4E44D68672EE21A945275473;// 0x1300(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AF01C404C4F9362348A0F8DF2B2EF5C;// 0x1360(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_19D06A324726C87339B9BEAA807B8E65;// 0x1390(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FB3BD765468EA521520175871EFB6947;// 0x13B8(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3184100D4DBB320996F9A9A1A7FFB385;// 0x1408(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FD7330D9416B933AFB1C1BA3D4646839;// 0x1438(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1FB106924673E0310E166C882087C945;// 0x1518(0x0080)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B212BA254DCC0562C0255393E8720C17;// 0x1598(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_516A18484BFDD9E2672A06BEFD901E8F;// 0x1618(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_356C283E4B48D5A2223C52B2A40D8049;// 0x1630(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01608B194BF3119C03311AA76C068101;// 0x1648(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_456A58F040174992AB1624A9840E0A00;// 0x1660(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB5C424646AF7F890AFD1DBB58EA3904;// 0x1678(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8EE1BF2041CC62857147AD814CB6272A;// 0x1690(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B924AA5F46013862A1FEF690DEA000CE;// 0x16C0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88836AAA4D0D7EE7658728A7C623B900;// 0x16E8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E3F39136479DCCF4C986638CD93D036E;// 0x1718(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC904A8845FD8B09C08C4DA91310D8C8;// 0x1740(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_81BB17EE41C704AE254A8D900EA2B346;// 0x1770(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C661BF504B91C948D286CEA3E4E36AE5;// 0x1798(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B8AF29D949B9C5F09CDC93B6181821ED;// 0x17C8(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_80C41B15410CDEAE5B9EF7BBCAA16E54;// 0x17F0(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_081EC5C54D8A506943E561A4F017798D;// 0x1850(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_31032EFC4E5E9C70D045B4B01C77744C;// 0x18D0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A0E501F048093B64A0ABC5B8AEB3D687;// 0x19B0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67890E5F4056058B165F45B2B15B0825;// 0x1A10(0x0030)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_60A9682643374028FD7F61BA14546080;// 0x1A40(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_BAA137114633D54443CF168441C99B42;      // 0x1A80(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3C1A3080480729C61832BAA8F7AD8B4F;      // 0x1AB8(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_52292860449FD422F938119C8299A382;      // 0x1AF0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_Root_79DBB2B14720F09DD6A93B87AF1B98FD;      // 0x1B28(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F69D97374C5A43435F82898AA27FB90E;// 0x1B50(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DF4F97FA454133E39A85C7AE1D546F68;// 0x1C30(0x0060)
	bool                                               IsMoving;                                                 // 0x1C90(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsRunning;                                                // 0x1C91(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFalling;                                                // 0x1C92(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurning;                                                // 0x1C93(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurningRight;                                           // 0x1C94(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTurningFast;                                            // 0x1C95(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x1C96(0x0002) MISSED OFFSET
	float                                              CurrentTurningRate;                                       // 0x1C98(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsAiming;                                                 // 0x1C9C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1C9D(0x0003) MISSED OFFSET
	float                                              AimPitch;                                                 // 0x1CA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYaw;                                                   // 0x1CA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch_Smoothed;                                        // 0x1CA8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x1CAC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    RootRotationOffset;                                       // 0x1CB8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MoveForward;                                              // 0x1CC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MoveRight;                                                // 0x1CC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         CurrentMovementMode;                                      // 0x1CCC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x1CCD(0x0003) MISSED OFFSET
	float                                              MinTurnRateForAnimation;                                  // 0x1CD0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinTurnRateForFastTurns;                                  // 0x1CD4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnInPlace15AnimPlayRate;                                // 0x1CD8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnInPlace90AnimPlayRate;                                // 0x1CDC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GroundMoveAnimPlayRate;                                   // 0x1CE0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GoundRunAnimPlayRate;                                     // 0x1CE4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    AimOffsetRotation;                                        // 0x1CE8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsPreparingJump;                                         // 0x1CF4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x1CF5(0x0003) MISSED OFFSET
	float                                              JumpAnticAlpha;                                           // 0x1CF8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              JumpAnticInterpSpeed;                                     // 0x1CFC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CarryAlpha;                                               // 0x1D00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CarryAlphaInterpSpeed;                                    // 0x1D04(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsCarrying;                                              // 0x1D08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsAscending;                                             // 0x1D09(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x1D0A(0x0002) MISSED OFFSET
	float                                              CarryWidth;                                               // 0x1D0C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CarryWidthInterpSpeed;                                    // 0x1D10(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsStowed;                                                // 0x1D14(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x1D15(0x0003) MISSED OFFSET
	float                                              CockpitOpenAlpha;                                         // 0x1D18(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRatePower;                                    // 0x1D1C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinMovementAnimRate;                                      // 0x1D20(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxMovementAnimRate;                                      // 0x1D24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRate;                                         // 0x1D28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasTicked;                                               // 0x1D2C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x1D2D(0x0003) MISSED OFFSET
	float                                              StorageAlpha;                                             // 0x1D30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsStoring;                                               // 0x1D34(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x1D35(0x0003) MISSED OFFSET
	float                                              StorageInterpSpeed;                                       // 0x1D38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RamAlpha;                                                 // 0x1D3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RamInterpSpeed;                                           // 0x1D40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRamming;                                               // 0x1D44(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x1D45(0x0003) MISSED OFFSET
	int                                                TicksSinceStart;                                          // 0x1D48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PlowPoseSelector;                                         // 0x1D4C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           StowedIdleSequence;                                       // 0x1D50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetMinPitch;                                        // 0x1D58(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WasTurningFast;                                           // 0x1D5C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x1D5D(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;       // 0x1D60(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue;              // 0x1D64(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_FloatFloat_ReturnValue;               // 0x1D65(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x2];                                       // 0x1D66(0x0002) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;      // 0x1D68(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue2;             // 0x1D6C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_FloatFloat_ReturnValue2;              // 0x1D6D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x1D6E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x1D6F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_FloatFloat_ReturnValue3;              // 0x1D70(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x1D71(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x1D72(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x1D73(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x1D74(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x1D75(0x0003) MISSED OFFSET
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue;          // 0x1D78(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x1D7C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x1D7D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x1D7E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x1D7F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue2;         // 0x1D80(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x1D84(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x1D85(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x1D86(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x1D87(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x1D88(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x1D89(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x1D8A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x1D8B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue3;         // 0x1D8C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue4;                 // 0x1D90(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue10;                        // 0x1D91(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue11;                        // 0x1D92(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x1];                                       // 0x1D93(0x0001) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x1D94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x1D98(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x1D99(0x0003) MISSED OFFSET
	float                                              CallFunc_GetCurrentStateElapsedTime_ReturnValue4;         // 0x1D9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue5;                 // 0x1DA0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue12;                        // 0x1DA1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x2];                                       // 0x1DA2(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x1DA4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x1DA8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalDinoCharacter*                        K2Node_DynamicCast_AsPrimalDinoCharacter;                 // 0x1DB0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x1DB8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x1DB9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x2];                                       // 0x1DBA(0x0002) MISSED OFFSET
	struct FVector                                     CallFunc_GetVelocity_ReturnValue;                         // 0x1DBC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue;                 // 0x1DC8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Conv_VectorToRotator_ReturnValue;                // 0x1DD4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_NegateRotator_ReturnValue;                       // 0x1DE0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetDefaultMovementSpeed_ReturnValue;             // 0x1DEC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_ComposeRotators_ReturnValue;                     // 0x1DF0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetForwardVector_ReturnValue;                    // 0x1DFC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x1E08(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x1E0C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x1E10(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x1E14(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x1E18(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue;                      // 0x1E1C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue2;                     // 0x1E20(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue;                            // 0x1E24(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue2;                           // 0x1E28(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue;                              // 0x1E2C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue2;                             // 0x1E30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue2;                // 0x1E34(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetDinoVelocity_ReturnValue;                     // 0x1E40(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x4];                                       // 0x1E4C(0x0004) MISSED OFFSET
	class AExosuit_Character_BP_C*                     K2Node_DynamicCast_AsExosuit_Character_BP_C;              // 0x1E50(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x1E58(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x1E59(0x0003) MISSED OFFSET
	struct FVector2D                                   CallFunc_Conv_VectorToVector2D_ReturnValue;               // 0x1E5C(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSize2D_ReturnValue;                             // 0x1E64(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x1E68(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue6;                 // 0x1E6C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsPlayingAnimationMontagesOnSlotName_ReturnValue;// 0x1E6D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x1E6E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue;                   // 0x1E6F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BP_GetMaxSpeedModifier_ReturnValue;              // 0x1E70(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue3;                // 0x1E74(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue2;                  // 0x1E78(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue3;             // 0x1E79(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x1E7A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue3;                  // 0x1E7B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x1E7C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue13;                        // 0x1E7D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_IntInt_ReturnValue4;                  // 0x1E7E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x1];                                       // 0x1E7F(0x0001) MISSED OFFSET
	struct FVector                                     CallFunc_LessLess_VectorRotator_ReturnValue;              // 0x1E80(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSizeSquared_ReturnValue;                        // 0x1E8C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X2;                                  // 0x1E90(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x1E94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x1E98(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue7;                 // 0x1E9C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue8;                 // 0x1E9D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x2];                                       // 0x1E9E(0x0002) MISSED OFFSET
	struct FVector2D                                   CallFunc_MakeVector2D_ReturnValue;                        // 0x1EA0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSizeSquared2D_ReturnValue;                      // 0x1EA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue2;                            // 0x1EAC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x1EAD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x2];                                       // 0x1EAE(0x0002) MISSED OFFSET
	struct FRotator                                    CallFunc_GetLastMovementDesiredRotation_ReturnValue;      // 0x1EB0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue2;                        // 0x1EBC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_NormalizedDeltaRotator_ReturnValue;              // 0x1EC0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue9;                 // 0x1ECC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x3];                                       // 0x1ECD(0x0003) MISSED OFFSET
	struct FRotator                                    CallFunc_GetAimOffsets_RootRotOffset;                     // 0x1ED0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAimOffsets_TheRootYawSpeed;                   // 0x1EDC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetAimOffsets_RootLocOffset;                     // 0x1EE0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetAimOffsets_ReturnValue;                       // 0x1EEC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Pitch;                                  // 0x1EF8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw;                                    // 0x1EFC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll;                                   // 0x1F00(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x1F04(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x1F05(0x0003) MISSED OFFSET
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x1F08(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue3;                  // 0x1F0C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue4;                // 0x1F10(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue5;                // 0x1F14(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue3;                     // 0x1F18(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue4;                     // 0x1F1C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue3;                             // 0x1F20(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue4;                             // 0x1F24(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Abs_ReturnValue;                                 // 0x1F28(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue10;                // 0x1F2C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData24[0x3];                                       // 0x1F2D(0x0003) MISSED OFFSET
	float                                              CallFunc_Abs_ReturnValue2;                                // 0x1F30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue14;                        // 0x1F34(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue11;                // 0x1F35(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue12;                // 0x1F36(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x1];                                       // 0x1F37(0x0001) MISSED OFFSET
	float                                              CallFunc_GetWorldDeltaSeconds_ReturnValue;                // 0x1F38(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_ReturnValue;                           // 0x1F3C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_RInterpTo_ReturnValue;                           // 0x1F40(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue3;                        // 0x1F4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x1F50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData26[0x3];                                       // 0x1F51(0x0003) MISSED OFFSET
	float                                              CallFunc_FInterpTo_Constant_ReturnValue;                  // 0x1F54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue15;                        // 0x1F58(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData27[0x3];                                       // 0x1F59(0x0003) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue4;                        // 0x1F5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_Constant_ReturnValue2;                 // 0x1F60(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_Constant_ReturnValue3;                 // 0x1F64(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue5;                        // 0x1F68(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue5;                             // 0x1F6C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;         // 0x1F70(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue6;                // 0x1F74(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue6;                             // 0x1F78(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue7;                // 0x1F7C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue6;                        // 0x1F80(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_Constant_ReturnValue4;                 // 0x1F84(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue7;                        // 0x1F88(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FInterpTo_Constant_ReturnValue5;                 // 0x1F8C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x1F90(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x1F91(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData28[0x2];                                       // 0x1F92(0x0002) MISSED OFFSET
	int                                                CallFunc_Add_IntInt_ReturnValue;                          // 0x1F94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_IntInt_ReturnValue;                      // 0x1F98(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Exosuit_AnimBP.Exosuit_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_BlendListByEnum_36();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_ModifyBone_918();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_BlendListByBool_4327();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_TransitionResult_3130();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_TransitionResult_3129();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_TransitionResult_3128();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Exosuit_AnimBP_AnimGraphNode_TransitionResult_3127();
