#pragma once

// ARKSurvivalEvolved (332.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_TEKHoverSail_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass TEKHoverSail_AnimBlueprint.TEKHoverSail_AnimBlueprint_C
// 0x1755 (0x1A95 - 0x0340)
class UTEKHoverSail_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_D7BDDF31404F11704BAE00BE17AEAAB6;      // 0x0340(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_41C692454757AD1057F4ED9ADFF525F6;      // 0x0368(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_48B1D63B4ACA9BA21D4736B0EF3194E3;      // 0x03A0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_20CAE615498968894ABEFEA3EA0A541B;      // 0x03D8(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B6A9E8B43AFDC3B418EC38EB5A606E1;// 0x0410(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_916A580847DE72BBADDC8AA3A3129C0C;// 0x0428(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F5B6F1C4D56EE1905B3A080C21B8BCD;// 0x0440(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C2;// 0x0458(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9687DDB849FF104DD027649F4CB82940;// 0x0470(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AA32A1C48860825324F0AAE92852B88;// 0x0488(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44136F40412C5DB994FBDCA6EA4F900C;// 0x04A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D50218E4A8D6044E25FF193EE9FC2CD2;// 0x04B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AD8B1ED481FC54F4283A0BA91156E16;// 0x04D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F862;// 0x04E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4A4C914ABF849AC4A3A1BA4DF1F823;// 0x0500(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D01D8609465AE86A5EDD9A8A3BA9529B;// 0x0518(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF0AA5C4467B4E4B2D038F94304BC75F;// 0x0530(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B3854B54583AC77BD1F629953425AE2;// 0x0548(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69C772BD4569598ADC503DA9A4A30FA7;// 0x0560(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A78873ED47EEE58D8296CCB09FB04D8B;// 0x0578(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CE651DB401B0C13914D60806AD249BF;// 0x0590(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DE4549747BF853C5FBBCEABE2C06F6D;// 0x05A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64F40AE64B4724A6366624B2D691FFE5;// 0x05C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E512D8C4523BA56983741AA4171A799;// 0x05D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF4BD1B6468C60E559ED13B97B0B52CC;// 0x05F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0246241B4ABD7897716963800C58D9B7;// 0x0608(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D854CA74001E852966FCC9702B47298;// 0x0620(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_884723BF428A77E1D7155BBFE4410292;// 0x0638(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC4BA033489F2710D2B5A4BB5E630805;// 0x0650(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEC612B148D3A56882D7298F617CC5BE;// 0x0668(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D92074494DC686441F87AD81A6FD2221;// 0x0680(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2FC50ECD49210F3F49742DAB5E98FEFB;// 0x0698(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B219E23C420DCF1E8A1E7387E631E9DE;// 0x06B0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C5F7CDF485A1E4051CE78926BF23C29;// 0x06C8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B265F55E4E7128118CC07FA478B25149;// 0x06E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A83E200E41D0FC5955BCF08C2B7E6396;// 0x06F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84EFADDA48F5C9C10AE8A2997508BF16;// 0x0710(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CFD5BF64F71023C5DE75EB47FDDF6D3;// 0x0728(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_00B18487452DDA11961B5CB035511D9D;// 0x0740(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8123727E441916C4EB178CA87248E196;// 0x0758(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D50218E4A8D6044E25FF193EE9FC2CD;// 0x0770(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38414DAE4B4B0ACC7616E994D0BF677A;// 0x0788(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_196BDA8A4A92A7AADE89F6A80562D120;// 0x07A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F86;// 0x07B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21EFE5EF4EEAA63F537FF78323D979B2;// 0x07D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27C5BB3D4498CCEF9927228FF7CB3581;// 0x07E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C;// 0x0800(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F21EBE91419FE71B2F5EF6B6F5E3F392;// 0x0818(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D9A4B454D65E694EBCD8EA20130C9B4;// 0x0830(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C9BCA66447C61EBE5967792F3C3CEE4;// 0x0848(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F7352EF6412E5F7E7564BCABF36CE440;// 0x0860(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_00CBD4BC4C25CE82910B0CB1127E5CD4;// 0x0878(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E978182E4B053359AAE41580DD8AC76C;// 0x0890(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23827BA44EB7A5F59040A3B1B2F2325A;// 0x08A8(0x0018)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_083476524D37426D8714BA8D33282B42;// 0x08C0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AFDD14A84022F46E7CF774BA4AAA4A8C;// 0x08E8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6347056D4EEDFE247986F3A9A5DB7711;// 0x0918(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B7F79314604F36648644DAF83B4E9AA;// 0x0940(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F5;// 0x0970(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_507D2CD9408D408B20DFF98D2EDD5250;// 0x0998(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F4;// 0x09C8(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_217055EF42AD1C8502897F970ED759F82;// 0x09F0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB922;// 0x0AD0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6744F1764DE401F068738FADF1E3ACD52;// 0x0AF8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F2;// 0x0B28(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2F2C7F184E217FD468D9A694AB07408B2;// 0x0B50(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B7426472;// 0x0C30(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E333A8694A60DCA8716C6C89F04319E62;// 0x0C58(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E624852;// 0x0C88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FA063D5422D9F7F150146A3F71550EF;// 0x0CB0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1F4628174687604DE3923DA933B4BCB7;// 0x0CC8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D6823204D7182B45F240E8AE9ED34E4;// 0x0CE0(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_57A16E8643D816D0F46037AB5BB3964E;// 0x0CF8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F3;// 0x0D28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860614D6439D00AD15C1A197E26090762;// 0x0D50(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55AA521A42A70933A7B24C8F0721B4EC;// 0x0D68(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F2;// 0x0D98(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CB13C274D943274D22BFB9367513D98;// 0x0DC0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F;// 0x0DF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9679F85D486320A711DD4DAC035F205C;// 0x0E18(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860614D6439D00AD15C1A197E2609076;// 0x0E30(0x0018)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2F2C7F184E217FD468D9A694AB07408B;// 0x0E48(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B742647;// 0x0F28(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E333A8694A60DCA8716C6C89F04319E6;// 0x0F50(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E62485;// 0x0F80(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_217055EF42AD1C8502897F970ED759F8;// 0x0FA8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB92;// 0x1088(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6744F1764DE401F068738FADF1E3ACD5;// 0x10B0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F;// 0x10E0(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_177C931A40C9713794DBA7A8C4F1B5CF;// 0x1108(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_479EE9EA4EC687A623E28D975CF18AE0;// 0x1168(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9FFB8FAB4474DCF774DC968F5CE7D19C;// 0x11C8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E27DCCCF441FF1DDC82981BE165F1C80;// 0x11F8(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8E6996CB4B567A5EFD39608F52C58CB8;// 0x1228(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B72EFD8C489AFAEBAD9B5894CFE13804;// 0x1278(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F0B2D0664612E018672E6BB4192F0D22;// 0x12B8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3739EDC44CE4717786B111A3AA929569;// 0x1308(0x0060)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_97FC1BDF4C41ED7BD659F682613ED95B;// 0x1368(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_111DABF446F91C8B0ED2639EFE460D24;// 0x13B8(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_096512C543E6068A30551AA46B44C2CA;// 0x13F8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CA2A8100469508E0F4EE84948EF07BEE;// 0x1420(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1CB775D54501020B2B28FAB002E35557;// 0x1448(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_45F41D7349EA2A6AD53E939B08F10EF5;// 0x1478(0x00E0)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1558(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E3B37B4F4C4A85535014F999CF63CAE8;// 0x1560(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DAB6C6884312BE94869F25ABAB7EF35B;// 0x1610(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D8FBE1704564695BE61B40977FD0EF67;// 0x1638(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_329736D342C4E87E2D66E78AAAB03CF1;// 0x1660(0x0028)
	bool                                               sail_is_open;                                             // 0x1688(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x1689(0x0003) MISSED OFFSET
	float                                              VerticalAnimBlendInterpSpeed;                             // 0x168C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     MovementAnimBlendAxes;                                    // 0x1690(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x169C(0x0004) MISSED OFFSET
	double                                             time_since_state_change;                                  // 0x16A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityDeltaPitchUp_MaxPitch;                            // 0x16A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityPitchUp_RequiredForwardDot;                       // 0x16AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityDeltaPitchUp_Base;                                // 0x16B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityDeltaPitchUp_RequiredAccelerationDifference;      // 0x16B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MeshRotationTurnAngle_Base;                               // 0x16B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotateMeshWithTurnsAboveTurnRatio;                        // 0x16BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningRatio;                                             // 0x16C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MeshRotationTurnAngle_Max;                                // 0x16C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_HoverSkiffHoverState>                CurrentHoverState;                                        // 0x16C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x16C9(0x0003) MISSED OFFSET
	float                                              FreeFallPitchAngle;                                       // 0x16CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningRatioInterpSpeed_Up;                               // 0x16D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurningRatioInterpSpeed_Down;                             // 0x16D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              currTurningSpeed;                                         // 0x16D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BaseTurningSpeed;                                         // 0x16DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    MeshRotationOffsetLimits_IK;                              // 0x16E0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HoverIK_BlendOutAboveHoverHeightRange;                    // 0x16EC(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverIK_InterpSpeed_Rotation_Reset;                       // 0x16F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverIK_InterpSpeed_Rotation;                             // 0x16F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    RootRotationOffset;                                       // 0x16FC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RootLocationOffset;                                       // 0x1708(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    MeshRotationOffsetLimits_Total;                           // 0x1714(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct UObject_FTransform                          RootOffsetTransform;                                      // 0x1720(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     FinalRootLocationOffset;                                  // 0x1750(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              forward_axis_amount_before_max;                           // 0x175C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              right_axis_amount_before_max;                             // 0x1760(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_1;                                            // 0x1764(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DEBUG_TEST_TRICKS;                                        // 0x1765(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_2;                                            // 0x1766(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               doing_any_tricks_at_all;                                  // 0x1767(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               holding_jump;                                             // 0x1768(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               use_wobble;                                               // 0x1769(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               use_jump;                                                 // 0x176A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x5];                                       // 0x176B(0x0005) MISSED OFFSET
	class ATekHoverSail_Character_BP_C*                sail_ref;                                                 // 0x1770(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	float                                              remaining_trick_time;                                     // 0x1778(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              trick_1_duration;                                         // 0x177C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              trick_2_duration;                                         // 0x1780(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               last_trick_was_trick_1;                                   // 0x1784(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               last_trick_was_trick_2;                                   // 0x1785(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x1786(0x0002) MISSED OFFSET
	double                                             available_time_since;                                     // 0x1788(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Delta;                                                    // 0x1790(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_3;                                            // 0x1794(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Doing_Trick_4;                                            // 0x1795(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               last_trick_was_trick_3;                                   // 0x1796(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               last_trick_was_trick_4;                                   // 0x1797(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              trick_3_duration__set_this_up_;                           // 0x1798(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              trick_4_duration__set_this_up_;                           // 0x179C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               resync;                                                   // 0x17A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x17A1(0x0003) MISSED OFFSET
	float                                              last_pitch;                                               // 0x17A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              turn_amount;                                              // 0x17A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_cliff_diving;                                          // 0x17AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x17AD(0x0003) MISSED OFFSET
	struct FRotator                                    last_relative_rot;                                        // 0x17B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              aerial_pitch_turn_trate;                                  // 0x17BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              aerial_pitch_blend_strength;                              // 0x17C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              aerial_pitch_blend_strength_simple_ollie;                 // 0x17C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              holding_drift_direction;                                  // 0x17C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              angle_to_turn_mesh_when_holding_drift;                    // 0x17CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              holding_drift_blend_rate;                                 // 0x17D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               is_moving;                                                // 0x17D4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               has_passenger;                                            // 0x17D5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               recently_spawned;                                         // 0x17D6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               has_rider;                                                // 0x17D7(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SingleRiderAdditiveAlpha;                                 // 0x17D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SailClosedClampPitch;                                     // 0x17DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x17E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue;                   // 0x17E1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x17E2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x17E3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x17E4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x17E5(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x17E6(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x17E7(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue2;                  // 0x17E8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x17E9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x17EA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x17EB(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x17EC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x17ED(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x17EE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x17EF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x17F0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x17F4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x17F8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x17FC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue;                            // 0x1800(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue2;                           // 0x1804(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue3;                  // 0x1808(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue;              // 0x1809(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x180A(0x0002) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x180C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue2;                        // 0x1810(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue3;                        // 0x1814(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue4;                  // 0x1818(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x1819(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2];                                       // 0x181A(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector_X2;                                  // 0x181C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x1820(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x1824(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue3;                           // 0x1828(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue4;                           // 0x182C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Subtract_FloatFloat_ReturnValue;                 // 0x1830(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue;                              // 0x1834(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue5;                  // 0x1838(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue6;                  // 0x1839(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x183A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x183B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x183C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x183D(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X3;                                  // 0x1840(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y3;                                  // 0x1844(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z3;                                  // 0x1848(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue5;                           // 0x184C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue7;                  // 0x1850(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x1851(0x0003) MISSED OFFSET
	float                                              CallFunc_Subtract_FloatFloat_ReturnValue2;                // 0x1854(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x1858(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x1859(0x0003) MISSED OFFSET
	float                                              CallFunc_MapRange_ReturnValue6;                           // 0x185C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X4;                                  // 0x1860(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y4;                                  // 0x1864(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z4;                                  // 0x1868(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x186C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue7;                           // 0x1870(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue3;                // 0x1874(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue8;                           // 0x1878(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x187C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x187D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue8;                  // 0x187E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue9;                  // 0x187F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x1880(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue13;                       // 0x1881(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x1882(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue7;                          // 0x1883(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue10;                 // 0x1884(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue14;                       // 0x1885(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x1886(0x0002) MISSED OFFSET
	float                                              CallFunc_BreakVector_X5;                                  // 0x1888(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y5;                                  // 0x188C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z5;                                  // 0x1890(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue4;                // 0x1894(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue9;                           // 0x1898(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_MapRange_ReturnValue10;                          // 0x189C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NearlyEqual_FloatFloat_ReturnValue2;             // 0x18A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x18A1(0x0003) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue4;                        // 0x18A4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue5;                        // 0x18A8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue6;                        // 0x18AC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x18B0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x4];                                       // 0x18B4(0x0004) MISSED OFFSET
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x18B8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class ATekHoverSail_Character_BP_C*                K2Node_DynamicCast_AsTekHoverSail_Character_BP_C;         // 0x18C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x18C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x18C9(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X6;                                  // 0x18CC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y6;                                  // 0x18D0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z6;                                  // 0x18D4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x18D8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x18DC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue15;                       // 0x18DD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue16;                       // 0x18DE(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x18DF(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue8;                          // 0x18E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue9;                          // 0x18E1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue11;                 // 0x18E2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue17;                       // 0x18E3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Abs_ReturnValue;                                 // 0x18E4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x18E8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x3];                                       // 0x18E9(0x0003) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue7;                        // 0x18EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x18F0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue8;                        // 0x18F4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Abs_ReturnValue2;                                // 0x18F8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x18FC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue18;                       // 0x18FD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x2];                                       // 0x18FE(0x0002) MISSED OFFSET
	float                                              CallFunc_SelectFloat_ReturnValue9;                        // 0x1900(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue;                // 0x1904(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x1905(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue12;                 // 0x1906(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue19;                       // 0x1907(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue10;                         // 0x1908(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Is_Near_Ground_not_pure_ReturnValue;             // 0x1909(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue20;                       // 0x190A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue21;                       // 0x190B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x190C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x190D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_DoubleDouble_ReturnValue13;                 // 0x190E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue22;                       // 0x190F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue2;               // 0x1910(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x1911(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue23;                       // 0x1912(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	TEnumAsByte<ENetRole>                              CallFunc_GetRole_ReturnValue;                             // 0x1913(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue11;                         // 0x1914(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x1915(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x2];                                       // 0x1916(0x0002) MISSED OFFSET
	struct FVector                                     CallFunc_GetActorForwardVector_ReturnValue;               // 0x1918(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x4];                                       // 0x1924(0x0004) MISSED OFFSET
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue;                         // 0x1928(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_TimeSince_Network_ReturnValue;                   // 0x1930(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue3;                    // 0x1934(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x3];                                       // 0x1935(0x0003) MISSED OFFSET
	double                                             CallFunc_Conv_FloatToDouble_ReturnValue;                  // 0x1938(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue9;                         // 0x1940(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x3];                                       // 0x1941(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_GetActorRightVector_ReturnValue;                 // 0x1944(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Dot_VectorVector_ReturnValue;                    // 0x1950(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetMaxAcceleration_ReturnValue;                  // 0x1954(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x1958(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x1959(0x0003) MISSED OFFSET
	struct FVector                                     CallFunc_SelectVector_ReturnValue;                        // 0x195C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue10;                       // 0x1968(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Dot_VectorVector_ReturnValue2;                   // 0x196C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Dot_VectorVector_ReturnValue3;                   // 0x1970(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue3;                  // 0x1974(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue4;                  // 0x1978(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue2;                             // 0x197C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_FClamp_ReturnValue3;                             // 0x1980(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue11;                       // 0x1984(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UWorld*                                      CallFunc_K2_GetWorld_ReturnValue2;                        // 0x1988(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue3;               // 0x1990(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData24[0x3];                                       // 0x1991(0x0003) MISSED OFFSET
	float                                              CallFunc_TimeSince_Network_ReturnValue2;                  // 0x1994(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_LessEqual_FloatFloat_ReturnValue4;               // 0x1998(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x3];                                       // 0x1999(0x0003) MISSED OFFSET
