#pragma once

// ARKSurvivalEvolved (332.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_ShooterGame_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ShooterGame.PrimalDinoAIController
// 0x0318 (0x08B0 - 0x0598)
class APrimalDinoAIController : public AAIController
{
public:
	float                                              DieIfLeftWaterWanderMinimumWaterHeightMultiplier;         // 0x0598(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DieIfLeftWaterReachedRadiusDistanceCheckMultiplier;       // 0x059C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DieIfLeftWaterTargetUnsubmergedTimeout;                   // 0x05A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LandDinoMaxWaterTargetDepthCapsuleMultiplier;             // 0x05A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExtraCorpseTargetingRange;                                // 0x05A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FleeFromAttackCoolDownTime;                               // 0x05AC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FleeFromAttackTimeLimit;                                  // 0x05B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceFleeUnderHealthPercentage;                           // 0x05B4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFleeOnCriticalHealth;                                    // 0x05B8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x05B9(0x0003) MISSED OFFSET
	float                                              DieIfLeftWaterTargetingRequiresFreeDepth;                 // 0x05BC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             LastBlockadeCheckTime;                                    // 0x05C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastMovingAroundBlockadeTime;                             // 0x05C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              MovingAroundBlockadeDirection;                            // 0x05D0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     MovingAroundBlockadePoint;                                // 0x05D4(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              LastBlockadeWidth;                                        // 0x05E0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastBlockadeHitNormal;                                    // 0x05E4(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastBlockadeHitLocation;                                  // 0x05F0(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     StartMovingAroundBlockadeLocation;                        // 0x05FC(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      LastMovingAroundBlockadeActor;                            // 0x0608(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bForcedAggro : 1;                                         // 0x0610(0x0001) (Edit, Transient)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0611(0x0007) MISSED OFFSET
	class AActor*                                      ForceTargetActor;                                         // 0x0618(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      Target;                                                   // 0x0620(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              AttackDestinationOffset;                                  // 0x0628(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseOverlapTargetCheck;                                   // 0x062C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bNotifyNeighborsWithoutDamage;                            // 0x062D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseBPShouldNotifyNeighbor;                               // 0x062E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseBPShouldNotifyAnyNeighbor;                            // 0x062F(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRequireAbsoluteDamageForNeighborNotification;            // 0x0630(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0631(0x0003) MISSED OFFSET
	float                                              AboveDeltaZAttackRange;                                   // 0x0634(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BelowDeltaZAttackRange;                                   // 0x0638(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WildAboveDeltaZTargetingRange;                            // 0x063C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WildBelowDeltaZTargetingRange;                            // 0x0640(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bWildUseDeltaZTargetingForFlyerPawnOrBigDino;             // 0x0644(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x13];                                      // 0x0645(0x0013) MISSED OFFSET
	bool                                               bDontWander;                                              // 0x0658(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlyOverlapTargetCorpsesUnlessHasTarget;                 // 0x0659(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x065A(0x0002) MISSED OFFSET
	float                                              NaturalTargetingRange;                                    // 0x065C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TamedTargetingRange;                                      // 0x0660(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TamedCorpseFoodTargetingRange;                            // 0x0664(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WanderRandomDistanceAmount;                               // 0x0668(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlyingWanderFixedDistanceAmount;                          // 0x066C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlyingWanderRandomDistanceAmount;                         // 0x0670(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyingTargetDeltaZ;                                    // 0x0674(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WanderFlyingZScaler;                                      // 0x0678(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WanderFlyingClampZHeightAboveGround;                      // 0x067C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WanderFlyingMinZHeightAboveGround;                        // 0x0680(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WanderFixedDistanceAmount;                                // 0x0684(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseAggro;                                                // 0x0688(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0689(0x0003) MISSED OFFSET
	float                                              MinAggroValue;                                            // 0x068C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroToAddUponRemovingTarget;                             // 0x0690(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroToAddUponAcquiringTarget;                            // 0x0694(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroFactorDecreaseSpeed;                                 // 0x0698(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroFactorDecreaseGracePeriod;                           // 0x069C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroFactorDamagePercentageMultiplier;                    // 0x06A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroNotifyNeighborsMultiplier;                           // 0x06A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroNotifyNeighborsRange;                                // 0x06A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroNotifyNeighborsRangeFalloff;                         // 0x06AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TargetingDistanceReductionFactorLinear;                   // 0x06B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TargetingDistanceReductionFactorExponent;                 // 0x06B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BeyondTargetingRangeAggroAddition;                        // 0x06B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AggroFactorDesirabilityMultiplier;                        // 0x06BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackRange;                                              // 0x06C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AttackInterval;                                           // 0x06C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AttackRotationRangeDegrees;                               // 0x06C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AttackRotationGroundSpeedMultiplier;                      // 0x06CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RangeTargetWildDinosMultiplier;                           // 0x06D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    AttackRotationRate;                                       // 0x06D4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFocusOnTargetDuringAttack;                               // 0x06E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x06E1(0x0003) MISSED OFFSET
	struct FVector                                     FlyingMoveTowardsTargetOffset;                            // 0x06E4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CombatFlyingMoveTowardsTargetOffset;                      // 0x06F0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     FlyingTargetFocalPositionOffset;                          // 0x06FC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FlyingReachedDestinationThresholdOffset;                  // 0x0708(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SeekingIntervalCheckToFly;                                // 0x070C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SeekingPercentChanceToFly;                                // 0x0710(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SeekingIntervalCheckToLand;                               // 0x0714(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SeekingPercentChanceToLand;                               // 0x0718(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinimumWanderGroundNormalZ;                               // 0x071C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FollowStoppingDistance;                                   // 0x0720(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseOverlapTargetCheckTraces;                             // 0x0724(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseAlternateMovePoint;                                   // 0x0725(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bTotallyIgnoreWaterTargets;                               // 0x0726(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bWaterDinoAllowUnsubmergedTargets;                        // 0x0727(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LastCheckAttackRangePawnLocation;                         // 0x0728(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastCheckAttackRangeClosestPoint;                         // 0x0734(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     LastCheckAttackRangeTargetLocation;                       // 0x0740(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x074C(0x0004) MISSED OFFSET
	class AActor*                                      LastCheckAttackRangeTarget;                               // 0x0750(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               HasAttackPriority;                                        // 0x0758(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0759(0x0007) MISSED OFFSET
	TArray<float>                                      TamedAITargetingRangeMultipliers;                         // 0x0760(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              MateBoostAggroNotifyNeighborsMultiplier;                  // 0x0770(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x0774(0x0004) MISSED OFFSET
	class UBehaviorTree*                               BehaviourTree;                                            // 0x0778(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               HasEnemyTree;                                             // 0x0780(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               BabyHasEnemyTree;                                         // 0x0788(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               ForcedAggroHasEnemyTree;                                  // 0x0790(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               NoEnemyTree;                                              // 0x0798(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               FleeFromAttackTree;                                       // 0x07A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               TamedNoEnemyTree;                                         // 0x07A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               MissionTree;                                              // 0x07B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              AggroNotifyNeighborsClasses;                              // 0x07B8(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      bIgnoreMoveAroundBlockade : 1;                            // 0x07C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bFlyingUseMoveAroundBlockade : 1;                         // 0x07C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseGeometryInsteadOfStationObjForFreeDepthTest : 1;      // 0x07C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bNotifyBPTargetSet : 1;                                   // 0x07C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseBPSetupFindTarget : 1;                                // 0x07C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bNotAllowedToFindTargets : 1;                             // 0x07C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bAllowForceFleeToSameTargetingTeam : 1;                   // 0x07C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseBPUpdateBestTarget : 1;                               // 0x07C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData10[0x3];                                       // 0x07C9(0x0003) MISSED OFFSET
	float                                              MoveAroundBlockadeAdditionalWidth;                        // 0x07CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MoveAroundObjectMaxVelocity;                              // 0x07D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ForcedAggroTimeCounter;                                   // 0x07D4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TamedMaxFollowDistance;                                   // 0x07D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bTargetChanged : 1;                                       // 0x07DC(0x0001) (BlueprintVisible)
	unsigned char                                      bAttackForcesRunning : 1;                                 // 0x07DC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseFlyingTargetOffsets : 1;                              // 0x07DC(0x0001) (Edit)
	unsigned char                                      bRidingDinoTargetPlayer : 1;                              // 0x07DC(0x0001) (Edit)
	unsigned char                                      bRidingPlayerTargetDino : 1;                              // 0x07DC(0x0001) (Edit)
	unsigned char                                      bIgnoreWaterOrAmphibiousTargets : 1;                      // 0x07DC(0x0001) (Edit)
	unsigned char                                      bUseBPTargetingDesire : 1;                                // 0x07DC(0x0001) (Edit)
	unsigned char                                      bDisableForceFlee : 1;                                    // 0x07DC(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseCombatMoveTowardsTargetOffset : 1;                    // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBPOverrideIgnoredByWildDino : 1;                      // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanUseAttackStateOnTargetChange : 1;                     // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData11 : 1;                                        // 0x07DD(0x0001)
	unsigned char                                      bForceOnlyTargetingPlayerOrTamed : 1;                     // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceTargetingAllStructures : 1;                         // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceTargetDinoRider : 1;                                // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bFlyerAllowWaterTargeting : 1;                            // 0x07DD(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseBPForceTargetDinoRider : 1;                           // 0x07DE(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAlwaysStartledWhenAggroedByNeighbor : 1;                 // 0x07DE(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceOnlyTargetingPlayers : 1;                           // 0x07DE(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsMissionDino : 1;                                       // 0x07DE(0x0001) (Edit)
	unsigned char                                      bUseImprovedAggroFalloffBehavior : 1;                     // 0x07DE(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData12[0x1];                                       // 0x07DF(0x0001) MISSED OFFSET
	float                                              BaseStructureTargetingDesire;                             // 0x07E0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LandDinoMaxFlyerTargetDeltaZ;                             // 0x07E4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NaturalMaxDepthZ;                                         // 0x07E8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       ForcedAttackTarget;                                       // 0x07EC(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ForcedAttackEnemyTeam;                                    // 0x07F4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             LastForcedAttackEnemyTeamTime;                            // 0x07F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x4];                                       // 0x0800(0x0004) MISSED OFFSET
	float                                              ForcedFleeDuration;                                       // 0x0804(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinAttackIntervalForFleeing;                              // 0x0808(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinLocChangeIntervalForFleeing;                           // 0x080C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PercentageTorporForFleeing;                               // 0x0810(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamagedForceAggroInterval;                                // 0x0814(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             ForceAggroUntilTime;                                      // 0x0818(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastExecutedAttackTime;                                   // 0x0820(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	double                                             LastForcedFleeTime;                                       // 0x0828(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	double                                             LastFleeLocCheckTime;                                     // 0x0830(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0xC];                                       // 0x0838(0x000C) MISSED OFFSET
	int                                                NumAlliesToAttack;                                        // 0x0844(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FindLandingPositionZOffset;                               // 0x0848(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TamedFollowAcceptanceRadiusOffset;                        // 0x084C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TamedFollowAcceptanceHeightOffset;                        // 0x0850(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AIFlightMaxLandingZDistance;                              // 0x0854(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	double                                             ForcedMoveToUntilTime;                                    // 0x0858(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x8];                                       // 0x0860(0x0008) MISSED OFFSET
	unsigned char                                      bUseBP_TamedOverrideHorizontalLandingRange : 1;           // 0x0868(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bFlyerWanderDefaultToOrigin : 1;                          // 0x0868(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCheckBuffTargetingDesireOverride : 1;                    // 0x0868(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowSwimWanderingForLandDinos : 1;                      // 0x0868(0x0001) (Edit)
	unsigned char                                      bUse_BPOverrideLandingLocation : 1;                       // 0x0868(0x0001) (Edit)
	unsigned char                                      UnknownData16[0x7];                                       // 0x0869(0x0007) MISSED OFFSET
	TArray<class UClass*>                              WildTargetingDesireMultiplierClasses;                     // 0x0870(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      WildTargetingDesireMultiplierValues;                      // 0x0880(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              TamedTargetingDesireMultiplierClasses;                    // 0x0890(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      TamedTargetingDesireMultiplierValues;                     // 0x08A0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalDinoAIController");
		return ptr;
	}


	bool WantsAttackPriority();
	void UpdateAggro();
	void StopBrainComponent(const class FString& Reason);
	struct FVector StaticGetRandomWanderDestination(class APrimalDinoCharacter* TargetCharacter, class APrimalDinoAIController* TargetAIController, const struct FVector& locOverride, float randomOffsetMultiplier, bool bUseRandomNegativeXDir, bool bOrientRandOffsetByRotation, const struct FRotator& orientRandOffsetByRotation, float GroundCheckSpreadOverride);
	bool ShouldForceRunWhenAttacking();
	void SetTarget(class AActor* InTarget, bool bDontAddAggro, bool bOverlapFoundTarget);
	void SetHasAttackPriority(bool Value);
	void SetAttackRotationRate();
	void SetAttackGroundSpeed();
	void ResumeBrainComponent(const class FString& Reason);
	void RestartBrainComponent();
	void ResetRotationUseAcceleration();
	void ResetRotationRate();
	void ResetGroundSpeed();
	void ResetAccelerationFollowsRotation();
	void RecoverMovement();
	void RebootBrainComponent();
	void PlayStartledAnim();
	void PauseBrainComponent(const class FString& Reason);
	bool OrderedToLand();
	void OnLosingTargetEvent();
	bool IsWithinAttackRangeAndCalculateBestAttack(class AActor* Other, bool* bAttackChanged);
	bool IsWithinAttackRange(class AActor* Other, bool bForceUseLastAttackIndex);
	bool IsLogicPaused();
	bool IsForceTargetDinoRider(class AShooterCharacter* playerTarget);
	struct FVector GetWanderAroundActorDestination(class APrimalDinoCharacter* DinoCharacter, const struct FVector& originalDestination);
	class AActor* GetTarget();
	struct FVector GetRandomWanderDestination(const struct FVector& locOverride, float randomOffsetMultiplier, bool bUseRandomNegativeXDir, bool bOrientRandOffsetByRotation, const struct FRotator& orientRandOffsetByRotation);
	float GetMinAttackRange();
	struct FVector GetLandingLocation();
	bool GetHasAttackPriority();
	unsigned char GetCurrentAttackIndex();
	class APawn* GetControllerPawn();
	class APrimalDinoCharacter* GetControlledDino();
	class UStaticMeshComponent* GetClosestTree(struct FOverlapResult* OutHit);
	struct FRotator GetAttackRotationRate();
	float GetAttackRotationRangeDegrees();
	float GetAttackRotationGroundSpeedMultiplier();
	float GetAttackRange();
	float GetAttackInterval();
	float GetAggroNotifyNeighborsRange();
	bool GetAggroEntry(int index, class AActor** OutAttacker, float* OutAggroFactor, double* OutLastAggroHitTime);
	int GetAggroEntriesCount();
	class AActor* GetAggroEntriesAttackerAtIndex(int index);
	float GetAggroDesirability(class AActor* InTarget);
	class AActor* FindTarget(bool bDontSet);
	class AActor* FindNewTarget(bool bDontSet);
	void ClearAggroEntries();
	void ChangedAITarget();
	bool CanLand();
	bool CalculateAndSetWonderingAIStateEvent(bool StateChanged);
	bool CalculateAndSetWonderingAIState(bool* StateChanged);
	class AActor* BPUpdateBestTarget(class AActor* bestTarget, bool dontSetIn, bool* dontSetOut);
	bool BPShouldNotifyNeighbor(class APrimalDinoCharacter* neighbor);
	bool BPShouldNotifyAnyNeighbor(class APrimalDinoCharacter* neighbor);
	void BPSetupFindTarget();
	struct FVector BPOverrideLandingLocation(float* outRadius);
	bool BPOverrideIgnoredByWildDino(class AActor* wildDinoToIgnore);
	void BPOnFleeEvent();
	void BPNotifyTargetSet();
	float BPGetTargetingDesire(class AActor* forTarget, float ForTargetingDesireValue);
	bool BPForceTargetDinoRider(class AShooterCharacter* playerTarget);
	struct FVector2D BP_TamedOverrideHorizontalLandingRange();
	void AvoidOutOfWater();
	void AvoidGenericToPoint(const struct FVector& TargetDestination);
	void AddToAggro(class AActor* Attacker, float DamagePercent, bool bNotifyNeighbors, bool SetValue, bool bIsFromDamage, bool skipTeamCheck);
};


// Class ShooterGame.AIAttackCoordinator
// 0x0020 (0x0488 - 0x0468)
class AAIAttackCoordinator : public AActor
{
public:
	int                                                MaxAttackersPerTarget;                                    // 0x0468(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UpdateInterval;                                           // 0x046C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<TWeakObjectPtr<class APrimalDinoAIController>> Attackers;                                                // 0x0470(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0480(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AIAttackCoordinator");
		return ptr;
	}


	void UpdateAttackGroup(TArray<class APrimalDinoAIController*>* AttackGroup);
	void RemoveAttacker(class APrimalDinoAIController* Controller);
	int GetNumAttackersWithPriorityForTarget(class AActor* Target);
	int GetNumAttackersForTarget(class AActor* Target);
	void ClearAllAttackers();
	float CalculateAttackerPriorityWeight(class APrimalDinoAIController* Attacker);
	void AddAttackerCharacter(class APrimalDinoCharacter* Character);
	void AddAttacker(class APrimalDinoAIController* Controller);
};


// Class ShooterGame.CorruptedAvatarAttackCoordinator
// 0x0008 (0x0490 - 0x0488)
class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0488(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.CorruptedAvatarAttackCoordinator");
		return ptr;
	}

};


// Class ShooterGame.PrimalGlobals
// 0x0190 (0x01B8 - 0x0028)
class UPrimalGlobals : public UObject
{
public:
	class UPrimalGameData*                             PrimalGameData;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPrimalGameData*                             PrimalGameDataOverride;                                   // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FStringAssetReference                       PrimalGameDataAsset;                                      // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FStringAssetReference>               PrimalGameDataAssetExtended;                              // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      RagdollKinematicActorClass;                               // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      GlobalGenericConfirmationDialog;                          // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowSingleplayer;                                       // 0x0068(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowNonDedicatedHost;                                   // 0x0069(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x006A(0x0006) MISSED OFFSET
	TArray<class FString>                              UIOnlyShowMapFileNames;                                   // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              UIOnlyShowModIDs;                                         // 0x0080(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bTotalConversionShowUnofficialServers;                    // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	class FString                                      CreditString;                                             // 0x0098(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FLinearColor                                AlphaMissionColor;                                        // 0x00A8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                BetaMissionColor;                                         // 0x00B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                GammaMissionColor;                                        // 0x00C8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                MissionCompleteMultiUseWheelTextColor;                    // 0x00D8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FStringAssetReference>               UIGamepadIconRefs;                                        // 0x00E8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UTexture2D*>                          UIGamepadIcons;                                           // 0x00F8(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData02[0xB0];                                      // 0x0108(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalGlobals");
		return ptr;
	}


	void OnConfirmationDialogClosed(bool bAccept);
	class ADayCycleManager* GetDayCycleManager(class UWorld* World);
	void FinishedLoadingGameMedia();
};


// Class ShooterGame.DataListProviderInterface
// 0x0000 (0x0028 - 0x0028)
class UDataListProviderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListProviderInterface");
		return ptr;
	}

};


// Class ShooterGame.PrimalGameData
// 0x2070 (0x2098 - 0x0028)
class UPrimalGameData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0028(0x0030) MISSED OFFSET
	class FString                                      ModName;                                                  // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ModDescription;                                           // 0x0068(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FPrimalCharacterStatusValueDefinition       StatusValueDefinitions[0xC];                              // 0x0078(0x0020) (Edit, DisableEditOnInstance)
	struct FPrimalCharacterStatusStateDefinition       StatusStateDefinitions[0xE];                              // 0x01F8(0x0050) (Edit, DisableEditOnInstance)
	struct FPrimalItemStatDefinition                   ItemStatDefinitions[0x8];                                 // 0x0658(0x0018) (Edit, DisableEditOnInstance)
	struct FPrimalItemDefinition                       ItemTypeDefinitions[0x9];                                 // 0x0718(0x0018) (Edit, DisableEditOnInstance)
	struct FPrimalEquipmentDefinition                  EquipmentTypeDefinitions[0xB];                            // 0x07F0(0x0018) (Edit, DisableEditOnInstance)
	TArray<class UClass*>                              MasterItemList;                                           // 0x08F8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FPrimalItemQuality>                  ItemQualityDefinitions;                                   // 0x0908(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              EngramBlueprintClasses;                                   // 0x0918(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AdditionalEngramBlueprintClasses;                         // 0x0928(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              RemoveEngramBlueprintClasses;                             // 0x0938(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FStatusValueModifierDescription>     StatusValueModifierDescriptions;                          // 0x0948(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              PlayerSpawnRegions;                                       // 0x0958(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  TutorialDisplaySound;                                     // 0x0968(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StartItemDrag;                                      // 0x0970(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StopItemDrag;                                       // 0x0978(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  PreventGrindingIcon;                                      // 0x0980(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_CancelPlacingStructure;                             // 0x0988(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ChooseStructureRotation;                            // 0x0990(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_FailPlacingStructure;                               // 0x0998(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ConfirmPlacingStructure;                            // 0x09A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_StartPlacingStructure;                              // 0x09A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_CorpseDecompose;                                    // 0x09B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyLevelUp;                                       // 0x09B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyLevelPoint;                                    // 0x09C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_LearnedEngram;                                      // 0x09C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ReconnectToCharacter;                               // 0x09D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_DropAllItems;                                       // 0x09D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferAllItemsToRemote;                           // 0x09E0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferAllItemsFromRemote;                         // 0x09E8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferItemToRemote;                               // 0x09F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TransferItemFromRemote;                             // 0x09F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddItemToSlot;                                      // 0x0A00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemoveItemFromSlot;                                 // 0x0A08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ClearCraftQueue;                                    // 0x0A10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddToCraftQueue;                                    // 0x0A18(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SetRadioFrequency;                                  // 0x0A20(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_AddPinToMap;                                        // 0x0A28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RemovePinFromMap;                                   // 0x0A30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyDye;                                           // 0x0A38(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_ApplyPaint;                                         // 0x0A40(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SetTextGeneric;                                     // 0x0A48(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_SplitItemStack;                                     // 0x0A50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_MergeItemStack;                                     // 0x0A58(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_InputPinDigit;                                      // 0x0A60(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_PinValidated;                                       // 0x0A68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_PinRejected;                                        // 0x0A70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TribeWarBegin;                                      // 0x0A78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_TribeWarEnd;                                        // 0x0A80(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_DropInventoryItem;                                  // 0x0A88(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Sound_RefillWaterContainer;                               // 0x0A90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FAppIDItem>                          CoreAppIDItems;                                           // 0x0A98(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FAppIDItem>                          AppIDItems;                                               // 0x0AA8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UPrimalEngramEntry*>                  EngramBlueprintEntries;                                   // 0x0AB8(0x0010) (ZeroConstructor, Transient)
	TArray<class UPrimalDinoEntry*>                    DinoEntriesObjects;                                       // 0x0AC8(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               ExplorerNoteEntriesObjects;                               // 0x0AD8(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               HeadHairStylesEntriesObjects;                             // 0x0AE8(0x0010) (ZeroConstructor, Transient)
	TArray<class UGenericDataListEntry*>               FacialHairStylesEntriesObjects;                           // 0x0AF8(0x0010) (ZeroConstructor, Transient)
	class UClass*                                      DefaultToolTipWidget;                                     // 0x0B08(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      StarterNoteItem;                                          // 0x0B10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              PrimaryResources;                                         // 0x0B18(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      GenericDroppedItemTemplate;                               // 0x0B28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          PostProcess_KnockoutBlur;                                 // 0x0B30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          AdditionalDeathPostProcessEffect;                         // 0x0B38(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UMaterialInterface*>                  BuffPostProcessEffects;                                   // 0x0B40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>                  AdditionalBuffPostProcessEffects;                         // 0x0B50(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRangedValues>                       EngramPointPurchaseRanges;                                // 0x0B60(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      GenericDroppedItemTemplateLowQuality;                     // 0x0B70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0B78(0x0010) MISSED OFFSET
	class UTexture2D*                                  UnknownIcon;                                              // 0x0B88(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          UnknownMaterial;                                          // 0x0B90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  WhiteTexture;                                             // 0x0B98(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BlueprintBackground;                                      // 0x0BA0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  BabyCuddleIcon;                                           // 0x0BA8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  ImprintedRiderIcon;                                       // 0x0BB0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  WeaponAccessoryActivatedIcon;                             // 0x0BB8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  EngramBackground;                                         // 0x0BC0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  VoiceChatIcon;                                            // 0x0BC8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  VoiceChatYellingIcon;                                     // 0x0BD0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  VoiceChatWhisperingIcon;                                  // 0x0BD8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  ItemButtonRecentlySelectedBackground;                     // 0x0BE0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              DinoEntries;                                              // 0x0BE8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AdditionalDinoEntries;                                    // 0x0BF8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              GlobalGeneralArmorDegradationMultiplier;                  // 0x0C08(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalSpecificArmorDegradationMultiplier;                 // 0x0C0C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalSpecificArmorRatingMultiplier;                      // 0x0C10(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalGeneralArmorRatingMultiplier;                       // 0x0C14(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EnemyFoundationPreventionRadius;                          // 0x0C18(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0C1C(0x0004) MISSED OFFSET
	TArray<struct FColorDefinition>                    ColorDefinitions;                                         // 0x0C20(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                             ExtraResources;                                           // 0x0C30(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                             BaseExtraResources;                                       // 0x0C40(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                                  CombatMusicDay;                                           // 0x0C50(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicNight;                                         // 0x0C58(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicDay_Heavy;                                     // 0x0C60(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  CombatMusicNight_Heavy;                                   // 0x0C68(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  LevelUpStingerSound;                                      // 0x0C70(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  TrackMissionSound;                                        // 0x0C78(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
