#pragma once

// ARKSurvivalEvolved (301.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_Basic.hpp"
#include "ARKSurvivalEvolved_CoreUObject_classes.hpp"
#include "ARKSurvivalEvolved_AIModule_classes.hpp"
#include "ARKSurvivalEvolved_Engine_classes.hpp"
#include "ARKSurvivalEvolved_InputCore_classes.hpp"
#include "ARKSurvivalEvolved_OnlineSubsystemUtils_classes.hpp"
#include "ARKSurvivalEvolved_UMG_classes.hpp"
#include "ARKSurvivalEvolved_Slate_classes.hpp"
#include "ARKSurvivalEvolved_SlateCore_classes.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ShooterGame.ESTOFNotificationType
enum class ESTOFNotificationType : uint8_t
{
	ESTOFNotificationType__Death   = 0,
	ESTOFNotificationType__TribeEliminated = 1,
	ESTOFNotificationType__MatchVictory = 2,
	ESTOFNotificationType__MatchDraw = 3,
	ESTOFNotificationType__MAX     = 4,
	ESTOFNotificationType__ESTOFNotificationType_MAX = 5
};


// Enum ShooterGame.EPrimalARKTributeDataType
enum class EPrimalARKTributeDataType : uint8_t
{
	EPrimalARKTributeDataType__Items = 0,
	EPrimalARKTributeDataType__TamedDinos = 1,
	EPrimalARKTributeDataType__CharacterData = 2,
	EPrimalARKTributeDataType__MAX = 3,
	EPrimalARKTributeDataType__EPrimalARKTributeDataType_MAX = 4
};


// Enum ShooterGame.EPrimalCharacterStatusValue
enum class EPrimalCharacterStatusValue : uint8_t
{
	EPrimalCharacterStatusValue__Health = 0,
	EPrimalCharacterStatusValue__Stamina = 1,
	EPrimalCharacterStatusValue__Torpidity = 2,
	EPrimalCharacterStatusValue__Oxygen = 3,
	EPrimalCharacterStatusValue__Food = 4,
	EPrimalCharacterStatusValue__Water = 5,
	EPrimalCharacterStatusValue__Temperature = 6,
	EPrimalCharacterStatusValue__Weight = 7,
	EPrimalCharacterStatusValue__MeleeDamageMultiplier = 8,
	EPrimalCharacterStatusValue__SpeedMultiplier = 9,
	EPrimalCharacterStatusValue__TemperatureFortitude = 10,
	EPrimalCharacterStatusValue__CraftingSpeedMultiplier = 11,
	EPrimalCharacterStatusValue__MAX = 12,
	EPrimalCharacterStatusValue__EPrimalCharacterStatusValue_MAX = 13
};


// Enum ShooterGame.EChatMessageType
enum class EChatMessageType : uint8_t
{
	EChatMessageType__MyMessage    = 0,
	EChatMessageType__SameTeamMessage = 1,
	EChatMessageType__DifferentTeamMessage = 2,
	EChatMessageType__SystemWideMessage = 3,
	EChatMessageType__SameAllianceMessage = 4,
	EChatMessageType__MAX          = 5,
	EChatMessageType__EChatMessageType_MAX = 6
};


// Enum ShooterGame.EChatType
enum class EChatType : uint8_t
{
	EChatType__GlobalChat          = 0,
	EChatType__ProximityChat       = 1,
	EChatType__RadioChat           = 2,
	EChatType__GlobalTribeChat     = 3,
	EChatType__AllianceChat        = 4,
	EChatType__MAX                 = 5,
	EChatType__EChatType_MAX       = 6
};


// Enum ShooterGame.EChatSendMode
enum class EChatSendMode : uint8_t
{
	EChatSendMode__GlobalChat      = 0,
	EChatSendMode__GlobalTribeChat = 1,
	EChatSendMode__LocalChat       = 2,
	EChatSendMode__AllianceChat    = 3,
	EChatSendMode__MAX             = 4,
	EChatSendMode__EChatSendMode_MAX = 5
};


// Enum ShooterGame.EShooterPhysMaterialType
enum class EShooterPhysMaterialType : uint8_t
{
	EShooterPhysMaterialType__Unknown = 0,
	EShooterPhysMaterialType__Concrete = 1,
	EShooterPhysMaterialType__Dirt = 2,
	EShooterPhysMaterialType__Water = 3,
	EShooterPhysMaterialType__Metal = 4,
	EShooterPhysMaterialType__Wood = 5,
	EShooterPhysMaterialType__Grass = 6,
	EShooterPhysMaterialType__Glass = 7,
	EShooterPhysMaterialType__Flesh = 8,
	EShooterPhysMaterialType__Leaves = 9,
	EShooterPhysMaterialType__Rock = 10,
	EShooterPhysMaterialType__Sand = 11,
	EShooterPhysMaterialType__Snow = 12,
	EShooterPhysMaterialType__Corruption = 13,
	EShooterPhysMaterialType__MAX  = 14,
	EShooterPhysMaterialType__EShooterPhysMaterialType_MAX = 15
};


// Enum ShooterGame.EPlayerActionIndex
enum class EPlayerActionIndex : uint8_t
{
	EPlayerActionIndex__None       = 0,
	EPlayerActionIndex__WhistleFollow = 1,
	EPlayerActionIndex__WhistleFollowOne = 2,
	EPlayerActionIndex__WhistleStop = 3,
	EPlayerActionIndex__WhistleStopOne = 4,
	EPlayerActionIndex__WhistleAggressive = 5,
	EPlayerActionIndex__WhistleNeutral = 6,
	EPlayerActionIndex__WhistlePassive = 7,
	EPlayerActionIndex__WhistleAttackTarget = 8,
	EPlayerActionIndex__WhistleLandFlyerOne = 9,
	EPlayerActionIndex__ShowInventory = 10,
	EPlayerActionIndex__ShowCraftables = 11,
	EPlayerActionIndex__ShowTribeManager = 12,
	EPlayerActionIndex__Poop       = 13,
	EPlayerActionIndex__ShowEmoteSelection = 14,
	EPlayerActionIndex__Emote_HatSwitch = 15,
	EPlayerActionIndex__Emote_Salute = 16,
	EPlayerActionIndex__Emote_Sorry = 17,
	EPlayerActionIndex__Emote_Thank = 18,
	EPlayerActionIndex__Emote_Wave = 19,
	EPlayerActionIndex__Emote_Laugh = 20,
	EPlayerActionIndex__Emote_Yes  = 21,
	EPlayerActionIndex__Emote_No   = 22,
	EPlayerActionIndex__Emote_Taunt = 23,
	EPlayerActionIndex__Emote_Cheer = 24,
	EPlayerActionIndex__Emote_FriendlyLowerHands = 25,
	EPlayerActionIndex__Emote_MAX  = 26,
	EPlayerActionIndex__EPlayerActionIndex_MAX = 27
};


// Enum ShooterGame.ESimpleCurve
enum class ESimpleCurve : uint8_t
{
	ESimpleCurve__Linear           = 0,
	ESimpleCurve__Pow0             = 1,
	ESimpleCurve__Pow1             = 2,
	ESimpleCurve__Pow101           = 3,
	ESimpleCurve__Pow2             = 4,
	ESimpleCurve__Pow201           = 5,
	ESimpleCurve__Pow3             = 6,
	ESimpleCurve__Pow301           = 7,
	ESimpleCurve__PowCos0          = 8,
	ESimpleCurve__PowCos1          = 9,
	ESimpleCurve__PowCos101        = 10,
	ESimpleCurve__PowCos2          = 11,
	ESimpleCurve__PowCos201        = 12,
	ESimpleCurve__PowCos3          = 13,
	ESimpleCurve__PowCos301        = 14,
	ESimpleCurve__PowSin0          = 15,
	ESimpleCurve__PowSin1          = 16,
	ESimpleCurve__PowSin101        = 17,
	ESimpleCurve__PowSin2          = 18,
	ESimpleCurve__PowSin201        = 19,
	ESimpleCurve__PowSin3          = 20,
	ESimpleCurve__PowSin301        = 21,
	ESimpleCurve__PowMinCos0       = 22,
	ESimpleCurve__PowMinCos1       = 23,
	ESimpleCurve__PowMinCos101     = 24,
	ESimpleCurve__PowMinCos2       = 25,
	ESimpleCurve__PowMinCos201     = 26,
	ESimpleCurve__PowMinCos3       = 27,
	ESimpleCurve__PowMinCos301     = 28,
	ESimpleCurve__PowMax0          = 29,
	ESimpleCurve__PowMax1          = 30,
	ESimpleCurve__PowMax101        = 31,
	ESimpleCurve__PowMax2          = 32,
	ESimpleCurve__PowMax201        = 33,
	ESimpleCurve__PowMax3          = 34,
	ESimpleCurve__PowMax301        = 35,
	ESimpleCurve__ESimpleCurve_MAX = 36
};


// Enum ShooterGame.EHUDElementType
enum class EHUDElementType : uint8_t
{
	EHUDElementType__Text          = 0,
	EHUDElementType__ProgressBar   = 1,
	EHUDElementType__Image         = 2,
	EHUDElementType__EHUDElementType_MAX = 3
};


// Enum ShooterGame.EHUDElementAnchorMode
enum class EHUDElementAnchorMode : uint8_t
{
	EHUDElementAnchorMode__Specified = 0,
	EHUDElementAnchorMode__QuickbarLeft = 1,
	EHUDElementAnchorMode__QuickbarRight = 2,
	EHUDElementAnchorMode__QuickbarTop = 3,
	EHUDElementAnchorMode__EHUDElementAnchorMode_MAX = 4
};


// Enum ShooterGame.EStencilAlliance
enum class EStencilAlliance : uint8_t
{
	EStencilAlliance__None         = 0,
	EStencilAlliance__Friendly     = 1,
	EStencilAlliance__NPC          = 2,
	EStencilAlliance__NPCFleeing   = 3,
	EStencilAlliance__Hostile      = 4,
	EStencilAlliance__Ally         = 5,
	EStencilAlliance__Element      = 6,
	EStencilAlliance__EStencilAlliance_MAX = 7
};


// Enum ShooterGame.PrimalGameData.EPrimalCharacterStatusState
enum class EPrimalCharacterStatusState : uint8_t
{
	EPrimalCharacterStatusState__Dead = 0,
	EPrimalCharacterStatusState__Winded = 1,
	EPrimalCharacterStatusState__Starvation = 2,
	EPrimalCharacterStatusState__Dehydration = 3,
	EPrimalCharacterStatusState__Suffocation = 4,
	EPrimalCharacterStatusState__Encumbered = 5,
	EPrimalCharacterStatusState__Hypothermia = 6,
	EPrimalCharacterStatusState__Hyperthermia = 7,
	EPrimalCharacterStatusState__Injured = 8,
	EPrimalCharacterStatusState__KnockedOut = 9,
	EPrimalCharacterStatusState__Sleeping = 10,
	EPrimalCharacterStatusState__Cold = 11,
	EPrimalCharacterStatusState__Hot = 12,
	EPrimalCharacterStatusState__Crafting = 13,
	EPrimalCharacterStatusState__MAX = 14,
	EPrimalCharacterStatusState__EPrimalCharacterStatusState_MAX = 15
};


// Enum ShooterGame.PrimalGameData.EPrimalConsumableType
enum class EPrimalConsumableType : uint8_t
{
	EPrimalConsumableType__Food    = 0,
	EPrimalConsumableType__Water   = 1,
	EPrimalConsumableType__Medicine = 2,
	EPrimalConsumableType__Other   = 3,
	EPrimalConsumableType__MAX     = 4,
	EPrimalConsumableType__EPrimalConsumableType_MAX = 5
};


// Enum ShooterGame.PrimalGameData.ELevelExperienceRampType
enum class ELevelExperienceRampType : uint8_t
{
	ELevelExperienceRampType__Player = 0,
	ELevelExperienceRampType__DinoEasy = 1,
	ELevelExperienceRampType__DinoMedium = 2,
	ELevelExperienceRampType__DinoHard = 3,
	ELevelExperienceRampType__MAX  = 4,
	ELevelExperienceRampType__ELevelExperienceRampType_MAX = 5
};


// Enum ShooterGame.PrimalGameData.EPrimalItemType
enum class EPrimalItemType : uint8_t
{
	EPrimalItemType__MiscConsumable = 0,
	EPrimalItemType__Equipment     = 1,
	EPrimalItemType__Weapon        = 2,
	EPrimalItemType__Ammo          = 3,
	EPrimalItemType__Structure     = 4,
	EPrimalItemType__Resource      = 5,
	EPrimalItemType__Skin          = 6,
	EPrimalItemType__WeaponAttachment = 7,
	EPrimalItemType__Artifact      = 8,
	EPrimalItemType__MAX           = 9,
	EPrimalItemType__EPrimalItemType_MAX = 10
};


// Enum ShooterGame.PrimalGameData.EPrimalCharacterInputType
enum class EPrimalCharacterInputType : uint8_t
{
	EPrimalCharacterInputType__PrimaryFire = 0,
	EPrimalCharacterInputType__Targeting = 1,
	EPrimalCharacterInputType__AltFire = 2,
	EPrimalCharacterInputType__SwitchWeapon = 3,
	EPrimalCharacterInputType__Reload = 4,
	EPrimalCharacterInputType__Crouch = 5,
	EPrimalCharacterInputType__Prone = 6,
	EPrimalCharacterInputType__CrouchProneToggle = 7,
	EPrimalCharacterInputType__SwitchMap = 8,
	EPrimalCharacterInputType__DinoAttack = 9,
	EPrimalCharacterInputType__EPrimalCharacterInputType_MAX = 10
};


// Enum ShooterGame.PrimalGameData.EPrimalItemStat
enum class EPrimalItemStat : uint8_t
{
	EPrimalItemStat__GenericQuality = 0,
	EPrimalItemStat__Armor         = 1,
	EPrimalItemStat__MaxDurability = 2,
	EPrimalItemStat__WeaponDamagePercent = 3,
	EPrimalItemStat__WeaponClipAmmo = 4,
	EPrimalItemStat__HypothermalInsulation = 5,
	EPrimalItemStat__Weight        = 6,
	EPrimalItemStat__HyperthermalInsulation = 7,
	EPrimalItemStat__MAX           = 8,
	EPrimalItemStat__EPrimalItemStat_MAX = 9
};


// Enum ShooterGame.PrimalGameData.EDinoTamedOrder
enum class EDinoTamedOrder : uint8_t
{
	EDinoTamedOrder__SetAggressionPassive = 0,
	EDinoTamedOrder__SetAggressionNeutral = 1,
	EDinoTamedOrder__SetAggressionAggressive = 2,
	EDinoTamedOrder__SetAggressionAttackTarget = 3,
	EDinoTamedOrder__ToggleFollowMe = 4,
	EDinoTamedOrder__FollowMe      = 5,
	EDinoTamedOrder__StopFollowing = 6,
	EDinoTamedOrder__CycleFollowDistance = 7,
	EDinoTamedOrder__SetAggressionPassiveFlee = 8,
	EDinoTamedOrder__LandingToMe   = 9,
	EDinoTamedOrder__MAX           = 10,
	EDinoTamedOrder__EDinoTamedOrder_MAX = 11
};


// Enum ShooterGame.PrimalGameData.EXPType
enum class EXPType : uint8_t
{
	EXPType__XP_GENERIC            = 0,
	EXPType__XP_KILL               = 1,
	EXPType__XP_HARVEST            = 2,
	EXPType__XP_CRAFT              = 3,
	EXPType__XP_SPECIAL            = 4,
	EXPType__XP_ALPHAKILL          = 5,
	EXPType__MAX                   = 6,
	EXPType__EXPType_MAX           = 7
};


// Enum ShooterGame.PrimalGameData.ETribeGroupPermission
enum class ETribeGroupPermission : uint8_t
{
	ETribeGroupPermission__STRUCTUREACTIVATE = 0,
	ETribeGroupPermission__INVENTORYACCESS = 1,
	ETribeGroupPermission__PET_ORDER = 2,
	ETribeGroupPermission__PET_RIDE = 3,
	ETribeGroupPermission__GENERAL_STRUCTUREDEMOLISH = 4,
	ETribeGroupPermission__GENERAL_STRUCTUREATTACHMENT = 5,
	ETribeGroupPermission__GENERAL_BUILDSTRUCTUREINRANGE = 6,
	ETribeGroupPermission__INVITEMEMBER = 7,
	ETribeGroupPermission__PROMOTEMEMBER = 8,
	ETribeGroupPermission__DEMOTEMEMBER = 9,
	ETribeGroupPermission__BANISHMEMBER = 10,
	ETribeGroupPermission__PET_UNCLAIM = 11,
	ETribeGroupPermission__ETribeGroupPermission_MAX = 12
};


// Enum ShooterGame.PrimalGameData.EBoneModifierType
enum class EBoneModifierType : uint8_t
{
	EBoneModifierType__HEAD        = 0,
	EBoneModifierType__NECK        = 1,
	EBoneModifierType__NECKLENGTH  = 2,
	EBoneModifierType__CHEST       = 3,
	EBoneModifierType__SHOULDERS   = 4,
	EBoneModifierType__ARMLENGTH   = 5,
	EBoneModifierType__UPPERARM    = 6,
	EBoneModifierType__LOWERARM    = 7,
	EBoneModifierType__HAND        = 8,
	EBoneModifierType__LEGLENGTH   = 9,
	EBoneModifierType__UPPERLEG    = 10,
	EBoneModifierType__LOWERLEG    = 11,
	EBoneModifierType__FOOT        = 12,
	EBoneModifierType__HIP         = 13,
	EBoneModifierType__TORSO       = 14,
	EBoneModifierType__UPPERFACESIZE = 15,
	EBoneModifierType__LOWERFACESIZE = 16,
	EBoneModifierType__TORSODEPTH  = 17,
	EBoneModifierType__HEADHEIGHT  = 18,
	EBoneModifierType__HEADWIDTH   = 19,
	EBoneModifierType__HEADDEPTH   = 20,
	EBoneModifierType__TORSOHEIGHT = 21,
	EBoneModifierType__MAX         = 22,
	EBoneModifierType__EBoneModifierType_MAX = 23
};


// Enum ShooterGame.PrimalGameData.EEngramGroup
enum class EEngramGroup : uint8_t
{
	EEngramGroup__UnusedSpacer     = 0,
	EEngramGroup__UnusedSpacer01   = 1,
	EEngramGroup__ARK_PRIME        = 2,
	EEngramGroup__UnusedSpacer02   = 3,
	EEngramGroup__ARK_SCORCHEDEARTH = 4,
	EEngramGroup__UnusedSpacer03   = 5,
	EEngramGroup__UnusedSpacer04   = 6,
	EEngramGroup__UnusedSpacer05   = 7,
	EEngramGroup__ARK_TEK          = 8,
	EEngramGroup__UnusedSpacer06   = 9,
	EEngramGroup__UnusedSpacer07   = 10,
	EEngramGroup__UnusedSpacer08   = 11,
	EEngramGroup__UnusedSpacer09   = 12,
	EEngramGroup__UnusedSpacer10   = 13,
	EEngramGroup__UnusedSpacer11   = 14,
	EEngramGroup__UnusedSpacer12   = 15,
	EEngramGroup__ARK_UNLEARNED    = 16,
	EEngramGroup__UnusedSpacer13   = 17,
	EEngramGroup__UnusedSpacer14   = 18,
	EEngramGroup__UnusedSpacer15   = 19,
	EEngramGroup__UnusedSpacer16   = 20,
	EEngramGroup__UnusedSpacer17   = 21,
	EEngramGroup__UnusedSpacer18   = 22,
	EEngramGroup__UnusedSpacer19   = 23,
	EEngramGroup__UnusedSpacer20   = 24,
	EEngramGroup__UnusedSpacer21   = 25,
	EEngramGroup__UnusedSpacer22   = 26,
	EEngramGroup__UnusedSpacer23   = 27,
	EEngramGroup__UnusedSpacer24   = 28,
	EEngramGroup__UnusedSpacer25   = 29,
	EEngramGroup__UnusedSpacer26   = 30,
	EEngramGroup__UnusedSpacer27   = 31,
	EEngramGroup__ARK_ABERRATION   = 32,
	EEngramGroup__UnusedSpacer28   = 33,
	EEngramGroup__UnusedSpacer29   = 34,
	EEngramGroup__UnusedSpacer30   = 35,
	EEngramGroup__UnusedSpacer31   = 36,
	EEngramGroup__UnusedSpacer32   = 37,
	EEngramGroup__UnusedSpacer33   = 38,
	EEngramGroup__UnusedSpacer34   = 39,
	EEngramGroup__UnusedSpacer35   = 40,
	EEngramGroup__UnusedSpacer36   = 41,
	EEngramGroup__UnusedSpacer37   = 42,
	EEngramGroup__UnusedSpacer38   = 43,
	EEngramGroup__UnusedSpacer39   = 44,
	EEngramGroup__UnusedSpacer40   = 45,
	EEngramGroup__UnusedSpacer41   = 46,
	EEngramGroup__UnusedSpacer42   = 47,
	EEngramGroup__UnusedSpacer43   = 48,
	EEngramGroup__UnusedSpacer44   = 49,
	EEngramGroup__UnusedSpacer45   = 50,
	EEngramGroup__UnusedSpacer46   = 51,
	EEngramGroup__UnusedSpacer47   = 52,
	EEngramGroup__UnusedSpacer48   = 53,
	EEngramGroup__UnusedSpacer49   = 54,
	EEngramGroup__UnusedSpacer50   = 55,
	EEngramGroup__UnusedSpacer51   = 56,
	EEngramGroup__UnusedSpacer52   = 57,
	EEngramGroup__UnusedSpacer53   = 58,
	EEngramGroup__UnusedSpacer54   = 59,
	EEngramGroup__UnusedSpacer55   = 60,
	EEngramGroup__UnusedSpacer56   = 61,
	EEngramGroup__UnusedSpacer57   = 62,
	EEngramGroup__UnusedSpacer58   = 63,
	EEngramGroup__ARK_EXTINCTION   = 64,
	EEngramGroup__MAX              = 65,
	EEngramGroup__EEngramGroup_MAX = 66
};


// Enum ShooterGame.PrimalInventoryComponent.EPrimalItemMessage
enum class EPrimalItemMessage : uint8_t
{
	EPrimalItemMessage__Broken     = 0,
	EPrimalItemMessage__Repaired   = 1,
	EPrimalItemMessage__MAX        = 2,
	EPrimalItemMessage__EPrimalItemMessage_MAX = 3
};


// Enum ShooterGame.ShooterPlayerController.EPrimalStatsValueTypes
enum class EPrimalStatsValueTypes : uint8_t
{
	EPrimalStatsValueTypes__TotalShots = 0,
	EPrimalStatsValueTypes__Misses = 1,
	EPrimalStatsValueTypes__HitsStructure = 2,
	EPrimalStatsValueTypes__HitsDinoBody = 3,
	EPrimalStatsValueTypes__HitsDinoCritical = 4,
	EPrimalStatsValueTypes__HitsPlayerBody = 5,
	EPrimalStatsValueTypes__HitsPlayerCritical = 6,
	EPrimalStatsValueTypes__MAX    = 7,
	EPrimalStatsValueTypes__EPrimalStatsValueTypes_MAX = 8
};


// Enum ShooterGame.BiomeZoneVolume.EBiomeZone
enum class EBiomeZone : uint8_t
{
	EBiomeZone__None               = 0,
	EBiomeZone__Beach              = 1,
	EBiomeZone__Canyon             = 2,
	EBiomeZone__River              = 3,
	EBiomeZone__Grassland          = 4,
	EBiomeZone__Swamp              = 5,
	EBiomeZone__Jungle             = 6,
	EBiomeZone__RedwoodForest      = 7,
	EBiomeZone__Mountain           = 8,
	EBiomeZone__Snow               = 9,
	EBiomeZone__Ocean              = 10,
	EBiomeZone__Lava               = 11,
	EBiomeZone__Surface            = 12,
	EBiomeZone__FertileChamber     = 13,
	EBiomeZone__BioluminescentChamber = 14,
	EBiomeZone__ElementChamber     = 15,
	EBiomeZone__Wasteland          = 16,
	EBiomeZone__EBiomeZone_MAX     = 17
};


// Enum ShooterGame.TerrainGenerator.EVoronoiBlendType
enum class EVoronoiBlendType : uint8_t
{
	EVoronoiBlendType__Flat        = 0,
	EVoronoiBlendType__Closest     = 1,
	EVoronoiBlendType__SecondClosest = 2,
	EVoronoiBlendType__Cellular    = 3,
	EVoronoiBlendType__Organic     = 4,
	EVoronoiBlendType__EVoronoiBlendType_MAX = 5
};


// Enum ShooterGame.DataListEntryButton_PrimalFolder.FolderWidgetType
enum class EFolderWidgetType : uint8_t
{
	FolderWidgetType__FWT_Back     = 0,
	FolderWidgetType__FWT_Folder   = 1,
	FolderWidgetType__FWT_CustomFolder = 2,
	FolderWidgetType__FWT_MAX      = 3
};


// Enum ShooterGame.FlockingBehavior.EBoidType
enum class EBoidType : uint8_t
{
	EBoidType__Follower            = 0,
	EBoidType__Leader              = 1,
	EBoidType__FreeAgent           = 2,
	EBoidType__EBoidType_MAX       = 3
};


// Enum ShooterGame.PrimalDinoCharacter.EBabyCuddleType
enum class EBabyCuddleType : uint8_t
{
	EBabyCuddleType__PET           = 0,
	EBabyCuddleType__FOOD          = 1,
	EBabyCuddleType__WALK          = 2,
	EBabyCuddleType__MAX           = 3,
	EBabyCuddleType__EBabyCuddleType_MAX = 4
};


// Enum ShooterGame.PrimalUI.ControlDirection
enum class EControlDirection : uint8_t
{
	None                           = 0,
	Up                             = 1,
	Down                           = 2,
	Left                           = 3,
	Right                          = 4,
	ControlDirection_MAX           = 5
};


// Enum ShooterGame.PrimalUI.HighlightStartingPoint
enum class EHighlightStartingPoint : uint8_t
{
	TopLeft                        = 0,
	Center                         = 1,
	HighlightStartingPoint_MAX     = 2
};


// Enum ShooterGame.PrimalClimbingSettings.EClimbingAnimationType
enum class EClimbingAnimationType : uint8_t
{
	EClimbingAnimationType__Up     = 0,
	EClimbingAnimationType__Down   = 1,
	EClimbingAnimationType__Right  = 2,
	EClimbingAnimationType__Left   = 3,
	EClimbingAnimationType__MeleeUp = 4,
	EClimbingAnimationType__MeleeRight = 5,
	EClimbingAnimationType__MeleeLeft = 6,
	EClimbingAnimationType__FinishUp = 7,
	EClimbingAnimationType__FinishDown = 8,
	EClimbingAnimationType__HangingFwd = 9,
	EClimbingAnimationType__HangingMelee = 10,
	EClimbingAnimationType__HangingFinishUp = 11,
	EClimbingAnimationType__HangingFinishDown = 12,
	EClimbingAnimationType__JumpUp = 13,
	EClimbingAnimationType__JumpUpRight = 14,
	EClimbingAnimationType__JumpUpLeft = 15,
	EClimbingAnimationType__SlideDown = 16,
	EClimbingAnimationType__AttachUp = 17,
	EClimbingAnimationType__AttachDown = 18,
	EClimbingAnimationType__AttachHangingUp = 19,
	EClimbingAnimationType__AttachHangingDown = 20,
	EClimbingAnimationType__FlipLeft = 21,
	EClimbingAnimationType__FlipRight = 22,
	EClimbingAnimationType__FlipUp = 23,
	EClimbingAnimationType__FlipDown = 24,
	EClimbingAnimationType__TurnUp = 25,
	EClimbingAnimationType__TurnDown = 26,
	EClimbingAnimationType__TurnRight = 27,
	EClimbingAnimationType__TurnLeft = 28,
	EClimbingAnimationType__OpenInventory = 29,
	EClimbingAnimationType__OpenInventoryHanging = 30,
	EClimbingAnimationType__QuakeFall = 31,
	EClimbingAnimationType__MAX    = 32,
	EClimbingAnimationType__EClimbingAnimationType_MAX = 33
};


// Enum ShooterGame.PrimalClimbingSettings.EClimbingType
enum class EClimbingType : uint8_t
{
	EClimbingType__None            = 0,
	EClimbingType__ClimbLook       = 1,
	EClimbingType__ClimbInput      = 2,
	EClimbingType__Slide           = 3,
	EClimbingType__MAX             = 4,
	EClimbingType__EClimbingType_MAX = 5
};


// Enum ShooterGame.PrimalClimbingSettings.EClimbingMode
enum class EClimbingMode : uint8_t
{
	EClimbingMode__None            = 0,
	EClimbingMode__Attached        = 1,
	EClimbingMode__Finalizing      = 2,
	EClimbingMode__MAX             = 3,
	EClimbingMode__EClimbingMode_MAX = 4
};


// Enum ShooterGame.PrimalStructureElevatorPlatform.EPrimalStructureElevatorState
enum class EPrimalStructureElevatorState : uint8_t
{
	PSLS_Down                      = 0,
	PSLS_Up                        = 1,
	PSLS_MAX                       = 2
};


// Enum ShooterGame.VictoryCore.EEditorMessageLogLevel
enum class EEditorMessageLogLevel : uint8_t
{
	EEditorMessageLogLevel__Error  = 0,
	EEditorMessageLogLevel__Warning = 1,
	EEditorMessageLogLevel__Info   = 2,
	EEditorMessageLogLevel__Success = 3,
	EEditorMessageLogLevel__EEditorMessageLogLevel_MAX = 4
};


// Enum ShooterGame.VictoryCore.EServerOctreeGroup
enum class EServerOctreeGroup : uint8_t
{
	EServerOctreeGroup__STASISCOMPONENTS = 0,
	EServerOctreeGroup__PLAYERPAWNS = 1,
	EServerOctreeGroup__DINOPAWNS  = 2,
	EServerOctreeGroup__PAWNS      = 3,
	EServerOctreeGroup__STRUCTURES = 4,
	EServerOctreeGroup__TARGETABLEACTORS = 5,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS = 6,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS_DORMANT = 7,
	EServerOctreeGroup__ALL_SPATIAL = 8,
	EServerOctreeGroup__THERMALSTRUCTURES = 9,
	EServerOctreeGroup__STRUCTURES_CORE = 10,
	EServerOctreeGroup__DINOPAWNS_TAMED = 11,
	EServerOctreeGroup__PLAYERS_AND_TAMED_DINOS = 12,
	EServerOctreeGroup__DINOFOODCONTAINER = 13,
	EServerOctreeGroup__GRENADES   = 14,
	EServerOctreeGroup__TREESAPTAPS = 15,
	EServerOctreeGroup__LARGEUNSTASISRANGE = 16,
	EServerOctreeGroup__TRAPS      = 17,
	EServerOctreeGroup__MAX        = 18,
	EServerOctreeGroup__EServerOctreeGroup_MAX = 19
};


// Enum ShooterGame.StructuresPlus.EGlassTransparencyType
enum class EGlassTransparencyType : uint8_t
{
	EGlassTransparencyType__TwoWay = 0,
	EGlassTransparencyType__OneWayA = 1,
	EGlassTransparencyType__OneWayB = 2,
	EGlassTransparencyType__Opaque = 3,
	EGlassTransparencyType__EGlassTransparencyType_MAX = 4
};


// Enum ShooterGame.StructuresPlus.ESPMessageType
enum class ESPMessageType : uint8_t
{
	ESPMessageType__Default        = 0,
	ESPMessageType__Error          = 1,
	ESPMessageType__Warning        = 2,
	ESPMessageType__Helpful        = 3,
	ESPMessageType__ESPMessageType_MAX = 4
};


// Enum ShooterGame.ContextMenuItem.UContextMenuItemSwitchMode
enum class EUContextMenuItemSwitchMode : uint8_t
{
	UContextMenuItemSwitchMode__None = 0,
	UContextMenuItemSwitchMode__Radio = 1,
	UContextMenuItemSwitchMode__Checkbox = 2,
	UContextMenuItemSwitchMode__UContextMenuItemSwitchMode_MAX = 3
};


// Enum ShooterGame.PrimalStructurePlacer.EPrimalStructurePlacerState
enum class EPrimalStructurePlacerState : uint8_t
{
	EPrimalStructurePlacerState__Default = 0,
	EPrimalStructurePlacerState__FadeAway = 1,
	EPrimalStructurePlacerState__PlacingStructure = 2,
	EPrimalStructurePlacerState__EPrimalStructurePlacerState_MAX = 3
};


// Enum ShooterGame.PrimalStructureItemContainer_CropPlot.ESeedCropPhase
enum class ESeedCropPhase : uint8_t
{
	ESeedCropPhase__Seedling       = 0,
	ESeedCropPhase__Midling        = 1,
	ESeedCropPhase__Growthling     = 2,
	ESeedCropPhase__Fruiting       = 3,
	ESeedCropPhase__MAX            = 4,
	ESeedCropPhase__ESeedCropPhase_MAX = 5
};


// Enum ShooterGame.UI_Inventory.EDropItemIconAction
enum class EDropItemIconAction : uint8_t
{
	EDropItemIconAction__DA_NoAction = 0,
	EDropItemIconAction__DA_Equip  = 1,
	EDropItemIconAction__DA_UnEquip = 2,
	EDropItemIconAction__DA_AddToSlot = 3,
	EDropItemIconAction__DA_RemoveFromSlot = 4,
	EDropItemIconAction__DA_ToRemoteInv = 5,
	EDropItemIconAction__DA_FromRemoteInv = 6,
	EDropItemIconAction__DA_RemoteEquip = 7,
	EDropItemIconAction__DA_MergeItemStack = 8,
	EDropItemIconAction__DA_SplitItemStack = 9,
	EDropItemIconAction__DA_SwapItems = 10,
	EDropItemIconAction__DA_UseWithItem = 11,
	EDropItemIconAction__DA_UnEquipTransferToLocal = 12,
	EDropItemIconAction__DA_RemoveItemSkin = 13,
	EDropItemIconAction__DA_SplitItemStackOne = 14,
	EDropItemIconAction__DA_RemoveWeaponAmmo = 15,
	EDropItemIconAction__DA_FromRemoteInvToSlot = 16,
	EDropItemIconAction__DA_ToRemoteInvFromSlot = 17,
	EDropItemIconAction__DA_EquipLocalFromRemote = 18,
	EDropItemIconAction__DA_EquipRemoteFromLocal = 19,
	EDropItemIconAction__DA_UnequipRemote = 20,
	EDropItemIconAction__DA_UnequipTransferToRemote = 21,
	EDropItemIconAction__DA_ToArkInv = 22,
	EDropItemIconAction__DA_FromArkInv = 23,
	EDropItemIconAction__MAX       = 24,
	EDropItemIconAction__EDropItemIconAction_MAX = 25
};


// Enum ShooterGame.UI_Hub.EHubSubMenu
enum class EHubSubMenu : uint8_t
{
	EHubSubMenu__Inventory         = 0,
	EHubSubMenu__Engrams           = 1,
	EHubSubMenu__TribeManager      = 2,
	EHubSubMenu__TameGroups        = 3,
	EHubSubMenu__SurvivalProfile   = 4,
	EHubSubMenu__MAX               = 5,
	EHubSubMenu__EHubSubMenu_MAX   = 6
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusValueDefinition
// 0x0020
struct FPrimalCharacterStatusValueDefinition
{
	class UTexture2D*                                  StatusValueIcon;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      StatusValueName;                                          // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bLevelUpSetToMaxValue;                                    // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHideCurrentValue;                                 // 0x0019(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayAsPercent;                                        // 0x001A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x001B(0x0005) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusStateDefinition
// 0x0050
struct FPrimalCharacterStatusStateDefinition
{
	TEnumAsByte<EPrimalCharacterStatusValue>           StatusValueType;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                StatusValueThresholdIndex;                                // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  StatusStateIcon;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      StatusStateName;                                          // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      StatusStateDescription;                                   // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      StatusStateNameColor;                                     // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUsed;                                                    // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHUDMessage;                                       // 0x0035(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0036(0x0002) MISSED OFFSET
	class FString                                      HUDMessage;                                               // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      HUDMessageColor;                                          // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                BuffType;                                                 // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemStatDefinition
// 0x0018
struct FPrimalItemStatDefinition
{
	class UTexture2D*                                  ItemStatIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      ItemStatName;                                             // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemDefinition
// 0x0018
struct FPrimalItemDefinition
{
	class UTexture2D*                                  ItemTypeIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      ItemTypeName;                                             // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalEquipmentDefinition
// 0x0018
struct FPrimalEquipmentDefinition
{
	class UTexture2D*                                  EquipmentTypeIcon;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      EquipmentTypeName;                                        // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemQuality
// 0x0030
struct FPrimalItemQuality
{
	struct FLinearColor                                QualityColor;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      QualityName;                                              // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              QualityRandomMultiplierThreshold;                         // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CraftingXPMultiplier;                                     // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RepairingXPMultiplier;                                    // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CraftingResourceRequirementsMultiplier;                   // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.StatusValueModifierDescription
// 0x0050
struct FStatusValueModifierDescription
{
	class UTexture2D*                                  ModifierIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      ModifierName;                                             // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class FString                                      ModifierDescription;                                      // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      ModifierColor;                                            // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHUDMessage;                                       // 0x002C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	class FString                                      HUDMessage;                                               // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      HUDMessageColor;                                          // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPreventDrawingBuffDescription;                           // 0x0044(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	int                                                BuffType;                                                 // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.AppIDItem
// 0x0040
struct FAppIDItem
{
	class FString                                      AchievementID;                                            // 0x0000(0x0010) (Edit, ZeroConstructor)
	int                                                AppID;                                                    // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                PlayerBadgeGroup;                                         // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class FString>                              PlayerIDStrings;                                          // 0x0018(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      ItemClass;                                                // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              ItemClasses;                                              // 0x0030(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShooterGame.PrimalGameData.ColorDefinition
// 0x001C
struct FColorDefinition
{
	struct FName                                       ColorName;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ColorValue;                                               // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasOverridePriority;                                     // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.BoneModifierRange
// 0x003C
struct FBoneModifierRange
{
	struct FName                                       BoneName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MinScale;                                                 // 0x0008(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MaxScale;                                                 // 0x0014(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MinTranslation;                                           // 0x0020(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MaxTranslation;                                           // 0x002C(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               Recursive;                                                // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.BoneModifierRangeArray
// 0x0020
struct FBoneModifierRangeArray
{
	unsigned char                                      bAffectsLegLength : 1;                                    // 0x0000(0x0001) (Edit)
	unsigned char                                      bUseExtraMax : 1;                                         // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              MinLegLengthMultiplier;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxLegLengthMultiplier;                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FBoneModifierRange>                  BoneArray;                                                // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShooterGame.PrimalGameData.PlayerCharacterGenderDefinition
// 0x05F0
struct FPlayerCharacterGenderDefinition
{
	class FString                                      GenderString;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      CharacterBlueprint;                                       // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FLinearColor>                        ColorSetBody;                                             // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                        ColorSetHair;                                             // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                        ColorSetEyes;                                             // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                          CharacterPreviewMaterial;                                 // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class FString>                              DefaultCharacterNames;                                    // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      DefaultCharacterNameWeights;                              // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FBoneModifierRangeArray                     CharacterBoneModifierRanges[0x16];                        // 0x0070(0x0020) (Edit, DisableEditOnInstance)
	struct FBoneModifierRangeArray                     ExtraCharacterBoneModifierMax[0x16];                      // 0x0330(0x0020) (Edit, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.LevelExperienceRamp
// 0x0010
struct FLevelExperienceRamp
{
	TArray<float>                                      ExperiencePointsForLevel;                                 // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.NamedTeamDefinition
// 0x0080
struct FNamedTeamDefinition
{
	struct FName                                       TeamName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bTargetingTeamExclusionList : 1;                          // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bTargetingTeamInclusionList : 1;                          // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowTargetsOnOwnTeam : 1;                               // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsCarnivore : 1;                                         // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bTargetPlayersAndTamedOnly : 1;                           // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceTargetPlayersAndTamed : 1;                          // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIgnoredByAllTeams : 1;                                   // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	TArray<struct FName>                               TeamNameList;                                             // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               TargetingMultiplierTeamNames;                             // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontGiveDamageTeamList;                                   // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontReceiveDamageTeamList;                                // 0x0040(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               MaximumTargetableDistanceTeams;                           // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      MaximumTargetableDistances;                               // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      TargetingMultiplierTeamWeights;                           // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.ExplorerNoteAchievement
// 0x0020
struct FExplorerNoteAchievement
{
	class FString                                      AchievementName;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<int>                                        ExplorerNoteIndices;                                      // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemapping
// 0x0010
struct FClassRemapping
{
	class UClass*                                      FromClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ToClass;                                                  // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.ActiveEventSupplyCrateWeight
// 0x0028
struct FActiveEventSupplyCrateWeight
{
	TArray<class UClass*>                              ReplacementCrateClasses;                                  // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<float>                                      Weights;                                                  // 0x0010(0x0010) (Edit, ZeroConstructor)
	struct FName                                       ActiveEvent;                                              // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.ClassAddition
// 0x0018
struct FClassAddition
{
	class UClass*                                      ForClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              ClassAdditions;                                           // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShooterGame.PrimalGameData.BuffAddition
// 0x0018
struct FBuffAddition
{
	class UClass*                                      ForClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              BuffAdditions;                                            // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShooterGame.PrimalGameData.RandValueRange
// 0x000C
struct FRandValueRange
{
	float                                              MinVal;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxVal;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RandPower;                                                // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.DinoBabySetup
// 0x0038
struct FDinoBabySetup
{
	struct FName                                       DinoNameTag;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FBoneModifierRangeArray>             BabyBoneModifierRanges;                                   // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      WildRandomScaleRangeWeights;                              // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRandValueRange>                     WildRandomScaleRanges;                                    // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.MultiAchievement
// 0x0020
struct FMultiAchievement
{
	class FString                                      UnlockAchievement;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              RequiredAchievements;                                     // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemappingWeight
// 0x0038
struct FClassRemappingWeight
{
	class UClass*                                      FromClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              ToClasses;                                                // 0x0008(0x0010) (Edit, ZeroConstructor)
	TArray<float>                                      Weights;                                                  // 0x0018(0x0010) (Edit, ZeroConstructor)
	struct FName                                       ActiveEvent;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bExactMatch : 1;                                          // 0x0030(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCDifficultyLevelRange
// 0x0030
struct FNPCDifficultyLevelRange
{
	TArray<float>                                      EnemyLevelsMin;                                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      EnemyLevelsMax;                                           // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      GameDifficulties;                                         // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnEntry
// 0x0108
struct FNPCSpawnEntry
{
	class FString                                      AnEntryName;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              NPCsToSpawn;                                              // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                              NPCsToSpawnStrings;                                       // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemappingWeight>               NPCRandomSpawnClassWeights;                               // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                             NPCsSpawnOffsets;                                         // 0x0040(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCsToSpawnPercentageChance;                              // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMinLevelOffset;                                        // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMaxLevelOffset;                                        // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMinLevelMultiplier;                                    // 0x0080(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMaxLevelMultiplier;                                    // 0x0090(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      bAddLevelOffsetBeforeMultiplier : 1;                      // 0x00A0(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET
	TArray<unsigned char>                              NPCOverrideLevel;                                         // 0x00A8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                     ExtentCheck;                                              // 0x00B8(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     GroupSpawnOffset;                                         // 0x00C4(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EntryWeight;                                              // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ManualSpawnPointSpreadRadius;                             // 0x00D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WaterOnlySpawnMinimumWaterHeight;                         // 0x00D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaximumWaterHeight;                                       // 0x00DC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNPCDifficultyLevelRange>            NPCDifficultyLevelRanges;                                 // 0x00E0(0x0010) (Edit, ZeroConstructor)
	float                                              LevelDifficultyTestOverride;                              // 0x00F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromStructuresMultiplier;                 // 0x00F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromPlayersMultiplier;                    // 0x00F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromTamedDinosMultiplier;                 // 0x00FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandGroupSpawnOffsetZMin;                                 // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandGroupSpawnOffsetZMax;                                 // 0x0104(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnLimit
// 0x0020
struct FNPCSpawnLimit
{
	class UClass*                                      NPCClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class FString                                      NPCClassString;                                           // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              MaxPercentageOfDesiredNumToAllow;                         // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnEntriesContainerAdditions
// 0x0028
struct FNPCSpawnEntriesContainerAdditions
{
	class UClass*                                      SpawnEntriesContainerClass;                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNPCSpawnEntry>                      AdditionalNPCSpawnEntries;                                // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FNPCSpawnLimit>                      AdditionalNPCSpawnLimits;                                 // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.LocalizedSoundCueEntry
// 0x0018
struct FLocalizedSoundCueEntry
{
	class FString                                      TwoLetterISOLanguageName;                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class USoundCue*                                   LocalizedSoundCue;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShooterGame.PrimalGameData.ExplorerNoteEntry
// 0x0098
struct FExplorerNoteEntry
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	int                                                ExplorerNoteType;                                         // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsIsland : 1;                                            // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsScorchedEarth : 1;                                     // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsAberration : 1;                                        // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsExtinction : 1;                                        // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsGenesis1 : 1;                                          // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsDossier : 1;                                           // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDontRequireProximityToChest : 1;                         // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUnlockIgnorePopup : 1;                                   // 0x0008(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUnlockIgnoreSound : 1;                                   // 0x0009(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
	class FString                                      ExplorerNoteDescription;                                  // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       DossierTameableDinoNameTag;                               // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USkeletalMesh*                               ExplorerNoteMesh;                                         // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplorerNoteAnimBP;                                       // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FStringAssetReference                       ExplorerNoteTexture;                                      // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                                  ExplorerNoteIcon;                                         // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          ExplorerNoteIconMaterial;                                 // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
