#pragma once

// ARKSurvivalEvolved (318.14) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_BaseHumanAnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
// 0x36D4 (0x3A14 - 0x0340)
class UBaseHumanAnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FF86BF7749F8707B753C9BB28EAFD18E;// 0x0340(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7E40A9C34B033ED3910326AA03CB3619;// 0x03B0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BC50A0DA43AD743E02EB4AAF804610F6;// 0x03F0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7012E4B54B148CE3A995E686F37CC809;// 0x0418(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_246DAA3649BBD4D671329E8D23CFBE2F;// 0x0440(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_ECA1240C4E825464C51892886C9B0E01;// 0x0470(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F5B759D0427A53CAAECCA69A514A0DCA;// 0x04D0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A12208234EAEDE29677B6298056CF6AA;// 0x0530(0x0030)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7B689378459B5C9210868D93163A2190;      // 0x0560(0x0038)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_A44F9AD946BD5D4329353F94C7E62882;// 0x0598(0x00F8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_41AD558A4B0CA239C4AD7A86BECE9626;// 0x0690(0x0080)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_35D8FDC3431B16FDB1DACCB99536FDB9;      // 0x0710(0x0038)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D06984AD4E61567B30C1C6BDF00501D6;// 0x0748(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C026749542ABC46B549BA0AD6EB4028E;// 0x0788(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_39BC807841E70CF7638F968EA9542E85;// 0x07B0(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F06A6E5843CB7750E8C2499F7AAB80AB;// 0x0890(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0A07221C47150231CEBA05989E491256;// 0x0940(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_51543B044818AB1A255F0596B347A38D;// 0x0968(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EBB615BD44EB698C1739638EF44BCB66;// 0x0990(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91FBD3BD4D1E7128D7B64588393E75D3;// 0x09F0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_556DE73A4E707562E3B0BCA257FC1A27;// 0x0A20(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9470FDAD41F70F5BA32716BE8D952CA7;// 0x0A80(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FD650C904FC7EFA01587D289F46A8A4A;// 0x0AB0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7F8BE4174DFE9E650D76A5B1BF823AEC;// 0x0B10(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2AEFAA124DCB7F16C90E8D909CDB5B24;// 0x0B70(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1273F8674C895306B4D4AE9835B5C35F;// 0x0BA0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4E9CEFB24B5B73705706BCBC7D0741A7;// 0x0C80(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D0FB361A474C4BE436DBABB3E65F636B;// 0x0CE0(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0B13E4D948430A3E8F9179B2A1C2943E;// 0x0D10(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_98196DFD47748B539CE554BBAC11A3A9;      // 0x0DF0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A8C3C8C94B963398CEE00AB43DB4BE03;// 0x0E28(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13E6328D4D9F48B5B5DD78B8E6BDA169;// 0x0E88(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0770C9E145D642F327AC509B41736BE2;// 0x0EB8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D1E988554AC0373879F917AAC2FAB152;// 0x0F18(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F8CA1DE443D32EA9A5BA8BB8DA75D87D;// 0x0F78(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE54DB984677DE45E521B19B31528830;// 0x0FA8(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6A2A0AA446FBC982953778A257604003;// 0x0FD8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D13880D4A6D09B58D30E5B2F4FCE77C;// 0x1058(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2B0ADA04648B59DB2D4308ACD449F10;// 0x1088(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4DFC7C3845631E2ACE633AA0116D8063;// 0x10B8(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_0C5807324E4FFE1350123189D0EB70D3;      // 0x1118(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D0444806431E6DA64E9AE2AFF30C7469;      // 0x1150(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_842E80474F26231326E786B60EFC8268;// 0x1188(0x0060)
	struct FAnimNode_MultiFabrik                       AnimGraphNode_MultiFabrik_8DB78B7E43EC96574D4921A4797BC261;// 0x11E8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83FBBB054203DAD789F74BA165A2A0FB;// 0x1230(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2FC9F116491D1F07BF4292B85BBF0485;// 0x1290(0x0028)
	unsigned char                                      UnknownData00[0x8];                                       // 0x12B8(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E360668B4B335B9F46DC04BAD7B40E27;// 0x12C0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FB8A227148C9C2643271CCA82DC4A28B;// 0x1370(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9AA7006349FCCC455FE29CA7CFD903FF;// 0x13D0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B578714542788833DCA20C986B920B6F;// 0x1410(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A7A49ECD428AEA87C71CFE82D64A9B1F;// 0x14C0(0x0028)
	struct FAnimNode_MultiFabrik                       AnimGraphNode_MultiFabrik_AAAC4B3B4D9E680ECBD0A89CFDD6FD5E;// 0x14E8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1259B0864CAB794FFF5A90B2DB9DF5E9;// 0x1530(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A3C1E18F41B0CA30A783329B5B98124B;// 0x15E0(0x0028)
	unsigned char                                      UnknownData01[0x8];                                       // 0x1608(0x0008) MISSED OFFSET
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1D1B659E409CD38175382FB68A99254F;// 0x1610(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_570D0A6D4DA5357D12B4D58C23EE530B;// 0x16C0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8BD8916F4F22606B43ECD58383DC25C1;// 0x1770(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB267268447F16582E884BA2251AE17C;// 0x17A0(0x0030)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3381ECA747D2CAAEB84FD6A5FD737B94;      // 0x17D0(0x0038)
	struct FAnimNode_ModifyBones                       AnimGraphNode_ModifyBones_C8775B5F40BCE761F239F6BC0F0DD0B5;// 0x1808(0x0040)
	struct FAnimNode_ModifyBones                       AnimGraphNode_ModifyBones_166E88DE46032C4F5B6FFFA617DEC520;// 0x1848(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0DBC818447FFABF5EA50328FB851DFE3;// 0x1888(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E8D48D564DB4C3D18FACA4B797C27888;// 0x18E8(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_071B3810488EE2A6EBF46D871BC75696;// 0x1928(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7B60D41A4B1D3D8C1B5E7E8163B6F01F;// 0x1950(0x0060)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_628E1E24493CAE0F6E0C7C933ECE8445;// 0x19B0(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_97A82C3842DF6508811CBFABCBC37F83;// 0x1AA8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A87A27D846DF93556328108D19D0CC71;// 0x1AD0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_262954744E0D33CD773F5589CDAC9201;// 0x1B10(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B9966DA64A994892B9F194AF313B4AC7;// 0x1B38(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CD58F2714E34EB0E6A03519CBC94A608;// 0x1B60(0x0060)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_AF8F4F684BDDAA20E6C3E0944E287B38;// 0x1BC0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_062C2DF14D0525445947EF87B9F31549;// 0x1C20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4F4C6AA42EA3D8949909AACB5CC3B99;// 0x1C50(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1FDC6B264D2A0FC00A9E85BB74D97B22;// 0x1C80(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_40C015634D94E0B062AD3485F0BA60F9;// 0x1CB0(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C3AF1F7E4BB9F06F6A3F44A2389E8CBC;// 0x1D60(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2D0DC922479729B0C77590A0F58F68B5;// 0x1D88(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D00E36134486952B6FC683AF3C932862;// 0x1DB0(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_607375834F040FCEBFBC3084558B824D;// 0x1E10(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B9291E804A926E345C152AA622AA0C4B;      // 0x1E38(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8AD6961F48B4CA0A14FD6280AAD26940;// 0x1E70(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A9EB7FF14D5E7BB47D175DB8AA2E9159;// 0x1EC0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FEE9EE70477EF8B02DAA4F8D8826CB02;// 0x1F20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71229BFB4E2CC041F7977BB25425515C;// 0x1F60(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5EFB393E47EB1635EFA03094D84E02D4;// 0x1F90(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_69723AD14E54CA7D10FF7899256652E5;// 0x1FB8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E6B944074706C39D2C5988B0F2E15851;// 0x1FE0(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4C48BBF04523CA692532A4BDEB2454E0;// 0x2040(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65B98ADF4DA1AE5E28E38BB7F078ED98;// 0x2068(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_386841C24418D754C69826851579BF6E;// 0x20C8(0x0030)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_F37F6E364733EA96DE10549DB5DA7970;// 0x20F8(0x00F8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_853DBF524B4AC115C6FAE2A4A56A2027;// 0x21F0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_ECF503894797EA5708BAC0BD24F3BF37;// 0x2220(0x0060)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_88A6A0A94DDB7C022D4ED3A1541AAC52;// 0x2280(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C3603984EB7D8F6535AF2B1AB4EAD4C;// 0x22D0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_626584B448D31E19750278A0D43665CE;// 0x2300(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E543BFF8400546FB3C2AD2B38F70F440;// 0x2360(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1C5993A54AD38416F15F55AA113FE7FC;// 0x23A0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D6824F7041510B4D32D9C9973C35BE9C;// 0x23C8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E47FFB3B49405638F054698D19C62400;// 0x23F0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_72D41C584300B27EE2CD98B8596B1D79;// 0x2430(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F44C55F84D95F0FC5753D7B86929B85C;// 0x2458(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1446309548B37547CAEB58BB8D13FB8F;      // 0x2480(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5B5E0810457105C10E8C98A5E31974BA;// 0x24B8(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_677DF9E344C209C6246406A12725D46D;// 0x2538(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62479E3E4A0B46DC55941CB0E28F8AF4;// 0x2598(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5C58F9EB40CDC26D68D6139AD4E90390;// 0x25C8(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8EB8620449A66ADA12577BBFF9B4ADCB;// 0x2628(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CAB64D6A4C14B09E331CDD8CF0C06D93;// 0x2668(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CC2A571D470F7BA55B7A82A97F604E15;// 0x2690(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B0B97BF949F3214A7674FCAEF22BC30C;// 0x2710(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_249554A8478EE07718E0B9905D374600;// 0x2738(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9CB10E854FEDEB8E5EC466AA60B96CCB;// 0x2778(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61859A6C4805A3E2F81B9DA81098857F;// 0x27A0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CAEC392747DF89DBD8FFB5912F820BC6;// 0x27C8(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_BFC18780495FC1E930B25C95E47C30ED;// 0x2828(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3455BB9C400CBC5B7A51CD83101AEF8D;// 0x28A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_633B1D28478F11390676698B17E885AB;// 0x28D0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_32C9728C45557FA4B74BAE86BDED6E29;// 0x2900(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DFD72034478D9BAB85014FA918BCF985;// 0x2960(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FBF47479444057112D301CBD18C9C755;// 0x29C0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2075AA844949A18E0F908DAA62E732F7;// 0x2AA0(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3CB161A84BFCC1D4CCEAB1AB9124FE93;// 0x2AE0(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_07AAC19E447039D5C069DAA85FCE266D;// 0x2B40(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95B870CE4825FA520201D49324A81692;// 0x2B68(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9A8D334A4EF9C1EDB66680B897A86180;// 0x2B90(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_443F8BE5479884B6260C9F81AF0C3668;// 0x2BB8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC0A909746FE4BB532BCFBAAC945D78D;// 0x2C38(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_8CFCF04445465B4B76D012B41C09901A;      // 0x2C68(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F9CC3B374303EF6D580CDD889C8BC5D3;// 0x2C90(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CD304AF54F7DC29AEF5B8C8B6F2C3943;// 0x2CB8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_93E34FE54E7C22EA1DD64E87C8FB4E5A;// 0x2CE0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_15E6B7CD498CF377E011E1A34C03C867;// 0x2D20(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B2138A24429B78E50078F8808B996776;// 0x2D48(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_88DD6B524B5448A55E24DBBD3D552524;// 0x2D98(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1CB5D1B94C2F977DBE7457B1EF264198;// 0x2DF8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A332B39147025300B904799F757B7C68;// 0x2E38(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3C1775364E5F204F562106A240017EC4;// 0x2F18(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0DC160784A62D5968117D2957FA417FD;// 0x2FF8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8B507C824BCEB9733667DF8169CD402C;// 0x3058(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F68D3E2C44E2E38E5841B58EA67B564B;// 0x30B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_211758AA43C83DCE6A907F9352FC4DE5;// 0x30E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_939AFA5D49AE5F90D0AF6ABFC45543E3;// 0x3108(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C5E368E742EB49C723169EBE32ED7164;// 0x3130(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_32AAA0074945C4E14F5F678C7131DE39;// 0x31B0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F72FED93430DD09CF916FAB3BC15F278;// 0x3210(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D7D5120F4ADD23314A6899B777316B45;// 0x3240(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3F56F06147401793405D638AB564CD14;      // 0x3268(0x0038)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B2061EBD4897AD945C56D9B128215E51;// 0x32A0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1A1AA0AC4F5574DA6220318F21BB91D5;// 0x32C8(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_603DE793450ABC058EAC0C842A094D6A;// 0x3348(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1D9C4D994A046559484601840F16784A;// 0x33A8(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C975FA4438E49D37296769160225C14;// 0x33D0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_24D6F0A045D17884EC333A93C92118D3;// 0x34B0(0x0060)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_B321878D41887BC8AE76B6B4FDA631D9;// 0x3510(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D57F4494F9F04210F96BCB3A520B16D;// 0x3570(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17E3268840C110C4CD693EB51C2D4C92;// 0x35A0(0x0030)
	unsigned char                                      PhysicsMode;                                              // 0x35D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSprinting;                                               // 0x35D1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bMoving;                                                  // 0x35D2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x35D3(0x0001) MISSED OFFSET
	float                                              Direction;                                                // 0x35D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimPitch;                                                 // 0x35D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimYaw;                                                   // 0x35DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RightLeft;                                                // 0x35E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForwardBack;                                              // 0x35E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    RootRotOffset;                                            // 0x35E8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTurning;                                                 // 0x35F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x35F5(0x0003) MISSED OFFSET
	float                                              TurnSpeed;                                                // 0x35F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCrouched;                                                // 0x35FC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bProne;                                                   // 0x35FD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x35FE(0x0002) MISSED OFFSET
	struct FVector                                     RootLocOffset;                                            // 0x3600(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementAnimRate;                                         // 0x360C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRiding;                                                // 0x3610(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x3611(0x0007) MISSED OFFSET
	class UAnimSequence*                               RidingAnimSeq;                                            // 0x3618(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               RidingMoveAnimSeq;                                        // 0x3620(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RidingDinoSpeedRatio;                                     // 0x3628(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRidingIsDinoMoving;                                      // 0x362C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBlinking;                                                // 0x362D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x362E(0x0002) MISSED OFFSET
	double                                             LastTimeSwimmingDouble;                                   // 0x3630(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsCarried;                                               // 0x3638(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAlternateAimOffset;                                   // 0x3639(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x363A(0x0002) MISSED OFFSET
	float                                              AimOffsetYawSpeed;                                        // 0x363C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsClimbing;                                              // 0x3640(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x3641(0x0003) MISSED OFFSET
	int                                                ClimbingInt;                                              // 0x3644(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementSpeedFastPower;                                   // 0x3648(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MovementSpeedFastStartPowerRatio;                         // 0x364C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CurrentAimPitchBlend;                                     // 0x3650(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTargetingAnim;                                        // 0x3654(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsTargeting;                                             // 0x3655(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisableAimInProne;                                       // 0x3656(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseBallistaAimOffset;                                    // 0x3657(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BallistaYaw;                                              // 0x3658(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LastLadderLocation;                                       // 0x365C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               AlternateStandingAnimSeq;                                 // 0x3668(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAlternateStandingAnim;                                // 0x3670(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x7];                                       // 0x3671(0x0007) MISSED OFFSET
	class UAnimSequence*                               AdditiveStandingAnimSeq;                                  // 0x3678(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AdditiveLoopAnimWeight;                                   // 0x3680(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAdditiveStandingAnim;                                 // 0x3684(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x3685(0x0003) MISSED OFFSET
	float                                              AdditiveStandingBlendIn;                                  // 0x3688(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AdditiveStandingBlendOut;                                 // 0x368C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AlternateStandingBlendIn;                                 // 0x3690(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AlternateStandingBlendOut;                                // 0x3694(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsCarriedAsPassenger;                                    // 0x3698(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x3699(0x0003) MISSED OFFSET
	float                                              AimOffsetAlpha;                                           // 0x369C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsGliding;                                               // 0x36A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData12[0x7];                                       // 0x36A1(0x0007) MISSED OFFSET
	class UAnimSequence*                               GlidingAnimSeq;                                           // 0x36A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUsingMountedWeapon;                                      // 0x36B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCharacterAdditiveAnimationIsNonAdditive;                 // 0x36B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAltBlendSpace_Falling;                                // 0x36B2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAltBlendSpace_Swimming;                               // 0x36B3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHasFistsEquipped;                                        // 0x36B4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HasValidClimbingTarget;                                   // 0x36B5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData13[0x2];                                       // 0x36B6(0x0002) MISSED OFFSET
	float                                              ClimbingFallingLeftRight;                                 // 0x36B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ClimbingFallingForwardBack;                               // 0x36BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsUsingGliderSuit;                                       // 0x36C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsUsingGliderSuit_Diving;                                // 0x36C1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData14[0x2];                                       // 0x36C2(0x0002) MISSED OFFSET
	float                                              GliderSuit_LeftRight;                                     // 0x36C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GliderSuit_UpDown;                                        // 0x36C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RequiredGlidingRotaitonDeltaToPlayTurnAnims;              // 0x36CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GliderSuitTurnInterpSpeed;                                // 0x36D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    GliderSuit_RemoteClientDesiredRotation;                   // 0x36D4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bClimbingPickDefaultBackToFallingBlends;                  // 0x36E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData15[0x7];                                       // 0x36E1(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    NewEventDispatcher;                                       // 0x36E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	class UBlendSpace*                                 OverrideBlendSpace;                                       // 0x36F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class APrimalCharacter*                            primalChar;                                               // 0x3700(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	int                                                IdleAnimIndex;                                            // 0x3708(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x370C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x370D(0x0003) MISSED OFFSET
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x3710(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Percent_FloatFloat_ReturnValue;                  // 0x3714(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x3718(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x3719(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x6];                                       // 0x371A(0x0006) MISSED OFFSET
	class APawn*                                       K2Node_CustomEvent_PawnOwner;                             // 0x3720(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_CustomEvent_DeltaTime;                             // 0x3728(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_CustomEvent_RootLocationOffset;                    // 0x372C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalBotCharacter*                         K2Node_DynamicCast_AsPrimalBotCharacter;                  // 0x3738(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x3740(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x7];                                       // 0x3741(0x0007) MISSED OFFSET
	class UAnimSequence*                               CallFunc_GetDinoRidingMoveAnimation_ReturnValue;          // 0x3748(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetDinoRidingAnimation_ReturnValue;              // 0x3750(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x3758(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x4];                                       // 0x375C(0x0004) MISSED OFFSET
	class APawn*                                       CallFunc_TryGetPawnOwner_ReturnValue;                     // 0x3760(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x3768(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x3770(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x7];                                       // 0x3771(0x0007) MISSED OFFSET
	class APrimalCharacter*                            K2Node_DynamicCast_AsPrimalCharacter;                     // 0x3778(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast3_CastSuccess;                          // 0x3780(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_GetAdditiveStandingAnimNonAdditive_ReturnValue;  // 0x3781(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x2];                                       // 0x3782(0x0002) MISSED OFFSET
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue;                 // 0x3784(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetVelocity_ReturnValue;                         // 0x3790(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_NegateRotator_ReturnValue;                       // 0x379C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_Conv_VectorToRotator_ReturnValue;                // 0x37A8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetAimOffsets_RootRotOffset;                     // 0x37B4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAimOffsets_TheRootYawSpeed;                   // 0x37C0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetAimOffsets_RootLocOffset;                     // 0x37C4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_GetAimOffsets_ReturnValue;                       // 0x37D0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FRotator                                    CallFunc_ComposeRotators_ReturnValue;                     // 0x37DC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Pitch;                                  // 0x37E8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw;                                    // 0x37EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll;                                   // 0x37F0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetForwardVector_ReturnValue;                    // 0x37F4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x3800(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x3804(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x3808(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x380C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x3810(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue3;                // 0x3814(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue;                      // 0x3818(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue2;                     // 0x381C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue4;                // 0x3820(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x3824(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue3;                     // 0x3828(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue5;                // 0x382C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue4;                     // 0x3830(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Pitch2;                                 // 0x3834(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Yaw2;                                   // 0x3838(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRot_Roll2;                                  // 0x383C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Subtract_FloatFloat_ReturnValue;                 // 0x3840(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_GreaterEqual_FloatFloat_ReturnValue;             // 0x3844(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x3];                                       // 0x3845(0x0003) MISSED OFFSET
	float                                              CallFunc_Abs_ReturnValue;                                 // 0x3848(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue3;                  // 0x384C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x3850(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x3851(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x3852(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x5];                                       // 0x3853(0x0005) MISSED OFFSET
	class UPawnMovementComponent*                      CallFunc_GetMovementComponent_ReturnValue;                // 0x3858(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x3860(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData24[0x3];                                       // 0x3861(0x0003) MISSED OFFSET
	struct FVector2D                                   CallFunc_Conv_VectorToVector2D_ReturnValue;               // 0x3864(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x4];                                       // 0x386C(0x0004) MISSED OFFSET
	class UCharacterMovementComponent*                 K2Node_DynamicCast_AsCharacterMovementComponent;          // 0x3870(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast4_CastSuccess;                          // 0x3878(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData26[0x3];                                       // 0x3879(0x0003) MISSED OFFSET
	float                                              CallFunc_VSize2D_ReturnValue;                             // 0x387C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x3880(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x3881(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x3882(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue2;                // 0x3883(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue3;                // 0x3884(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData27[0x3];                                       // 0x3885(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAdditiveStandingAnim_OutBlendInTime;          // 0x3888(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAdditiveStandingAnim_OutBlendOutTime;         // 0x388C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetAdditiveStandingAnim_ReturnValue;             // 0x3890(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAlternateStandingAnim_OutBlendInTime;         // 0x3898(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAlternateStandingAnim_OutBlendOutTime;        // 0x389C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetAlternateStandingAnim_ReturnValue;            // 0x38A0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetCharSequenceNew_AnimSeqOut;                   // 0x38A8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetCharSequenceNew_AnimSeqOut2;                  // 0x38B0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_UseAdditiveStandingAnim_ReturnValue;             // 0x38B8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_UseAlternateStandingAnim_ReturnValue;            // 0x38B9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_UseAltAimOffsetAnim_ReturnValue;                 // 0x38BA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData28[0x5];                                       // 0x38BB(0x0005) MISSED OFFSET
	class UAnimSequence*                               CallFunc_GetDinoRidingMoveAnimation_ReturnValue2;         // 0x38C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetCharSequenceNew_AnimSeqOut3;                  // 0x38C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetDinoRidingAnimation_ReturnValue2;             // 0x38D0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UAnimSequence*                               CallFunc_GetCharSequenceNew_AnimSeqOut4;                  // 0x38D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x38E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData29[0x3];                                       // 0x38E1(0x0003) MISSED OFFSET
	float                                              CallFunc_GetRidingDinoAnimSpeedRatio_ReturnValue;         // 0x38E4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetDefaultMovementSpeed_ReturnValue;             // 0x38E8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue4;                  // 0x38EC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue2;                            // 0x38F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue3;                            // 0x38F1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue4;                            // 0x38F2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x38F3(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetVelocity_ReturnValue2;                        // 0x38F4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UPawnMovementComponent*                      CallFunc_GetMovementComponent_ReturnValue2;               // 0x3900(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X2;                                  // 0x3908(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x390C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x3910(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData30[0x4];                                       // 0x3914(0x0004) MISSED OFFSET
	class UCharacterMovementComponent*                 K2Node_DynamicCast_AsCharacterMovementComponent2;         // 0x3918(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast5_CastSuccess;                          // 0x3920(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x3921(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue4;                // 0x3922(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x3923(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue5;                            // 0x3924(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BPIsA_ReturnValue;                               // 0x3925(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsCurrentPassengerLimitCameraYaw_ReturnValue;    // 0x3926(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
