#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_TheIsland_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass TheIsland.TheIsland_C
// 0x0C18 (0x1088 - 0x0470)
class ATheIsland_C : public ALevelScriptActor
{
public:
	bool                                               bIsRaining;                                               // 0x0470(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0471(0x0007) MISSED OFFSET
	class UParticleSystemComponent*                    RainParticles;                                            // 0x0478(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bInCave;                                                  // 0x0480(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWeatherEnabled;                                          // 0x0481(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsUnderwater;                                            // 0x0482(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0483(0x0005) MISSED OFFSET
	class UParticleSystemComponent*                    UnderwaterParticles;                                      // 0x0488(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsPlayerIndoors;                                         // 0x0490(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRiverWater;                                            // 0x0491(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x0492(0x0006) MISSED OFFSET
	class UParticleSystemComponent*                    RiverParticles;                                           // 0x0498(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UClass*>                              DefaultRefs;                                              // 0x04A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                             RainVFXTemplate;                                          // 0x04B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             WaterVFXTemplate;                                         // 0x04B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsInSnowBiome;                                           // 0x04C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x04C1(0x0007) MISSED OFFSET
	class UParticleSystem*                             LastRainVFXTemplate;                                      // 0x04C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsRainEnabled;                                           // 0x04D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x04D1(0x0007) MISSED OFFSET
	TArray<class UClass*>                              ExtraRefs;                                                // 0x04D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int                                                RefCount;                                                 // 0x04E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x04EC(0x0004) MISSED OFFSET
	class UMaterialInterface*                          NullMat;                                                  // 0x04F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentTekCaveDifficulty;                                 // 0x04F8(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Temp_int_Loop_Counter_Variable;                           // 0x04FC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                CallFunc_Add_IntInt_ReturnValue;                          // 0x0500(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_RandomFloatInRange_ReturnValue;                  // 0x0504(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_IsClosed_Variable;                              // 0x0508(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0509(0x0003) MISSED OFFSET
	float                                              CallFunc_RandomFloatInRange_ReturnValue2;                 // 0x050C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APlayerCameraManager*                        CallFunc_GetPlayerCameraManager_ReturnValue;              // 0x0510(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaSeconds;                                // 0x0518(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Add_VectorVector_ReturnValue;                    // 0x051C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                CallFunc_RandomInteger_ReturnValue;                       // 0x0528(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_SwitchInteger_CmpSuccess;                          // 0x052C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x052D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x052E(0x0002) MISSED OFFSET
	class FString                                      CallFunc_Conv_FloatToString_ReturnValue;                  // 0x0530(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	class FString                                      CallFunc_Concat_StrStr_ReturnValue;                       // 0x0540(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	class APlayerController*                           K2Node_ActorBoundEvent_Controller138;                     // 0x0550(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer138;               // 0x0558(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0559(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller137;                     // 0x0560(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer137;               // 0x0568(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Has_Been_Initd_Variable;                        // 0x0569(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsDedicatedServer_ReturnValue;                   // 0x056A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x1];                                       // 0x056B(0x0001) MISSED OFFSET
	float                                              CallFunc_RandomFloatInRange_ReturnValue3;                 // 0x056C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	TArray<float>                                      K2Node_MakeArray_Array;                                   // 0x0570(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	class APlayerController*                           K2Node_ActorBoundEvent_Controller136;                     // 0x0580(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer136;               // 0x0588(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x7];                                       // 0x0589(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller135;                     // 0x0590(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer135;               // 0x0598(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0599(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsDedicatedServer_ReturnValue2;                  // 0x059A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x5];                                       // 0x059B(0x0005) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller134;                     // 0x05A0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer134;               // 0x05A8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x7];                                       // 0x05A9(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller133;                     // 0x05B0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer133;               // 0x05B8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x7];                                       // 0x05B9(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller132;                     // 0x05C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer132;               // 0x05C8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x7];                                       // 0x05C9(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller131;                     // 0x05D0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer131;               // 0x05D8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable;// 0x05D9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x6];                                       // 0x05DA(0x0006) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller130;                     // 0x05E0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer130;               // 0x05E8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x7];                                       // 0x05E9(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller129;                     // 0x05F0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer129;               // 0x05F8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x7];                                       // 0x05F9(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller128;                     // 0x0600(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer128;               // 0x0608(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData18[0x7];                                       // 0x0609(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller127;                     // 0x0610(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer127;               // 0x0618(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData19[0x7];                                       // 0x0619(0x0007) MISSED OFFSET
	class APlayerCameraManager*                        CallFunc_GetPlayerCameraManager_ReturnValue2;             // 0x0620(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Add_VectorVector_ReturnValue2;                   // 0x0628(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_ObjectObject_ReturnValue;               // 0x0634(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ObjectObject_ReturnValue;             // 0x0635(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsDedicatedServer_ReturnValue3;                  // 0x0636(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x1];                                       // 0x0637(0x0001) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller126;                     // 0x0638(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer126;               // 0x0640(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x7];                                       // 0x0641(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller125;                     // 0x0648(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer125;               // 0x0650(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData22[0x7];                                       // 0x0651(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller124;                     // 0x0658(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer124;               // 0x0660(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData23[0x7];                                       // 0x0661(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller123;                     // 0x0668(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer123;               // 0x0670(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData24[0x7];                                       // 0x0671(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller122;                     // 0x0678(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer122;               // 0x0680(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x7];                                       // 0x0681(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller121;                     // 0x0688(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer121;               // 0x0690(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData26[0x7];                                       // 0x0691(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller120;                     // 0x0698(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer120;               // 0x06A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData27[0x7];                                       // 0x06A1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller119;                     // 0x06A8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer119;               // 0x06B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData28[0x7];                                       // 0x06B1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller118;                     // 0x06B8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer118;               // 0x06C0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData29[0x7];                                       // 0x06C1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller117;                     // 0x06C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer117;               // 0x06D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData30[0x7];                                       // 0x06D1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller116;                     // 0x06D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer116;               // 0x06E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData31[0x7];                                       // 0x06E1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller115;                     // 0x06E8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer115;               // 0x06F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData32[0x7];                                       // 0x06F1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller114;                     // 0x06F8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer114;               // 0x0700(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData33[0x7];                                       // 0x0701(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller113;                     // 0x0708(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer113;               // 0x0710(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData34[0x7];                                       // 0x0711(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller112;                     // 0x0718(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer112;               // 0x0720(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData35[0x7];                                       // 0x0721(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller111;                     // 0x0728(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer111;               // 0x0730(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData36[0x7];                                       // 0x0731(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller110;                     // 0x0738(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer110;               // 0x0740(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData37[0x7];                                       // 0x0741(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller109;                     // 0x0748(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer109;               // 0x0750(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData38[0x7];                                       // 0x0751(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller108;                     // 0x0758(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer108;               // 0x0760(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData39[0x7];                                       // 0x0761(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller107;                     // 0x0768(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer107;               // 0x0770(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData40[0x7];                                       // 0x0771(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller106;                     // 0x0778(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer106;               // 0x0780(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData41[0x7];                                       // 0x0781(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller105;                     // 0x0788(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer105;               // 0x0790(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData42[0x7];                                       // 0x0791(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller104;                     // 0x0798(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer104;               // 0x07A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData43[0x7];                                       // 0x07A1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller103;                     // 0x07A8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer103;               // 0x07B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData44[0x7];                                       // 0x07B1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller102;                     // 0x07B8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer102;               // 0x07C0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData45[0x7];                                       // 0x07C1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller101;                     // 0x07C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer101;               // 0x07D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData46[0x7];                                       // 0x07D1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller100;                     // 0x07D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer100;               // 0x07E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData47[0x7];                                       // 0x07E1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller99;                      // 0x07E8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer99;                // 0x07F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData48[0x7];                                       // 0x07F1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller98;                      // 0x07F8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer98;                // 0x0800(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData49[0x7];                                       // 0x0801(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller97;                      // 0x0808(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer97;                // 0x0810(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData50[0x7];                                       // 0x0811(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller96;                      // 0x0818(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer96;                // 0x0820(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData51[0x7];                                       // 0x0821(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller95;                      // 0x0828(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer95;                // 0x0830(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData52[0x7];                                       // 0x0831(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller94;                      // 0x0838(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer94;                // 0x0840(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData53[0x7];                                       // 0x0841(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller93;                      // 0x0848(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer93;                // 0x0850(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData54[0x7];                                       // 0x0851(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller92;                      // 0x0858(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer92;                // 0x0860(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData55[0x7];                                       // 0x0861(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller91;                      // 0x0868(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer91;                // 0x0870(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData56[0x7];                                       // 0x0871(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller90;                      // 0x0878(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer90;                // 0x0880(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData57[0x7];                                       // 0x0881(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller89;                      // 0x0888(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer89;                // 0x0890(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData58[0x7];                                       // 0x0891(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller88;                      // 0x0898(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer88;                // 0x08A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData59[0x7];                                       // 0x08A1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller87;                      // 0x08A8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer87;                // 0x08B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData60[0x7];                                       // 0x08B1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller86;                      // 0x08B8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer86;                // 0x08C0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData61[0x7];                                       // 0x08C1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller85;                      // 0x08C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer85;                // 0x08D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData62[0x7];                                       // 0x08D1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller84;                      // 0x08D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer84;                // 0x08E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData63[0x7];                                       // 0x08E1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller83;                      // 0x08E8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer83;                // 0x08F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData64[0x7];                                       // 0x08F1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller82;                      // 0x08F8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer82;                // 0x0900(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData65[0x7];                                       // 0x0901(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller81;                      // 0x0908(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer81;                // 0x0910(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData66[0x7];                                       // 0x0911(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller80;                      // 0x0918(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer80;                // 0x0920(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData67[0x7];                                       // 0x0921(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller79;                      // 0x0928(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer79;                // 0x0930(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData68[0x7];                                       // 0x0931(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller78;                      // 0x0938(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer78;                // 0x0940(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData69[0x7];                                       // 0x0941(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller77;                      // 0x0948(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer77;                // 0x0950(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData70[0x7];                                       // 0x0951(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller76;                      // 0x0958(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer76;                // 0x0960(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData71[0x7];                                       // 0x0961(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller75;                      // 0x0968(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer75;                // 0x0970(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData72[0x7];                                       // 0x0971(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller74;                      // 0x0978(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer74;                // 0x0980(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData73[0x7];                                       // 0x0981(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller73;                      // 0x0988(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer73;                // 0x0990(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData74[0x7];                                       // 0x0991(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller72;                      // 0x0998(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer72;                // 0x09A0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData75[0x7];                                       // 0x09A1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller71;                      // 0x09A8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer71;                // 0x09B0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData76[0x7];                                       // 0x09B1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller70;                      // 0x09B8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer70;                // 0x09C0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData77[0x7];                                       // 0x09C1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller69;                      // 0x09C8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer69;                // 0x09D0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData78[0x7];                                       // 0x09D1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller68;                      // 0x09D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer68;                // 0x09E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData79[0x7];                                       // 0x09E1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller67;                      // 0x09E8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer67;                // 0x09F0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData80[0x7];                                       // 0x09F1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller66;                      // 0x09F8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer66;                // 0x0A00(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData81[0x7];                                       // 0x0A01(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller65;                      // 0x0A08(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer65;                // 0x0A10(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData82[0x7];                                       // 0x0A11(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller64;                      // 0x0A18(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer64;                // 0x0A20(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData83[0x7];                                       // 0x0A21(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller63;                      // 0x0A28(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer63;                // 0x0A30(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData84[0x7];                                       // 0x0A31(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller62;                      // 0x0A38(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer62;                // 0x0A40(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData85[0x7];                                       // 0x0A41(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller61;                      // 0x0A48(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer61;                // 0x0A50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData86[0x7];                                       // 0x0A51(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller60;                      // 0x0A58(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer60;                // 0x0A60(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData87[0x7];                                       // 0x0A61(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller59;                      // 0x0A68(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer59;                // 0x0A70(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData88[0x7];                                       // 0x0A71(0x0007) MISSED OFFSET
	class APlayerController*                           CallFunc_GetPlayerController_ReturnValue;                 // 0x0A78(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterPlayerController*                    K2Node_DynamicCast_AsShooterPlayerController;             // 0x0A80(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0A88(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0A89(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData89[0x6];                                       // 0x0A8A(0x0006) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPlayerCharacter_ReturnValue;                  // 0x0A90(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APlayerController*                           K2Node_ActorBoundEvent_Controller58;                      // 0x0A98(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer58;                // 0x0AA0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_ObjectObject_ReturnValue2;              // 0x0AA1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData90[0x6];                                       // 0x0AA2(0x0006) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller57;                      // 0x0AA8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer57;                // 0x0AB0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData91[0x7];                                       // 0x0AB1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller56;                      // 0x0AB8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer56;                // 0x0AC0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData92[0x7];                                       // 0x0AC1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller55;                      // 0x0AC8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer55;                // 0x0AD0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData93[0x7];                                       // 0x0AD1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller54;                      // 0x0AD8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer54;                // 0x0AE0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData94[0x7];                                       // 0x0AE1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller53;                      // 0x0AE8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer53;                // 0x0AF0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData95[0x7];                                       // 0x0AF1(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller52;                      // 0x0AF8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer52;                // 0x0B00(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData96[0x7];                                       // 0x0B01(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller51;                      // 0x0B08(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer51;                // 0x0B10(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData97[0x7];                                       // 0x0B11(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller50;                      // 0x0B18(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer50;                // 0x0B20(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData98[0x7];                                       // 0x0B21(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller49;                      // 0x0B28(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer49;                // 0x0B30(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData99[0x7];                                       // 0x0B31(0x0007) MISSED OFFSET
	class APlayerController*                           K2Node_ActorBoundEvent_Controller48;                      // 0x0B38(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_ActorBoundEvent_bIsPrimaryPlayer48;                // 0x0B40(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData100[0x7];                                      // 0x0B41(0x0007) MISSED OFFSET
