#pragma once

// ARKSurvivalEvolved (329.9) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_FPVMapGPSAnimBP_Base_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FPVMapGPSAnimBP_Base.FPVMapGPSAnimBP_Base_C
// 0x0958 (0x0C98 - 0x0340)
class UFPVMapGPSAnimBP_Base_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_92C33DB94AE42E615CA178B52C96381F;      // 0x0340(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8467A7B34970006200E181A60A787E1A;      // 0x0368(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AAD76DAC4111E1C8AE802E8F26608C6E;      // 0x03A0(0x0038)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_71D81FA4453DDC8B30570DA29785E127;      // 0x03D8(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A42688A74334AB1F35CBF18C5C58769F;// 0x0410(0x0080)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2269F22A4234AB0FE07B40A72D6D85CD;// 0x0490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_08AF22DA46003970A461128749A11F15;// 0x0510(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAE19FFD4899C9C243F548B39D8F27D2;// 0x0528(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77BCEC364353213817B9DF8A576E721F;// 0x0540(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_547CC58549F77D9E9D9BD5AC0332C707;// 0x0558(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14ACF88240F429CA4DE3439ABC12DB1E;// 0x0570(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9ECDA5C148069D085913059FB36268BE;// 0x0588(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD08C26F486D452C00585F843B0716A2;// 0x05A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA3E0FC74AD5124A57FA07B1A70423FB;// 0x05B8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_350DFC854342720CE5BF82BFE1395845;// 0x05D0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20C392EF44C258E4A3C806AEB3861190;// 0x0600(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBB828934431E1CC8AAF47BC54B26723;// 0x0628(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_110170744E6B852A2310709E424E8D69;// 0x0658(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_494BD34D48A1D157AEA817A5834481D9;// 0x0680(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4130975A45E9089A653A279A8A692B87;// 0x06B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F125C57940555B8111A34E85BFA1B3E2;// 0x06D8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E187C02A47B0C28B1E23A8A45BEECDE7;// 0x0708(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8DDC51094F138AE813692583426CC88A;// 0x0730(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_827174404A7012E3C44AD88C119026DE;// 0x0760(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D2423B4D4ADD3BE13152ADAC2CD8493A;// 0x0788(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEA7F918401C8648AE8250A68B5C452C;// 0x07E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F275C1214128F61DFB3279B626EFBE39;// 0x0800(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7839A1F943204DA9D26189B81D108C51;// 0x0818(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DCBE31A34953F26F8F8905A3C1D74BE8;// 0x0830(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8ABB7DD4627AB1E1BAD0FAAFA619292;// 0x0848(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_731F73444D606F03870433A2179EF44A;// 0x0860(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5961A454A3EA281CFCB8997E71BA272;// 0x0878(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E758020D472144D73CA75BB01C44B32F;// 0x0890(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA67D78E42B3A3C44C75D7A7EAFD97BC;// 0x08A8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F32D4CF04704F585A915E8B2D35EA1F0;// 0x08C0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C463379E4A057B71285BF6AA565DB9F7;// 0x08D8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A30AAAA64B873DC50AB224B96519328A;// 0x08F0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_785D31DC41D63D3B97EA128933B28D67;// 0x0908(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_352ABF16457B7F6291B4D1990BE5A767;// 0x0920(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C331171449138BC12F277B698898CC5;// 0x0938(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_605426964F362CC29321D6B214E51FF3;// 0x0950(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2985FDF6424F4369541FF4988955FAD8;// 0x0980(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7377C73F4F0F38E1EF9310A391D030F6;// 0x09A8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7775799248B687EFBE94E09F8BF572BA;// 0x09D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F93FBE154C8AC2AAA16D86ABC4CAF308;// 0x0A00(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_402DD8DD49F201EF4D23DE897629783B;// 0x0A30(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A4FEE8E4B4EC46EC5641C9981B2B7FD;// 0x0A58(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B54E08064C3E8B8C14944289661180E6;// 0x0A88(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2897829A48A7309CCB621D917FBED21D;// 0x0AB0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC98B15D4481D6384C2D29BB5FEF1ADC;// 0x0AE0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8E2686A84E875215F8C0BEB018493FF4;// 0x0B08(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2C8A5F1B4C2AB09810A9B6BAF158B18D;// 0x0B38(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_947C35394E96AC6DC5A747801ADFDAAF;// 0x0B60(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3B8671F34AE763231EAF6CBA6F260723;// 0x0B90(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AD6CFAEB4A33B1163725AF891911EF32;// 0x0BB8(0x0060)
	bool                                               IsRunning;                                                // 0x0C18(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShowingGPS;                                               // 0x0C19(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShowingMap;                                               // 0x0C1A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UseCompass;                                               // 0x0C1B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InTransition;                                             // 0x0C1C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0C1D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0C1E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x0C1F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x0C20(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue2;                          // 0x0C21(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x0C22(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x0C23(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue3;                          // 0x0C24(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x0C25(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue7;                        // 0x0C26(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue4;                          // 0x0C27(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue8;                        // 0x0C28(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue9;                        // 0x0C29(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x0C2A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue10;                       // 0x0C2B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x0C2C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue11;                       // 0x0C2D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x0C2E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue12;                       // 0x0C2F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x0C30(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue13;                       // 0x0C31(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x0C32(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue6;                         // 0x0C33(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue14;                       // 0x0C34(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue15;                       // 0x0C35(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue5;                          // 0x0C36(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue16;                       // 0x0C37(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue17;                       // 0x0C38(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue6;                          // 0x0C39(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0C3A(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x0C3C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x0C40(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterWeapon*                              K2Node_DynamicCast_AsShooterWeapon;                       // 0x0C48(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0C50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0C51(0x0007) MISSED OFFSET
	class APrimalWeaponGPS*                            K2Node_DynamicCast_AsPrimalWeaponGPS;                     // 0x0C58(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x0C60(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0C61(0x0007) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                        // 0x0C68(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x0C70(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast3_CastSuccess;                          // 0x0C78(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x0C79(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue18;                       // 0x0C7A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue7;                         // 0x0C7B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0C7C(0x0004) MISSED OFFSET
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue2;                     // 0x0C80(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class APrimalWeaponGPS*                            K2Node_DynamicCast_AsPrimalWeaponGPS2;                    // 0x0C88(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast4_CastSuccess;                          // 0x0C90(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue19;                       // 0x0C91(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_BoolBool_ReturnValue;                   // 0x0C92(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_BoolBool_ReturnValue2;                  // 0x0C93(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_BoolBool_ReturnValue3;                  // 0x0C94(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue7;                          // 0x0C95(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue8;                          // 0x0C96(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue8;                         // 0x0C97(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FPVMapGPSAnimBP_Base.FPVMapGPSAnimBP_Base_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1974();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1973();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1972();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1971();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1970();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1969();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1968();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1967();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1966();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1965();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1964();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1963();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1962();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1961();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1959();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1958();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1957();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1956();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1955();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1954();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1953();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_1952();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_FPVMapGPSAnimBP_Base(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
