#pragma once

// ARKSurvivalEvolved (332.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_SK_TekGrenadeLauncher_FPV_AnimBlueprint_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass SK_TekGrenadeLauncher_FPV_AnimBlueprint.SK_TekGrenadeLauncher_FPV_AnimBlueprint_C
// 0x0924 (0x0C64 - 0x0340)
class USK_TekGrenadeLauncher_FPV_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B7E5307C45AAFFB568CA24B215BEA114;      // 0x0340(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6168EAD3476EB4AA4D70AA8F76C0EC8D;// 0x0378(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B68C2684050D71515F4C3885ED19809;// 0x0390(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3E006934E84F95463C32F93DD1E2205;// 0x03A8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E7A025864B35D23530F8D6A0232A28AE;// 0x03D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B7C038594BD36C06C06AAD986BA35E2D;// 0x0400(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A79FB98C4B3B2C0E23AE888FAB392DF0;// 0x0430(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0AD514AF4A5533F15F0FF88546B2C628;// 0x0458(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_Root_30452E3E4F640E2330CBF4AB1DF8BFCF;      // 0x04B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6F901F24ED6BBA3F7C976B8F95C7142;// 0x04E0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6C6848344052F42DEFF77A479A60002;// 0x04F8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB1AB8EE43E01472F628A996D57C50C4;// 0x0510(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FED28B784BCAE1CB5C5042BB9597FA45;// 0x0528(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D94E63794E88E6890B1A08AE2E8C0729;// 0x0540(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC8A5AF74D5FCF19A2987382FFE8209A;// 0x0558(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D517F2944869A482C53BB86AC4B2538;// 0x0570(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B08F54834B46B0792DD16783F6C2C95A;// 0x0588(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07794385486FCE2CD56267AD65BCB4D5;// 0x05A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E4997CE453ADBA5731FBCA01986F79B;// 0x05B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078114B44705B4965D8CC19CF83482D8;// 0x05D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6041EF3945D4D656BF633B8A06E368F5;// 0x05E8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56ADDC4E40F4139C595860A6995B389D;// 0x0600(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_268C5C6049BF5416634D24BBDA5EF841;// 0x0630(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CBB68DA49463E1B0E080FAC0A67F1FB;// 0x0658(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E9B1C586436EDB0A89555ABB35F57F71;// 0x0688(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B05858B4497D5909176D56804EBFE511;// 0x06B0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_90DF6A6C4FBC89DD62E64D8F4CCD3F87;// 0x06E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0AD4B13A42411E402DF595BDDC53C319;// 0x0708(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7B1C0DC447090BE421376F924219E5A6;// 0x0738(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_340389654D440C47EF0F319D299F4421;// 0x0760(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34417;// 0x0790(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D50E792D4C24CB762F6E04BCF978D11A;// 0x07B8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34416;// 0x07E8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9677F75F4661C50D775186BCE29E603B;// 0x0810(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34415;// 0x0840(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B2937651488E7F9F38076BA4BFA157B0;// 0x0868(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34414;// 0x0898(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14DD041C43869B1A3462A68A9BF6B9AA;// 0x08C0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34413;// 0x08F0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEF510B2440CF5354A8621B30036919A;// 0x0918(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE34412;// 0x0948(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6F3B66224564E60C6462B8B329EF8099;// 0x0970(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A147C932449AB07A04155B8BD3AE3441;// 0x09A0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C3704A60491279CBCFCF5582F2457084;// 0x09C8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EC7E312549ECDB950A57C4B0DF17446C;// 0x09F8(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1391D33E47FB4152FF22119B88754ADA;// 0x0A20(0x0060)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0B4478E64CE45E8B98D514B0B25EF402;// 0x0A80(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9A05681644F8842378B070B1295021C5;      // 0x0AD0(0x0038)
	bool                                               IsRunning;                                                // 0x0B08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTargeting;                                              // 0x0B09(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsMoving;                                                // 0x0B0A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0B0B(0x0001) MISSED OFFSET
	float                                              MovementAnimRate;                                         // 0x0B0C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsInventory;                                             // 0x0B10(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0B11(0x0007) MISSED OFFSET
	double                                             LastSwimmingTime;                                         // 0x0B18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSwimming;                                              // 0x0B20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0B21(0x0003) MISSED OFFSET
	float                                              DesiredSpinnerRotation;                                   // 0x0B24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CurrentSpinnerRotation;                                   // 0x0B28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpinnerRotationSpeed;                                     // 0x0B2C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NextSlotToFire;                                           // 0x0B30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IdlePoseSlotBlendTime;                                    // 0x0B34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimeBeforeSlotTransitionToFinish;                         // 0x0B38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SlotTransitionPlayRate;                                   // 0x0B3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue;                     // 0x0B40(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue2;                    // 0x0B41(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue3;                    // 0x0B42(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue4;                    // 0x0B43(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;       // 0x0B44(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue5;                    // 0x0B48(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x0B49(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_NotEqual_IntInt_ReturnValue6;                    // 0x0B4A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x0B4B(0x0001) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;      // 0x0B4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x0B50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0B51(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3;      // 0x0B54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue3;                    // 0x0B58(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0B59(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue4;      // 0x0B5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue4;                    // 0x0B60(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0B61(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue5;      // 0x0B64(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue5;                    // 0x0B68(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0B69(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue6;      // 0x0B6C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0B70(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue6;                    // 0x0B71(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x0B72(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x0B74(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x0B78(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterWeapon*                              K2Node_DynamicCast_AsShooterWeapon;                       // 0x0B80(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0B88(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x7];                                       // 0x0B89(0x0007) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                        // 0x0B90(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x0B98(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x0BA0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x0BA1(0x0003) MISSED OFFSET
	struct FRotator                                    CallFunc_K2_GetActorRotation_ReturnValue;                 // 0x0BA4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Conv_RotatorToVector_ReturnValue;                // 0x0BB0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_GetDefaultMovementSpeed_ReturnValue;             // 0x0BBC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_GetCurrentAcceleration_ReturnValue;              // 0x0BC0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     CallFunc_Normal_ReturnValue;                              // 0x0BCC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Dot_VectorVector_ReturnValue;                    // 0x0BD8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x0BDC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x0BE0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x0BE4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue;                  // 0x0BE8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue2;                 // 0x0BE9(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x0BEA(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x1];                                       // 0x0BEB(0x0001) MISSED OFFSET
	struct FVector2D                                   CallFunc_Conv_VectorToVector2D_ReturnValue;               // 0x0BEC(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSize_ReturnValue;                               // 0x0BF4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_VSize2D_ReturnValue;                             // 0x0BF8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue3;                 // 0x0BFC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x0BFD(0x0003) MISSED OFFSET
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x0C00(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Greater_FloatFloat_ReturnValue4;                 // 0x0C04(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x0C05(0x0003) MISSED OFFSET
	float                                              CallFunc_FClamp_ReturnValue;                              // 0x0C08(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_EqualEqual_ByteByte_ReturnValue;                 // 0x0C0C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsTargeting_ReturnValue;                         // 0x0C0D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0C0E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x0C0F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x0C10(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x0C11(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x6];                                       // 0x0C12(0x0006) MISSED OFFSET
	double                                             CallFunc_GetGameTimeInSeconds_ReturnValue;                // 0x0C18(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	double                                             CallFunc_Subtract_DoubleDouble_ReturnValue;               // 0x0C20(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Conv_DoubleToFloat_ReturnValue;                  // 0x0C28(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue7;                    // 0x0C2C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x0C2D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x0C2E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x1];                                       // 0x0C2F(0x0001) MISSED OFFSET
	float                                              CallFunc_FInterpTo_ReturnValue;                           // 0x0C30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x4];                                       // 0x0C34(0x0004) MISSED OFFSET
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue2;                     // 0x0C38(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AWeapTekGrenadeLauncher_C*                   K2Node_DynamicCast_AsWeapTekGrenadeLauncher_C;            // 0x0C40(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast3_CastSuccess;                          // 0x0C48(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData17[0x3];                                       // 0x0C49(0x0003) MISSED OFFSET
	float                                              CallFunc_Conv_IntToFloat_ReturnValue;                     // 0x0C4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Conv_IntToFloat_ReturnValue2;                    // 0x0C50(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x0C54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue;                 // 0x0C58(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Multiply_FloatFloat_ReturnValue2;                // 0x0C5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Add_FloatFloat_ReturnValue;                      // 0x0C60(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass SK_TekGrenadeLauncher_FPV_AnimBlueprint.SK_TekGrenadeLauncher_FPV_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3108();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3107();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3106();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3105();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3104();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3103();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3102();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3101();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3100();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3099();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3098();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3097();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3096();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_3095();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7138();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7137();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7136();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7135();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7134();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint_AnimGraphNode_SequencePlayer_7133();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void ExecuteUbergraph_SK_TekGrenadeLauncher_FPV_AnimBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
