#pragma once

// ARKSurvivalEvolved (320.18) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ARKSurvivalEvolved_FPV_Drill_AnimBP_structs.hpp"

namespace sdk
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FPV_Drill_AnimBP.FPV_Drill_AnimBP_C
// 0x077E (0x0ABE - 0x0340)
class UFPV_Drill_AnimBP_C : public UAnimInstance
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_FFA1BC4148F91CE2ACE4BC9D68C6ADA7;      // 0x0340(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_93E2593F422B8B491DB7629CB5DBBDEA;      // 0x0368(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43E9861A4BADB16973A07A948C4A2DB8;// 0x03A0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D40A75A4BB7181093CB46A7130986A4;// 0x03B8(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C3B037B460D133623B0BC9B2E8512E1;// 0x03D0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6403F57C446A31CC75DDF393F2F6BD90;// 0x0400(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35D029AF4CC73F646F81F195915D349D;// 0x0460(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_088A9B8F4DBF481F249ECEA6E519B6C9;// 0x0490(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A534DD9F40907831B9BC0299172B2869;// 0x04B8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22E700A84AB6B4A5E02053A7A48986D0;// 0x04D0(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B87C2E5647D4817FADA7ADBB635C56DE;// 0x04E8(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68D5276F4310B9A33928619286DC699F;// 0x0500(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8401251149B723DA80EC89BDEABA8634;// 0x0518(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0A92BEA468149332E2F56A7A9DA9937;// 0x0530(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF5F62A34CD6F91F22607C93EEF9E090;// 0x0548(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_687A7FBA45C143383A0E938BB15B7AA6;// 0x0560(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C541DBCE457BFA08C1B8F99B170A51B7;// 0x0578(0x0018)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77ACD40D42D7EAE189B56BA8D426EF63;// 0x0590(0x0018)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_64D551CA44E437686AB7DB97D3BCD94F;// 0x05A8(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6A9884A49F7F31AFF01FDB36C8F2BCE;// 0x05D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C09D78D74291FF3C35C63689BD6399C3;// 0x0600(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_36BDADB24B12A790A8A251BB49446192;// 0x0630(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C753E04D4D930B09B145A0AD1FCBD8A8;// 0x0658(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2B4C41164E5EABFB56643A995DABF868;// 0x0688(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC75922643A8B948DEB8CAB1449990F1;// 0x06B0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C6C4B294C110D4882F65A823989E309;// 0x06E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BAE02A5542549077E831DB810C458124;// 0x0708(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_19FB319F47D6B7D499239297BAF461DA;// 0x0738(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6FE71D0F4DA239BA284C64980CF3DFEF;// 0x0760(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_843AE7664871ABD6CA2FBB842BE2BB4F;// 0x0790(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_814AEA7D452EC4705AE71D9B08EEF8ED;// 0x07B8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A6F26E1C41DA98963449A585A3177294;// 0x0818(0x0028)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0B4AE1C347AB2ABA4F701EBBF708040F;// 0x0840(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41243FFF4C8F5791A9D7AE9B77E5E5A5;// 0x08A0(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_82073FC84A59C08FAEE2A78C9DAD8F22;// 0x08D0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_533AD21749C7B0AB9F62B58F87744848;// 0x0920(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_02BD55CC44BF623DA3392996656B9271;// 0x0950(0x0050)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_49458F4848A209205C51CC903B0B437E;// 0x09A0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7FEC9E54FC95DB76517CAB2D7C1979A;// 0x09F0(0x0030)
	bool                                               IsRunning;                                                // 0x0A20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTargeting;                                              // 0x0A21(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0A22(0x0006) MISSED OFFSET
	class AWeapMiningDrill_C*                          WeapMiningDrill;                                          // 0x0A28(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class AShooterCharacter*                           Player;                                                   // 0x0A30(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsActivated;                                              // 0x0A38(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsOverheated;                                             // 0x0A39(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFiring;                                                 // 0x0A3A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0A3B(0x0001) MISSED OFFSET
	float                                              Heat;                                                     // 0x0A3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FanRate;                                                  // 0x0A40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScreenAlpha;                                              // 0x0A44(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsActivationAnimPlaying;                                  // 0x0A48(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsDeactivating;                                           // 0x0A49(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsActivating;                                             // 0x0A4A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue;                         // 0x0A4B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue2;                        // 0x0A4C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue3;                        // 0x0A4D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue;                          // 0x0A4E(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanOR_ReturnValue;                           // 0x0A4F(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue4;                        // 0x0A50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue2;                         // 0x0A51(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0A52(0x0002) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;       // 0x0A54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue;                     // 0x0A58(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0A59(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;      // 0x0A5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue2;                    // 0x0A60(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0A61(0x0003) MISSED OFFSET
	float                                              CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3;      // 0x0A64(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Less_FloatFloat_ReturnValue3;                    // 0x0A68(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue5;                        // 0x0A69(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x0A6A(0x0002) MISSED OFFSET
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x0A6C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AActor*                                      CallFunc_GetOwningActor_ReturnValue;                      // 0x0A70(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AWeapMiningDrill_C*                          K2Node_DynamicCast_AsWeapMiningDrill_C;                   // 0x0A78(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_CastSuccess;                           // 0x0A80(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x0A81(0x0007) MISSED OFFSET
	class AShooterCharacter*                           CallFunc_GetPawnOwner_ReturnValue;                        // 0x0A88(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AShooterCharacter*                           K2Node_DynamicCast_AsShooterCharacter;                    // 0x0A90(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast2_CastSuccess;                          // 0x0A98(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsRunning_ReturnValue;                           // 0x0A99(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_Not_PreBool_ReturnValue6;                        // 0x0A9A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue3;                         // 0x0A9B(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsTargeting_ReturnValue;                         // 0x0A9C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsFiring_ReturnValue;                            // 0x0A9D(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x0A9E(0x0002) MISSED OFFSET
	float                                              CallFunc_Add_FloatFloat_ReturnValue;                      // 0x0AA0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue;                   // 0x0AA4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_Divide_FloatFloat_ReturnValue2;                  // 0x0AA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue;                         // 0x0AAC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_SelectFloat_ReturnValue2;                        // 0x0AB0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsActivationAnimPlaying_ReturnValue;             // 0x0AB4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x0AB5(0x0003) MISSED OFFSET
	float                                              CallFunc_FInterpTo_ReturnValue;                           // 0x0AB8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue4;                         // 0x0ABC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_BooleanAND_ReturnValue5;                         // 0x0ABD(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FPV_Drill_AnimBP.FPV_Drill_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2028();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2027();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_BlendListByBool_4974();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2026();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2025();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2024();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2023();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2022();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2021();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2020();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2019();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2018();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_TransitionResult_2017();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_ApplyAdditive_444();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_SequencePlayer_5949();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_Drill_AnimBP_AnimGraphNode_ApplyAdditive_442();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void ExecuteUbergraph_FPV_Drill_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
